
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1. 前言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    1. 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    2. 背景：C++ 的 1979–2006
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    3. C++ 标准委员会
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    4. C++11：感觉像是门新语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    5. C++14：完成 C++11
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    6. 概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    7. 错误处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08.html">
            
                <a href="08.html">
            
                    
                    8. C++17：大海迷航
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09.html">
            
                <a href="09.html">
            
                    
                    9. C++20：方向之争
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10. 2020 年的 C++
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11. 回顾
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >1. 前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="1-&#x524D;&#x8A00;">1. &#x524D;&#x8A00;</h1>
<p>&#x6700;&#x521D;&#xFF0C;&#x6211;&#x8BBE;&#x8BA1; C++ &#x662F;&#x4E3A;&#x4E86;&#x56DE;&#x7B54;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x4F55;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x786C;&#x4EF6;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x652F;&#x6301;&#x9AD8;&#x6548;&#x3001;&#x9AD8;&#x7EA7;&#x7684;&#x62BD;&#x8C61;&#xFF1F;C++ &#x5728; 1980 &#x5E74;&#x4EE3;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E; C &#x548C; Simula &#x8BED;&#x8A00;&#x529F;&#x80FD;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5728;&#x5F53;&#x65F6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x4F5C;&#x4E3A;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x7684;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x7ECF;&#x8FC7;&#x591A;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5DF2;&#x7ECF;&#x6210;&#x957F;&#x4E3A;&#x4E00;&#x4E2A;&#x8FDC;&#x6BD4;&#x5F53;&#x5E74;&#x66F4;&#x590D;&#x6742;&#x548C;&#x6709;&#x6548;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5E94;&#x7528;&#x6781;&#x5176;&#x5E7F;&#x6CDB;&#x3002;&#x5B83;&#x4FDD;&#x6301;&#x4E86;&#x5982;&#x4E0B;&#x4E24;&#x65B9;&#x9762;&#x7684;&#x5173;&#x6CE8;&#xFF1A;</p>
<ul>
<li><strong>&#x8BED;&#x8A00;&#x6784;&#x4EF6;&#x5230;&#x786C;&#x4EF6;&#x8BBE;&#x65BD;&#x7684;&#x76F4;&#x63A5;&#x6620;&#x5C04;</strong></li>
<li><strong>&#x96F6;&#x5F00;&#x9500;&#x62BD;&#x8C61;</strong></li>
</ul>
<p>&#x8FD9;&#x79CD;&#x7EC4;&#x5408;&#x662F; C++ &#x533A;&#x522B;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x7684;&#x51B3;&#x5B9A;&#x6027;&#x7279;&#x5F81;&#x3002;&#x201C;&#x96F6;&#x5F00;&#x9500;&#x201D;&#x662F;&#x8FD9;&#x6837;&#x89E3;&#x91CA;&#x7684; [Stroustrup 1994]&#xFF1A;</p>
<ul>
<li>&#x4F60;&#x4E0D;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x4EE3;&#x4EF7;&#xFF08;&#x201C;&#x6CA1;&#x6709;&#x56DB;&#x5904;&#x6563;&#x843D;&#x7684;&#x8D58;&#x8089;&#x201D;&#xFF09;&#x3002;</li>
<li>&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x624B;&#x5DE5;&#x5199;&#x4EE3;&#x7801;&#x4E5F;&#x4E0D;&#x4F1A;&#x66F4;&#x597D;&#x3002;</li>
</ul>
<p>&#x62BD;&#x8C61;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x4F53;&#x73B0;&#x4E3A;&#x51FD;&#x6570;&#x3001;&#x7C7B;&#x3001;&#x6A21;&#x677F;&#x3001;&#x6982;&#x5FF5;&#x548C;&#x522B;&#x540D;&#x3002;</p>
<p>C++ &#x662F;&#x4E00;&#x79CD;&#x6D3B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4F1A;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x4EE5;&#x5E94;&#x5BF9;&#x65B0;&#x51FA;&#x73B0;&#x7684;&#x6311;&#x6218;&#x548C;&#x6F14;&#x53D8;&#x4E2D;&#x7684;&#x4F7F;&#x7528;&#x98CE;&#x683C;&#x3002;2006 &#x5E74;&#x81F3; 2020 &#x5E74;&#x671F;&#x95F4;&#x7684;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x548C;&#x53D8;&#x5316;&#x662F;&#x672C;&#x6587;&#x7684;&#x91CD;&#x70B9;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF1B;&#x662F;&#x4EBA;&#x4EEC;&#x6539;&#x53D8;&#x4E86;&#x5B83;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x662F;&#x53C2;&#x4E0E; C++ &#x6F14;&#x5316;&#x7684;&#x4EBA;&#x4EEC;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BC6;&#x522B;&#x51FA;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x8BE0;&#x91CA;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x5C40;&#x9650;&#xFF0C;&#x7EC4;&#x7EC7;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#xFF0C;&#x5E76;&#x89E3;&#x51B3;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x5FC5;&#x7136;&#x51FA;&#x73B0;&#x7684;&#x5206;&#x6B67;&#x3002;&#x5F53;&#x6211;&#x5448;&#x73B0;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x6216;&#x6807;&#x51C6;&#x5E93;&#x7279;&#x6027;&#x65F6;&#xFF0C;&#x5176;&#x80CC;&#x666F;&#x662F; C++ &#x7684;&#x4E00;&#x822C;&#x53D1;&#x5C55;&#x548C;&#x5F53;&#x65F6;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x5173;&#x5207;&#x3002;&#x5BF9;&#x4E8E;&#x5728;&#x65E9;&#x671F;&#x88AB;&#x63A5;&#x53D7;&#x7684;&#x8BB8;&#x591A;&#x7279;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4ECE;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x4E1A;&#x4F7F;&#x7528;&#x4E2D;&#x83B7;&#x5F97;&#x4E86;&#x540E;&#x89C1;&#x4E4B;&#x660E;&#x3002;</p>
<p>C++ &#x4E3B;&#x8981;&#x662F;&#x4E00;&#x79CD;&#x5DE5;&#x4E1A;&#x8BED;&#x8A00;&#xFF0C;&#x4E00;&#x79CD;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;C++ &#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x79CD;&#x7531;&#x89C4;&#x8303;&#x5B9A;&#x4E49;&#x7684;&#x8BED;&#x8A00;&#xFF1B;&#x5B83;&#x662F;&#x7531;&#x8BB8;&#x591A;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x7684;&#x5DE5;&#x5177;&#x96C6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li>&#x8BED;&#x8A00;</li>
<li>&#x6807;&#x51C6;&#x5E93;</li>
<li>&#x8BB8;&#x591A;&#x7684;&#x5176;&#x4ED6;&#x5E93;</li>
<li>&#x5E9E;&#x5927;&#x7684;&#x2014;&#x2014;&#x5E38;&#x5E38;&#x662F;&#x65E7;&#x7684;&#x2014;&#x2014;&#x4EE3;&#x7801;&#x5E93;</li>
<li>&#x5DE5;&#x5177;&#xFF08;&#x5305;&#x62EC;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#xFF09;</li>
<li>&#x6559;&#x5B66;&#x548C;&#x57F9;&#x8BAD;</li>
<li>&#x793E;&#x533A;&#x652F;&#x6301;</li>
</ul>
<p>&#x53EA;&#x8981;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x53EA;&#x8981;&#x5408;&#x9002;&#xFF0C;&#x6211;&#x5C31;&#x4F1A;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x79CD;&#x6D41;&#x4F20;&#x5E7F;&#x6CDB;&#x7684;&#x8C2C;&#x89C1;&#xFF0C;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x7B80;&#x5355;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x3001;&#x4E0D;&#x5F97;&#x4E0D;&#x8BBE;&#x8BA1;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BFE;&#x7A0B;&#x3001;&#x6216;&#x662F;&#x5728;&#x5B66;&#x672F;&#x8BBA;&#x6587;&#x4E2D;&#x63CF;&#x8FF0;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x8FFD;&#x6C42;&#x7B80;&#x5355;&#x663E;&#x7136;&#x662F;&#x5B9E;&#x60C5;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x8BA9;&#x8BED;&#x8A00;&#x5E72;&#x51C0;&#x5730;&#x4F53;&#x73B0;&#x4E00;&#x4E9B;&#x660E;&#x786E;&#x7684;&#x539F;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4E5F;&#x662F;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x7126;&#x70B9;&#x4ECE;&#x5B66;&#x4E60;&#x8F6C;&#x79FB;&#x5230;&#x4EA4;&#x4ED8;&#x548C;&#x7EF4;&#x62A4;&#x91CD;&#x8981;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x4ECE;&#x7B80;&#x5355;&#x8F6C;&#x79FB;&#x5230;&#x5168;&#x9762;&#x7684;&#x652F;&#x6301;&#x3001;&#x7A33;&#x5B9A;&#x6027;&#xFF08;&#x517C;&#x5BB9;&#x6027;&#xFF09;&#x548C;&#x719F;&#x6089;&#x5EA6;&#x3002;&#x4EBA;&#x4EEC;&#x603B;&#x662F;&#x6DF7;&#x6DC6;&#x719F;&#x6089;&#x5EA6;&#x548C;&#x7B80;&#x5355;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x7684;&#x8BDD;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x719F;&#x6089;&#x5EA6;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x770B;&#x5F85; C++ &#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x628A;&#x5B83;&#x770B;&#x6210;&#x51E0;&#x5341;&#x5E74;&#x6765;&#x4E09;&#x79CD;&#x76F8;&#x4E92;&#x77DB;&#x76FE;&#x7684;&#x8981;&#x6C42;&#x7684;&#x7ED3;&#x679C;&#xFF1A;</p>
<ul>
<li><strong>&#x8BA9;&#x8BED;&#x8A00;&#x66F4;&#x7B80;&#x5355;&#xFF01;</strong></li>
<li><strong>&#x7ACB;&#x5373;&#x6DFB;&#x52A0;&#x8FD9;&#x4E24;&#x4E2A;&#x5FC5;&#x8981;&#x7279;&#x6027;&#xFF01;&#xFF01;</strong></li>
<li><strong>&#x4E0D;&#x8981;&#x641E;&#x7838;&#x6211;&#x7684;&#xFF08;&#x4EFB;&#x4F55;&#xFF09;&#x4EE3;&#x7801;&#xFF01;&#xFF01;&#xFF01;</strong></li>
</ul>
<p>&#x6211;&#x6DFB;&#x52A0;&#x4E86;&#x611F;&#x53F9;&#x53F7;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x89C2;&#x70B9;&#x7684;&#x8868;&#x8FBE;&#x5E38;&#x5E38;&#x5E26;&#x7740;&#x4E0D;&#x5C0F;&#x7684;&#x60C5;&#x7EEA;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8BA9;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x7B80;&#x5355;&#x505A;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x60C5;&#x5E76;&#x975E;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5730;&#x96BE;&#x3002;&#x524D;&#x8005;&#x5BF9;&#x4E8E;&#x4E0D;&#x662F;&#x8BED;&#x8A00;&#x5F8B;&#x5E08;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF1B;&#x540E;&#x8005;&#x5BF9;&#x4E8E;&#x57FA;&#x7840;&#x6027;&#x4EE3;&#x7801;&#x7684;&#x5B9E;&#x73B0;&#x8005;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x7A33;&#x5B9A;&#x662F;&#x6240;&#x6709;&#x610F;&#x56FE;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#x51E0;&#x5341;&#x5E74;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x5C5E;&#x6027;&#xFF0C;&#x7136;&#x800C;&#x4E00;&#x79CD;&#x6D3B;&#x7684;&#x8BED;&#x8A00;&#x5FC5;&#x987B;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x4E16;&#x754C;&#x3002;</p>
<p>C++ &#x6709;&#x4E00;&#x4E9B;&#x603B;&#x4F53;&#x6784;&#x60F3;&#x3002;&#x6211;&#x9610;&#x8FF0;&#x4E86;&#x4E00;&#x4E9B;&#xFF08;&#x5982;&#x300A;C++ &#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x5316;&#x300B;&#xFF08;<em>The Design and Evolution of C++</em>&#xFF09;[Stroustrup 1994]&#xFF08;<a href="02.html#2-&#x80CC;&#x666F;c-&#x7684;-19792006">&#xA7;2</a>&#xFF09;&#x3001;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF08;<a href="09.html#91-&#x8BBE;&#x8BA1;&#x539F;&#x5219;">&#xA7;9.1</a>&#xFF09;&#xFF0C;&#x4EE5;&#x53CA; C++ &#x6A21;&#x578B;&#xFF08;<a href="11.html#111-c-&#x6A21;&#x578B;">&#xA7;11.1</a>&#xFF09;&#xFF09;&#x5E76;&#x8BD5;&#x56FE;&#x8BA9;&#x8BED;&#x8A00;&#x5728;&#x6F14;&#x5316;&#x65F6;&#x9075;&#x5FAA;&#x5B83;&#x4EEC;&#x3002;&#x7136;&#x800C;&#xFF0C;C++ &#x7684;&#x5F00;&#x53D1;&#x7531; ISO &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x63A7;&#x5236;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x957F;&#x957F;&#x7684;&#x65B0;&#x7279;&#x6027;&#x5217;&#x8868;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5B9E;&#x9645;&#x7EC6;&#x8282;&#x7684;&#x5173;&#x5FC3;&#x3002;&#x8FD9;&#x662F;&#x793E;&#x533A;&#x91CC;&#x6700;&#x80FD;&#x8868;&#x8FBE;&#x548C;&#x6700;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x4EBA;&#x6240;&#x575A;&#x6301;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EC5;&#x4EC5;&#x57FA;&#x4E8E;&#x54F2;&#x5B66;&#x6216;&#x7406;&#x8BBA;&#x89C2;&#x70B9;&#x5C31;&#x5426;&#x8BA4;&#x4ED6;&#x4EEC;&#x7684;&#x5173;&#x5207;&#x548C;&#x610F;&#x89C1;&#x7684;&#x8BDD;&#xFF0C;&#x6050;&#x6015;&#x5C31;&#x5931;&#x4E4B;&#x9C81;&#x83BD;&#x4E86;&#x3002;</p>
<h2 id="11-&#x5E74;&#x8868;">1.1 &#x5E74;&#x8868;</h2>
<p>&#x4E3A;&#x4E86;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x7684;&#x6982;&#x8FF0;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x7C97;&#x7565;&#x7684;&#x5E74;&#x8868;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x719F;&#x6089; C++&#xFF0C;&#x5F88;&#x591A;&#x672F;&#x8BED;&#x3001;&#x6784;&#x4EF6;&#x3001;&#x5E93;&#x90FD;&#x4F1A;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#xFF1B;&#x5927;&#x591A;&#x6570;&#x5728;&#x4EE5;&#x524D;&#x7684; HOPL &#x8BBA;&#x6587; [Stroustrup 1993, 2007] &#x6216;&#x672C;&#x6587;&#x4E2D;&#x6709;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x3002;</p>
<ul>
<li>1979 &#x5E74;&#xFF1A;&#x5DE5;&#x4F5C;&#x59CB;&#x4E8E;&#x201C;&#x5E26;&#x7C7B;&#x7684; C&#x201D;&#xFF0C;&#x5B83;&#x53D8;&#x6210;&#x4E86; C++&#xFF1B;&#x62E5;&#x6709;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x975E;&#x7814;&#x7A76;&#x6027;&#x7684;&#x7528;&#x6237;&#xFF1B;<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;<code>class</code>&#x3001;&#x6784;&#x9020;&#x51FD;&#x6570;/&#x6790;&#x6784;&#x51FD;&#x6570;&#x3001;<code>public</code>/<code>private</code>&#x3001;&#x7B80;&#x5355;&#x7EE7;&#x627F;&#x3001;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x68C0;&#x67E5;</li>
<li>&#x5E93;&#xFF1A;<code>task</code>&#xFF08;&#x534F;&#x7A0B;&#x548C;&#x4EFF;&#x771F;&#x652F;&#x6301;&#xFF09;&#x3001;&#x7528;&#x5B8F;&#x53C2;&#x6570;&#x5316;&#x7684; <code>vector</code></li>
</ul>
</li>
<li>1985 &#x5E74;&#xFF1A;C++ &#x7684;&#x9996;&#x6B21;&#x5546;&#x4E1A;&#x53D1;&#x884C;&#xFF1B;TC++PL1 [Stroustrup 1985b]<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;<code>virtual</code> &#x51FD;&#x6570;&#x3001;&#x8FD0;&#x7B97;&#x7B26;&#x91CD;&#x8F7D;&#x3001;&#x5F15;&#x7528;&#x3001;&#x5E38;&#x91CF;</li>
<li>&#x5E93;&#xFF1A;<code>complex</code> &#x7B97;&#x6CD5;&#xFF0C;&#x6D41;&#x8F93;&#x5165;&#x8F93;&#x51FA;</li>
</ul>
</li>
<li>1989&#x2013;91 &#x5E74;&#xFF1A;ANSI &#x548C; ISO &#x6807;&#x51C6;&#x5316;&#x5F00;&#x59CB;&#xFF1B;TC++PL2 [Stroustrup 1991]<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;&#x62BD;&#x8C61;&#x7C7B;&#x3001;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x3001;&#x5F02;&#x5E38;&#x3001;&#x6A21;&#x677F;</li>
<li>&#x5E93;&#xFF1A;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x6D41;&#xFF08;&#x4F46;&#x6CA1;&#x6709; <code>task</code>&#xFF09;</li>
</ul>
</li>
<li>1998 &#x5E74;&#xFF1A;C++98&#x3001;&#x7B2C;&#x4E00;&#x4E2A; ISO C++ &#x6807;&#x51C6; [Koenig1998]&#x3001;TC++PL3 [Stroustrup 1997]<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;<code>namespace</code>&#x3001;&#x5177;&#x540D;&#x7C7B;&#x578B;&#x8F6C;&#x6362;<sup><a href="#fn_1" id="reffn_1">1</a></sup>&#x3001;<code>bool</code>&#x3001;<code>dynamic_cast</code></li>
<li>&#x5E93;&#xFF1A;STL&#xFF08;&#x5BB9;&#x5668;&#x548C;&#x7B97;&#x6CD5;&#xFF09;&#x3001;<code>string</code>&#x3001;<code>bitset</code></li>
</ul>
</li>
<li>2011 &#x5E74;&#xFF1A;C++11 [Becker 2011]&#xFF0C;TC++PL4 [Stroustrup 2013]<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x3001;<code>auto</code>&#x3001;&#x8303;&#x56F4; <code>for</code>&#x3001;<code>constexpr</code>&#x3001;lambda &#x8868;&#x8FBE;&#x5F0F;&#x3001;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x5B57;&#x9762;&#x91CF;&#x2026;&#x2026;</li>
<li>&#x5E93;&#xFF1A;<code>thread</code> &#x548C;&#x9501;&#x3001;<code>future</code>&#x3001;<code>unique_ptr</code>&#x3001;<code>shared_ptr</code>&#x3001;<code>array</code>&#x3001;&#x65F6;&#x95F4;&#x548C;&#x65F6;&#x949F;&#x3001;&#x968F;&#x673A;&#x6570;&#x3001;&#x65E0;&#x5E8F;&#x5BB9;&#x5668;&#xFF08;&#x54C8;&#x5E0C;&#x8868;&#xFF09;&#x2026;&#x2026;</li>
</ul>
</li>
<li>2014 &#x5E74;&#xFF1A;C++14 [du Toit 2014]<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;&#x6CDB;&#x578B; lambda &#x8868;&#x8FBE;&#x5F0F;&#x3001;<code>constexpr</code> &#x51FD;&#x6570;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3001;&#x6570;&#x5B57;&#x5206;&#x9694;&#x7B26;&#x2026;&#x2026;</li>
<li>&#x5E93;&#xFF1A;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x5B57;&#x9762;&#x91CF;&#x2026;&#x2026;</li>
</ul>
</li>
<li>2017 &#x5E74;&#xFF1A;C++17 [Smith 2017]<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;&#x3001;&#x53D8;&#x91CF;&#x6A21;&#x677F;&#x3001;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x63A8;&#x5BFC;&#x2026;&#x2026;</li>
<li>&#x5E93;&#xFF1A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;<code>scoped_lock</code>&#x3001;<code>shared_mutex</code>&#xFF08;&#x8BFB;&#x5199;&#x9501;&#xFF09;&#x3001;<code>any</code>&#x3001;<code>variant</code>&#x3001;<code>optional</code>&#x3001;<code>string_view</code>&#x3001;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x2026;&#x2026;</li>
</ul>
</li>
<li>2020 &#x5E74;&#xFF1A;C++20 [Smith 2020]<ul>
<li>&#x8BED;&#x8A00;&#xFF1A;<code>concept</code>&#x3001;<code>module</code>&#x3001;&#x534F;&#x7A0B;&#x3001;&#x4E09;&#x8DEF;&#x6BD4;&#x8F83;&#x3001;&#x6539;&#x8FDB;&#x5BF9;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x7684;&#x652F;&#x6301;&#x2026;&#x2026;</li>
<li>&#x5E93;&#xFF1A;&#x6982;&#x5FF5;&#x3001;&#x8303;&#x56F4;&#x3001;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x533A;&#x3001;<code>span</code>&#x3001;&#x683C;&#x5F0F;&#x3001;&#x6539;&#x8FDB;&#x7684;&#x5E76;&#x53D1;&#x548C;&#x5E76;&#x884C;&#x652F;&#x6301;&#x2026;&#x2026;</li>
</ul>
</li>
</ul>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x65E9;&#x5E74; C++ &#x7684;&#x5E93;&#x662F;&#x5F88;&#x532E;&#x4E4F;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F53;&#x65F6;&#x8FD8;&#x662F;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5E93;&#xFF08;&#x5305;&#x62EC;&#x56FE;&#x5F62;&#x7528;&#x6237;&#x754C;&#x9762;&#x5E93;&#xFF09;&#xFF0C;&#x4F46;&#x5F88;&#x5C11;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x591A;&#x5E93;&#x662F;&#x4E13;&#x6709;&#x8F6F;&#x4EF6;&#x3002;&#x8FD9;&#x662F;&#x5728;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x666E;&#x53CA;&#x4E4B;&#x524D;&#x7684;&#x4E8B;&#x3002;&#x8FD9;&#x9020;&#x6210;&#x4E86; C++ &#x793E;&#x533A;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x5171;&#x4EAB;&#x57FA;&#x7840;&#x5E93;&#x3002;&#x5728;&#x6211;&#x7684; HOPL2 &#x8BBA;&#x6587; [Stroustrup 1993] &#x7684;&#x56DE;&#x987E;&#x4E2D;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x90A3;&#x662F;&#x65E9;&#x671F; C++ &#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x4EFB;&#x52A1;&#x5E93; [Stroustrup 1985a,c] &#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x534F;&#x7A0B;&#x7684;&#x5E93;&#xFF0C;&#x652F;&#x6301;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x4EFF;&#x771F;&#xFF08;&#x4F8B;&#x5982;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#xFF09;&#xFF0C;&#x4E0E;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x76F8;&#x6BD4;&#x662F;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728;&#x5F88;&#x5C0F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x5728; 256KB &#x7684;&#x5185;&#x5B58;&#x4E2D;&#x8FD0;&#x884C;&#x4E86; 700 &#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x4EFF;&#x771F;&#x3002;&#x4EFB;&#x52A1;&#x5E93;&#x5728; C++ &#x65E9;&#x671F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x662F;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x548C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x8BB8;&#x591A;&#x91CD;&#x8981;&#x5E94;&#x7528;&#x7684;&#x57FA;&#x7840;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B83;&#x6709;&#x70B9;&#x4E11;&#x964B;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5BB9;&#x6613;&#x79FB;&#x690D;&#x5230; Sun &#x7684; SPARC &#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x56E0;&#x6B64;&#x5927;&#x591A;&#x6570; 1989 &#x5E74;&#x4EE5;&#x540E;&#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x4E0D;&#x652F;&#x6301;&#x5B83;&#x3002;2020 &#x5E74;&#xFF0C;&#x534F;&#x7A0B;&#x624D;&#x521A;&#x521A;&#x56DE;&#x5F52;&#xFF08;<a href="09.html#932-&#x534F;&#x7A0B;">&#xA7;9.3.2</a>&#xFF09;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;C++ &#x7684;&#x7279;&#x6027;&#x4E0D;&#x65AD;&#x589E;&#x591A;&#x3002;ISO &#x59D4;&#x5458;&#x4F1A;&#x4E5F;&#x5E9F;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#xFF0C;&#x5BF9;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x4E86;&#x7A0D;&#x8BB8;&#x6E05;&#x7406;&#xFF0C;&#x4F46;&#x662F;&#x8003;&#x8651;&#x5230; C++ &#x7684;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#xFF08;&#x6570;&#x5341;&#x4EBF;&#x884C;&#x4EE3;&#x7801;&#xFF09;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x7279;&#x6027;&#x662F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x79FB;&#x9664;&#x7684;&#x3002;&#x7A33;&#x5B9A;&#x6027;&#x4E5F;&#x662F; C++ &#x7684;&#x5173;&#x952E;&#x7279;&#x6027;&#x3002;&#x8981;&#x89E3;&#x51B3;&#x8DDF;&#x8BED;&#x8A00;&#x4E0D;&#x65AD;&#x589E;&#x957F;&#x7684;&#x89C4;&#x6A21;&#x548C;&#x590D;&#x6742;&#x6027;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x529E;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;&#x901A;&#x8FC7;&#x7F16;&#x7801;&#x6307;&#x5357;&#xFF08;<a href="10.html#106-&#x7F16;&#x7801;&#x6307;&#x5357;">&#xA7;10.6</a>&#xFF09;&#x3002;</p>
<h2 id="12-&#x6982;&#x8FF0;">1.2 &#x6982;&#x8FF0;</h2>
<p>&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x662F;&#x6309;&#x7167; ISO &#x6807;&#x51C6;&#x53D1;&#x5E03;&#x7684;&#x5927;&#x81F4;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x7EC4;&#x7EC7;&#x7684;&#x3002;</p>
<ul>
<li><a href="#1-&#x524D;&#x8A00;">&#xA7;1</a>&#xFF1A;&#x524D;&#x8A00;</li>
<li><a href="02.html#2-&#x80CC;&#x666F;c-&#x7684;-19792006">&#xA7;2</a>&#xFF1A;&#x80CC;&#x666F;&#xFF1A;C++ &#x7684; 1979&#x2013;2006</li>
<li><a href="03.html#3-c-&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;">&#xA7;3</a>&#xFF1A;C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;</li>
<li><a href="04.html#4-c11&#x611F;&#x89C9;&#x50CF;&#x662F;&#x95E8;&#x65B0;&#x8BED;&#x8A00;">&#xA7;4</a>&#xFF1A;C++11&#xFF1A;&#x611F;&#x89C9;&#x50CF;&#x662F;&#x95E8;&#x65B0;&#x8BED;&#x8A00;</li>
<li><a href="05.html#5-c14&#x5B8C;&#x6210;-c11">&#xA7;5</a>&#xFF1A;C++14&#xFF1A;&#x5B8C;&#x6210; C++11</li>
<li><a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF1A;&#x6982;&#x5FF5;</li>
<li><a href="07.html#7-&#x9519;&#x8BEF;&#x5904;&#x7406;">&#xA7;7</a>&#xFF1A;&#x9519;&#x8BEF;&#x5904;&#x7406;</li>
<li><a href="08.html#8-c17&#x5927;&#x6D77;&#x8FF7;&#x822A;">&#xA7;8</a>&#xFF1A;C++17&#xFF1A;&#x5927;&#x6D77;&#x8FF7;&#x822A;</li>
<li><a href="09.html#9-c20&#x65B9;&#x5411;&#x4E4B;&#x4E89;">&#xA7;9</a>&#xFF1A;C++20&#xFF1A;&#x65B9;&#x5411;&#x4E4B;&#x4E89;</li>
<li><a href="10.html#10-2020-&#x5E74;&#x7684;-c">&#xA7;10</a>&#xFF1A;2020 &#x5E74;&#x7684; C++</li>
<li><a href="11.html#11-&#x56DE;&#x987E;">&#xA7;11</a>&#xFF1A;&#x56DE;&#x987E;</li>
</ul>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x8DE8;&#x8D8A;&#x4E86;&#x4E00;&#x6BB5;&#x8F83;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x6982;&#x5FF5;&#x201D;&#x548C;&#x6807;&#x51C6;&#x5316;&#x6D41;&#x7A0B;&#xFF0C;&#x6211;&#x4F1A;&#x628A;&#x5B83;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x8BA9;&#x5185;&#x5BB9;&#x4F18;&#x5148;&#x4E8E;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x7279;&#x522B;&#x957F;&#xFF0C;&#x771F;&#x662F;&#x4E00;&#x7BC7;&#x4E13;&#x9898;&#x8BBA;&#x6587;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x4ECE; 2006 &#x5E74;&#x5230; 2020 &#x5E74;&#xFF0C;C++ &#x7ECF;&#x5386;&#x4E86;&#x4E24;&#x6B21;&#x4E3B;&#x8981;&#x4FEE;&#x8BA2;&#xFF1A;C++11 &#x548C; C++20&#xFF1B;&#x800C;&#x8BBA;&#x6587;&#x7684;&#x65E9;&#x671F;&#x8BFB;&#x8005;&#x4EEC;&#x4E5F;&#x90FD;&#x8981;&#x6C42;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x8BBA;&#x6587;&#x7684;&#x9875;&#x6570;&#x51E0;&#x4E4E;&#x7FFB;&#x500D;&#x3002;&#x5373;&#x4F7F;&#x4EE5;&#x76EE;&#x524D;&#x7684;&#x7BC7;&#x5E45;&#xFF0C;&#x8BFB;&#x8005;&#x4E5F;&#x4F1A;&#x53D1;&#x73B0;&#x67D0;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x4E3B;&#x9898;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x5145;&#x5206;&#x7684;&#x5C55;&#x73B0;&#xFF0C;&#x5982;&#x5E76;&#x53D1;&#x548C;&#x6807;&#x51C6;&#x5E93;&#x3002;</p>
<blockquote id="fn_1">
<sup>1</sup>. &#x8BD1;&#x6CE8;&#xFF1A;&#x5373;&#x65B0;&#x7684;&#x3001;&#x975E; C &#x98CE;&#x683C;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02.html" class="navigation navigation-next " aria-label="Next page: 2. 背景：C++ 的 1979–2006">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1. 前言","level":"1.2","depth":1,"next":{"title":"2. 背景：C++ 的 1979–2006","level":"1.3","depth":1,"path":"02.md","ref":"02.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"01.md","mtime":"2023-07-06T11:17:01.970Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-07-06T11:29:00.567Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

