
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2. 背景：C++ 的 1979–2006 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="03.html" />
    
    
    <link rel="prev" href="01.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    1. 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    2. 背景：C++ 的 1979–2006
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    3. C++ 标准委员会
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    4. C++11：感觉像是门新语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    5. C++14：完成 C++11
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    6. 概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    7. 错误处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08.html">
            
                <a href="08.html">
            
                    
                    8. C++17：大海迷航
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09.html">
            
                <a href="09.html">
            
                    
                    9. C++20：方向之争
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10. 2020 年的 C++
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11. 回顾
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >2. 背景：C++ 的 1979–2006</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2-&#x80CC;&#x666F;&#xFF1A;c-&#x7684;-1979&#x2013;2006">2. &#x80CC;&#x666F;&#xFF1A;C++ &#x7684; 1979&#x2013;2006</h1>
<p>C++ &#x4ECE; 1979 &#x5E74;&#x5230; 2006 &#x5E74;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x5728;&#x6211;&#x7684; HOPL &#x8BBA;&#x6587;&#x4E2D; [Stroustrup 1993, 2007]&#x3002;&#x5728;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;C++ &#x4ECE;&#x4E00;&#x4E2A;&#x5355;&#x4EBA;&#x7684;&#x7814;&#x7A76;&#x9879;&#x76EE;&#x6210;&#x957F;&#x4E3A;&#x5927;&#x7EA6;&#x6709; 300 &#x4E07;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x793E;&#x533A;&#x3002;</p>
<h2 id="21-&#x7B2C;&#x4E00;&#x4E2A;&#x5341;&#x5E74;">2.1 &#x7B2C;&#x4E00;&#x4E2A;&#x5341;&#x5E74;</h2>
<p>&#x540E;&#x6765;&#x6210;&#x4E3A;&#x4E86; C++ &#x7684;&#x4E1C;&#x897F;&#x59CB;&#x4E8E; 1979 &#x5E74; 4 &#x6708;&#xFF0C;&#x540D;&#x4E3A;<strong>&#x5E26;&#x7C7B;&#x7684; C</strong>&#xFF08;C with Classes&#xFF09;&#x3002;&#x6211;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x65E2;&#x62E5;&#x6709;&#x76F4;&#x63A5;&#x800C;&#x9AD8;&#x6548;&#x7684;&#x5904;&#x7406;&#x786C;&#x4EF6;&#x7684;&#x80FD;&#x529B;&#xFF08;&#x4F8B;&#x5982;&#x7F16;&#x5199;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x5668;&#x3001;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x548C;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF09;&#xFF0C;&#x53C8;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x6709;&#x7C7B;&#x4F3C; Simula &#x7684;&#x529F;&#x80FD;&#x6765;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#xFF08;&#x4F8B;&#x5982;&#x201C;&#x5F3A;&#x201D;&#x9759;&#x6001;&#x53EF;&#x6269;&#x5C55;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3001;&#x7C7B;&#x3001;&#x591A;&#x7EA7;&#x7C7B;&#x548C;&#x534F;&#x7A0B;&#xFF09;&#x3002;&#x6211;&#x60F3;&#x7528;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x7F16;&#x5199;&#x4E00;&#x7248; Unix &#x5185;&#x6838;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x901A;&#x8FC7;&#x5C40;&#x57DF;&#x7F51;&#x6216;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x4E92;&#x8054;&#x7684;&#x591A;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x6211;&#x9009;&#x62E9; C &#x4F5C;&#x4E3A;&#x6211;&#x5DE5;&#x4F5C;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8DB3;&#x591F;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x529E;&#x516C;&#x5BA4;&#x91CC;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x7684;&#x652F;&#x6301;&#xFF1A;&#x6211;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x5C31;&#x5728; Dennis Ritchie &#x548C; Brian Kernighan &#x8D70;&#x5ECA;&#x5BF9;&#x9762;&#x3002;&#x7136;&#x800C;&#xFF0C;C &#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x8003;&#x8651;&#x7684;&#x552F;&#x4E00;&#x8BED;&#x8A00;&#x3002;Algol68 &#x5F53;&#x65F6;&#x6DF1;&#x6DF1;&#x5438;&#x5F15;&#x4E86;&#x6211;&#xFF0C;&#x6211;&#x8FD8;&#x662F; BCPL &#x548C;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x673A;&#x5668;&#x5C42;&#x9762;&#x7684;&#x8BED;&#x8A00;&#x7684;&#x4E13;&#x5BB6;&#x3002;C &#x540E;&#x6765;&#x7684;&#x5DE8;&#x5927;&#x6210;&#x529F;&#x5728;&#x5F53;&#x65F6;&#x8FD8;&#x5B8C;&#x5168;&#x4E0D;&#x786E;&#x5B9A;&#xFF0C;&#x4F46;&#x662F; Brian Kernighan &#x548C; Dennis Ritchie &#x6770;&#x51FA;&#x7684;&#x4ECB;&#x7ECD;&#x548C;&#x624B;&#x518C; [Kernighan and Ritchie1978] &#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#xFF0C;Unix &#x4E5F;&#x6B63;&#x5F00;&#x59CB;&#x5B83;&#x7684;&#x80DC;&#x5229;&#x8DEF;&#x7A0B;&#x3002;</p>
<p>&#x6700;&#x521D;&#x6211;&#x5B9E;&#x73B0;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x9884;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5B83;&#x5C06;&#x201C;&#x5E26;&#x7C7B;&#x7684; C&#x201D; &#x5DEE;&#x4E0D;&#x591A;&#x9010;&#x884C;&#x7FFB;&#x8BD1;&#x6210; C&#x3002;1982 &#x5E74;&#xFF0C;&#x5728;&#x201C;&#x5E26;&#x7C7B;&#x7684; C&#x201D;&#x7684;&#x7528;&#x6237;&#x6570;&#x91CF;&#x589E;&#x957F;&#x5230;&#x4E86;&#x51E0;&#x5341;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x663E;&#x5F97;&#x65E0;&#x6CD5;&#x628A;&#x63A7;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x53EB;&#x4F5C; <strong>Cfront</strong>&#xFF0C;1983 &#x5E74; 10 &#x6708;&#x7B2C;&#x4E00;&#x6B21;&#x7ED9;&#x522B;&#x4EBA;&#x4F7F;&#x7528;&#x3002;Cfront &#x662F;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x8BCD;&#x6CD5;&#x5206;&#x6790;&#x5668;&#x3001;&#x4E00;&#x4E2A;&#x6784;&#x5EFA;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x7684;&#x8BED;&#x6CD5;&#x5206;&#x6790;&#x5668;&#x3001;&#x4E00;&#x4E2A;&#x7528;&#x7C7B;&#x578B;&#x88C5;&#x9970;&#x8BED;&#x6CD5;&#x6811;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x91CD;&#x65B0;&#x6392;&#x5217; AST &#x4EE5;&#x63D0;&#x9AD8;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x671F;&#x6548;&#x7387;&#x7684;&#x9AD8;&#x5C42;&#x6B21;&#x4F18;&#x5316;&#x5668;&#x3002;&#x5173;&#x4E8E; Cfront &#x7684;&#x672C;&#x8D28;&#x6709;&#x5F88;&#x591A;&#x56F0;&#x60D1;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x65F6;&#x5B83;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x7684;&#x662F; C&#xFF08;&#x4F18;&#x5316;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x53EF;&#x8BFB;&#x7684; C&#xFF09;&#x3002;&#x6211;&#x751F;&#x6210;&#x4E86; C&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x5C31;&#x4E0D;&#x5FC5;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x5F53;&#x5E74;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x4F17;&#x591A;&#x7684;&#xFF08;&#x975E;&#x6807;&#x51C6;&#x5316;&#xFF09;&#x94FE;&#x63A5;&#x5668;&#x548C;&#x4F18;&#x5316;&#x5668;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;Cfront &#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x50CF;&#x4F20;&#x7EDF;&#x7684;&#x9884;&#x5904;&#x7406;&#x5668;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5386;&#x53F2;&#x535A;&#x7269;&#x9986;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x6536;&#x85CF; [McJones 2007&#x2013;2020] &#x4E2D;&#x627E;&#x5230;&#x4E00;&#x4EFD;&#x5E26;&#x6709;&#x6587;&#x6863;&#x7684; Cfront &#x6E90;&#x4EE3;&#x7801;&#x3002;Cfront &#x4ECE;&#x201C;&#x5E26;&#x7C7B;&#x7684; C&#x201D;&#x81EA;&#x4E3E;&#x4E3A; C++&#xFF0C;&#x6240;&#x4EE5;&#x7B2C;&#x4E00;&#x4E2A; C++ &#x7F16;&#x8BD1;&#x5668;&#x662F;&#x7528;&#xFF08;&#x7B80;&#x5355;&#x7684;&#xFF09;C++ &#x5199;&#x7684;&#xFF0C;&#x9002;&#x5408;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF08;&#x5185;&#x5B58;&#x5C0F;&#x4E8E; 1MB&#xFF0C;&#x5904;&#x7406;&#x5668;&#x901F;&#x5EA6;&#x5C0F;&#x4E8E; 1MHz&#xFF09;&#x3002;</p>
<p>&#x201C;&#x5E26;&#x7C7B;&#x7684; C&#x201D; &#x6DFB;&#x52A0;&#x5230; C &#x4E0A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x662F;&#x7C7B;&#x3002;&#x6211;&#x4ECE;&#x65E9;&#x671F;&#x5728; Simula &#x4E2D;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#x4E86;&#x89E3;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x5728; Simula &#x4E2D;&#xFF0C;&#x7C7B;&#x662F;&#x4E25;&#x683C;&#x9759;&#x6001;&#x3001;&#x4F46;&#x53C8;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x5173;&#x952E;&#x3002;&#x6211;&#x7ACB;&#x5373;&#x6DFB;&#x52A0;&#x4E86;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;&#x5B83;&#x4EEC;&#x5F53;&#x65F6;&#x975E;&#x5E38;&#x65B0;&#x9896;&#xFF0C;&#x4F46;&#x4ECE;&#x6211;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x67B6;&#x6784;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x80CC;&#x666F;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5B83;&#x4EEC;&#x4E5F;&#x4E0D;&#x7B97;&#x5F88;&#x65B0;&#x5947;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x673A;&#x5236;&#x6765;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#xFF08;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF09;&#x548C;&#x4E00;&#x4E2A;&#x9006;&#x64CD;&#x4F5C;&#x6765;&#x91CA;&#x653E;&#x8FD0;&#x884C;&#x671F;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#xFF08;&#x6790;&#x6784;&#x51FD;&#x6570;&#xFF09;&#x3002;&#x4EE5;&#x4E0B;&#x6458;&#x81EA;&#x6211; 1979 &#x5E74;&#x7684;&#x5B9E;&#x9A8C;&#x8BB0;&#x5F55;&#x672C;&#xFF1A;</p>
<blockquote>
<ul>
<li>&#x201C;new &#x51FD;&#x6570;&#x201D;&#x4E3A;&#x6210;&#x5458;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x8FD0;&#x884C;&#x7684;&#x73AF;&#x5883;</li>
<li>&#x201C;delete &#x51FD;&#x6570;&#x201D;&#x5219;&#x6267;&#x884C;&#x76F8;&#x53CD;&#x7684;&#x64CD;&#x4F5C;</li>
</ul>
</blockquote>
<p>&#x201C;new &#x51FD;&#x6570;&#x201D;&#x548C;&#x201C;delete &#x51FD;&#x6570;&#x201D;&#x8FD9;&#x4E24;&#x4E2A;&#x672F;&#x8BED;&#x662F;&#x201C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x201D;&#x548C;&#x201C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x201D;&#x7684;&#x539F;&#x59CB;&#x672F;&#x8BED;&#x3002;&#x76F4;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x8BA4;&#x4E3A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x662F; C++ &#x7684;&#x771F;&#x6B63;&#x6838;&#x5FC3;&#x3002;&#x53E6;&#x89C1;&#xFF08;<a href="#221-&#x8BED;&#x8A00;&#x7279;&#x6027;">&#xA7;2.2.1</a>&#xFF09;&#x548C;&#xFF08;<a href="10.html#106-&#x7F16;&#x7801;&#x6307;&#x5357;">&#xA7;10.6</a>&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x65F6;&#xFF0C;&#x9664;&#x4E86; C &#x8BED;&#x8A00;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6240;&#x6709;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x9002;&#x5F53;&#x7684;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x5B83;&#x6211;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x4EFB;&#x4F55;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6211;&#x7684;&#x90E8;&#x95E8;&#x4E3B;&#x7BA1; Alexander Fraser &#x7684;&#x9F13;&#x52B1;&#x4E0B;&#xFF0C;&#x6211;&#x7ACB;&#x5373;&#x6DFB;&#x52A0;&#x4E86;&#xFF08;&#x53EF;&#x9009;&#x7684;&#xFF09;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x58F0;&#x660E;&#x548C;&#x53C2;&#x6570;&#x68C0;&#x67E5;&#x3002;&#x8FD9;&#x5C31;&#x662F; C &#x8BED;&#x8A00;&#x4E2D;&#x73B0;&#x5728;&#x6240;&#x8BF4;&#x7684;&#x51FD;&#x6570;&#x539F;&#x578B;&#x3002;1982 &#x5E74;&#xFF0C;&#x5728;&#x770B;&#x5230;&#x8BA9;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x68C0;&#x67E5;&#x4FDD;&#x6301;&#x53EF;&#x9009;&#x7684;&#x6548;&#x679C;&#x540E;&#xFF0C;&#x6211;&#x5C06;&#x5176;&#x8BBE;&#x4E3A;&#x5F3A;&#x5236;&#x7684;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x5341;&#x51E0;&#x4E8C;&#x5341;&#x5E74;&#x91CC;&#x5173;&#x4E8E;&#x4E0E; C &#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x5927;&#x58F0;&#x62B1;&#x6028;&#x3002;&#x4EBA;&#x4EEC;&#x60F3;&#x8981;&#x4FDD;&#x7559;&#x4ED6;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x8BB8;&#x591A;&#x4EBA;&#x5927;&#x58F0;&#x8BF4;&#x4ED6;&#x4EEC;&#x4E0D;&#x60F3;&#x68C0;&#x67E5;&#xFF0C;&#x5E76;&#x4EE5;&#x6B64;&#x4F5C;&#x4E3A;&#x4E0D;&#x4F7F;&#x7528; C++ &#x7684;&#x501F;&#x53E3;&#x3002;&#x8FD9;&#x4E2A;&#x5C0F;&#x4E8B;&#x5B9E;&#x4E5F;&#x8BB8;&#x80FD;&#x8BA9;&#x4EBA;&#x4EEC;&#x8BA4;&#x8BC6;&#x5230;&#x6F14;&#x5316;&#x4E00;&#x95E8;&#x88AB;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x9274;&#x4E8E;&#x8FC7;&#x4E8E;&#x72ED;&#x9698;&#x7684; C &#x548C; C++ &#x7231;&#x597D;&#x8005;&#x4E4B;&#x95F4;&#x5076;&#x5C14;&#x4F1A;&#x6076;&#x8BED;&#x76F8;&#x5411;&#xFF0C;&#x6216;&#x8BB8;&#x503C;&#x5F97;&#x6307;&#x51FA;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x662F; Dennis Ritchie &#x548C; Brian Kernighan &#x7684;&#x670B;&#x53CB;&#xFF0C;&#x5728; 16 &#x5E74;&#x91CC;&#x51E0;&#x4E4E;&#x5929;&#x5929;&#x540C;&#x4ED6;&#x4EEC;&#x4E00;&#x8D77;&#x5403;&#x5348;&#x996D;&#x3002;&#x6211;&#x4ECE;&#x4ED6;&#x4EEC;&#x90A3;&#x91CC;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x73B0;&#x5728;&#x8FD8;&#x7ECF;&#x5E38;&#x540C; Brian &#x89C1;&#x9762;&#x3002;&#x6211;&#x5C06;&#x4E00;&#x4E9B;&#x5BF9; C++ &#x8BED;&#x8A00;&#x7684;&#x8D21;&#x732E; [Stroustrup 1993] &#x5F52;&#x529F;&#x4E8E;&#x4ED6;&#x4EEC;&#x4E24;&#x4F4D;&#xFF0C;&#x800C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x662F; C &#x7684;&#x4E3B;&#x8981;&#x8D21;&#x732E;&#x8005;&#xFF08;&#x4F8B;&#x5982;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x8BED;&#x6CD5;&#x3001;&#x51FD;&#x6570;&#x539F;&#x578B;&#x3001;<code>const</code>  &#x548C; <code>//</code> &#x6CE8;&#x91CA;&#xFF09;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x7406;&#x6027;&#x601D;&#x8003; C++ &#x7684;&#x6210;&#x957F;&#xFF0C;&#x6211;&#x60F3;&#x51FA;&#x4E86;&#x4E00;&#x5957;&#x8BBE;&#x8BA1;&#x89C4;&#x5219;&#x3002;&#x8FD9;&#x4E9B;&#x5728; [Stroustrup 1993, 1994] &#x4E2D;&#x6709;&#x4ECB;&#x7ECD;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6211;&#x53EA;&#x63D0;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF1A;</p>
<blockquote>
<ul>
<li>&#x4E0D;&#x8981;&#x9677;&#x5165;&#x5BF9;&#x5B8C;&#x7F8E;&#x7684;&#x5F92;&#x52B3;&#x8FFD;&#x6C42;&#x3002;</li>
<li>&#x59CB;&#x7EC8;&#x63D0;&#x4F9B;&#x8FC7;&#x6E21;&#x8DEF;&#x5F84;&#x3002;</li>
<li>&#x8BF4;&#x51FA;&#x4F60;&#x7684;&#x610F;&#x56FE;&#xFF08;&#x5373;&#xFF0C;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x8868;&#x8FBE;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x601D;&#x8DEF;&#xFF09;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x9690;&#x5F0F;&#x5730;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x65B9;&#x9762;&#x8FDD;&#x89C4;&#x3002;</li>
<li>&#x4E3A;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x63D0;&#x4F9B;&#x548C;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x540C;&#x6837;&#x597D;&#x7684;&#x652F;&#x6301;&#x3002;</li>
<li>&#x5E94;&#x53D6;&#x6D88;&#x9884;&#x5904;&#x7406;&#x5668;&#x7684;&#x4F7F;&#x7528;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x7ED9; C++ &#x4EE5;&#x4E0B;&#x7684;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#x7559;&#x6709;&#x4F59;&#x5730;&#xFF08;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x9664;&#x5916;&#xFF09;&#x3002;</li>
</ul>
</blockquote>
<p>&#x8FD9;&#x4E9B;&#x76EE;&#x6807;&#x7684;&#x91CE;&#x5FC3;&#x5E76;&#x4E0D;&#x5C0F;&#x3002;&#x5176;&#x4E2D;&#x67D0;&#x4E9B;&#x76EE;&#x6807;&#xFF0C;&#x73B0;&#x5728; 2020 &#x5E74;&#x4E86;&#x6211;&#x4F9D;&#x7136;&#x5728;&#x4E3A;&#x4E4B;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#x3002;&#x5728; 1980 &#x5E74;&#x4EE3;&#x65E9;&#x671F;&#x5230;&#x4E2D;&#x671F;&#xFF0C;&#x6211;&#x7ED9; C++ &#x6DFB;&#x52A0;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x8BED;&#x8A00;&#x529F;&#x80FD;&#xFF1A;</p>
<ul>
<li><strong>1981 &#x5E74;</strong>&#xFF1A;<code>const</code>&#x2014;&#x2014;&#x652F;&#x6301;&#x63A5;&#x53E3;&#x548C;&#x7B26;&#x53F7;&#x5E38;&#x91CF;&#x7684;&#x4E0D;&#x53D8;&#x6027;&#x3002;</li>
<li><strong>1982 &#x5E74;</strong>&#xFF1A;&#x865A;&#x51FD;&#x6570;&#x2014;&#x2014;&#x63D0;&#x4F9B;&#x8FD0;&#x884C;&#x671F;&#x591A;&#x6001;&#x3002;</li>
<li><strong>1984 &#x5E74;</strong>&#xFF1A;&#x5F15;&#x7528;&#x2014;&#x2014;&#x652F;&#x6301;&#x8FD0;&#x7B97;&#x7B26;&#x91CD;&#x8F7D;&#x548C;&#x7B80;&#x5316;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x3002;</li>
<li><strong>1984 &#x5E74;</strong>&#xFF1A;&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x51FD;&#x6570;&#x91CD;&#x8F7D;&#x2014;&#x2014;&#x9664;&#x4E86;&#x7B97;&#x672F;&#x548C;&#x903B;&#x8F91;&#x8FD0;&#x7B97;&#x7B26;&#x5916;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#xFF1A;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5B9A;&#x4E49; <code>=</code>&#xFF08;&#x8D4B;&#x503C;&#xFF09;&#x3001;<code>()</code>&#xFF08;&#x8C03;&#x7528;&#xFF1B;&#x652F;&#x6301;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#xFF08;<a href="04.html#431-lambda-&#x8868;&#x8FBE;&#x5F0F;">&#xA7;4.3.1</a>&#xFF09;&#xFF09;&#x3001;<code>[]</code>&#xFF08;&#x4E0B;&#x6807;&#x8BBF;&#x95EE;&#xFF09;&#x548C; <code>-&gt;</code>&#xFF08;&#x667A;&#x80FD;&#x6307;&#x9488;&#xFF09;&#x3002;</li>
<li><strong>1987 &#x5E74;</strong>&#xFF1A;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x94FE;&#x63A5;&#x2014;&#x2014;&#x6D88;&#x9664;&#x8BB8;&#x591A;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7FFB;&#x8BD1;&#x5355;&#x5143;&#x4E2D;&#x4E0D;&#x4E00;&#x81F4;&#x58F0;&#x660E;&#x7684;&#x9519;&#x8BEF;&#x3002;</li>
<li><strong>1987 &#x5E74;</strong>&#xFF1A;&#x62BD;&#x8C61;&#x7C7B;&#x2014;&#x2014;&#x63D0;&#x4F9B;&#x7EAF;&#x63A5;&#x53E3;&#x3002;</li>
</ul>
<p>&#x5728; 1980 &#x5E74;&#x4EE3;&#x540E;&#x671F;&#xFF0C;&#x968F;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x529B;&#x7684;&#x6025;&#x5267;&#x589E;&#x5F3A;&#xFF0C;&#x6211;&#x5BF9;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x66F4;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5E76;&#x505A;&#x4E86;&#x5982;&#x4E0B;&#x8865;&#x5145;&#xFF1A;</p>
<ul>
<li>&#x6A21;&#x677F;&#x2014;&#x2014;&#x5728;&#x7ECF;&#x5386;&#x4E86;&#x591A;&#x5E74;&#x4F7F;&#x7528;&#x5B8F;&#x8FDB;&#x884C;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x7684;&#x75DB;&#x82E6;&#x4E4B;&#x540E;&#xFF0C;&#x66F4;&#x597D;&#x5730;&#x652F;&#x6301;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x3002;</li>
<li>&#x5F02;&#x5E38;&#x2014;&#x2014;&#x8BD5;&#x56FE;&#x7ED9;&#x6DF7;&#x4E71;&#x7684;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x5E26;&#x6765;&#x67D0;&#x79CD;&#x79E9;&#x5E8F;&#xFF1B;RAII&#xFF08;<a href="#221-&#x8BED;&#x8A00;&#x7279;&#x6027;">&#xA7;2.2.1</a>&#xFF09;&#x4FBF;&#x662F;&#x4E3A;&#x6B64;&#x76EE;&#x6807;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;</li>
</ul>
<p>&#x540E;&#x9762;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x5E76;&#x6CA1;&#x6709;&#x53D7;&#x5230;&#x666E;&#x904D;&#x6B22;&#x8FCE;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x89C1;&#xFF08;<a href="07.html#7-&#x9519;&#x8BEF;&#x5904;&#x7406;">&#xA7;7</a>&#xFF09;&#xFF09;&#x3002;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#x793E;&#x533A;&#x5DF2;&#x7ECF;&#x53D8;&#x5F97;&#x5E9E;&#x5927;&#x548C;&#x96BE;&#x4EE5;&#x7BA1;&#x7406;&#x3002;ANSI &#x6807;&#x51C6;&#x5316;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x518D;&#x80FD;&#x591F;&#x79C1;&#x4E0B;&#x5B9E;&#x73B0;&#x548C;&#x5B9E;&#x9A8C;&#x3002;&#x4EBA;&#x4EEC;&#x575A;&#x6301;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#xFF0C;&#x575A;&#x6301;&#x5728;&#x8BA4;&#x771F;&#x5B9E;&#x65BD;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x5E7F;&#x6CDB;&#x7684;&#x8FA9;&#x8BBA;&#x3002;&#x6211;&#x4E0D;&#x80FD;&#x518D;&#x5728;&#x660E;&#x77E5;&#x9053;&#x4E0D;&#x53EF;&#x80FD;&#x8BA9;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6EE1;&#x610F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x7684;&#x63D0;&#x8BAE;&#x5F00;&#x59CB;&#xFF0C;&#x628A;&#x5B83;&#x53D1;&#x5C55;&#x6210;&#x4E00;&#x4E2A;&#x66F4;&#x5B8C;&#x6574;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EBA;&#x4EEC;&#x575A;&#x6301;&#x5230;&#x5904;&#x4F7F;&#x7528;&#x7B28;&#x91CD;&#x7684;&#x5E26;&#x6709; <code>template&lt;class T&gt;</code> &#x524D;&#x7F00;&#x7684;&#x6A21;&#x677F;&#x8BED;&#x6CD5;&#x3002;</p>
<p>&#x5728; 1980 &#x5E74;&#x4EE3;&#x672B;&#xFF0C;&#x201C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x201D;&#x7684;&#x5BA3;&#x4F20;&#x53D8;&#x5F97;&#x9707;&#x8033;&#x6B32;&#x804B;&#xFF0C;&#x6DF9;&#x6CA1;&#x4E86;&#x6211;&#x5BF9; C++ &#x4F20;&#x8FBE;&#x7684;&#x8BAF;&#x606F;&#x3002;&#x6211;&#x5BF9; C++ &#x662F;&#x4EC0;&#x4E48;&#x548C;&#x5E94;&#x5F53;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x7684;&#x770B;&#x6CD5;&#x88AB;&#x5E7F;&#x6CDB;&#x5FFD;&#x89C6;&#x4E86;&#x2014;&#x2014;&#x5F88;&#x591A;&#x4EBA;&#x751A;&#x81F3;&#x4ECE;&#x672A;&#x542C;&#x8BF4;&#x8FC7;&#x3002;&#x5BF9;&#x4E8E;&#x201C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x201D;&#x7684;&#x67D0;&#x4E9B;&#x5B9A;&#x4E49;&#x6765;&#x8BF4;&#xFF0C;&#x6240;&#x6709;&#x65B0;&#x8BED;&#x8A00;&#x90FD;&#x5E94;&#x662F;&#x201C;&#x7EAF;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x201D;&#x3002;&#x201C;&#x4E0D;&#x771F;&#x6B63;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x201D;&#x88AB;&#x89C6;&#x4E3A;&#x662F;&#x7CDF;&#x7CD5;&#x7684;&#xFF0C;&#x4E0D;&#x5BB9;&#x4E89;&#x8FA9;&#x3002;</p>
<p>&#x6211;&#x4ECE;&#x672A;&#x4F7F;&#x7528;&#x8FC7;&#x201C;C++ &#x662F;&#x4E00;&#x79CD;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x201D;&#x8FD9;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x5F88;&#x591A;&#x4EBA;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x6216;&#x8005;&#x56E0;&#x4E3A;&#x611F;&#x5230;&#x6709;&#x4E9B;&#x5C34;&#x5C2C;&#x800C;&#x6709;&#x610F;&#x5FFD;&#x7565;&#x4E86;&#x3002;&#x90A3;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x6807;&#x51C6;&#x63CF;&#x8FF0;&#x662F;</p>
<blockquote>
<p>C++ &#x662F;&#x4E00;&#x95E8;&#x504F;&#x5411;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x7684;&#x901A;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x662F;</p>
<ul>
<li>&#x66F4;&#x597D;&#x7684; C</li>
<li>&#x652F;&#x6301;&#x6570;&#x636E;&#x62BD;&#x8C61;</li>
<li>&#x652F;&#x6301;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;</li>
<li>&#x652F;&#x6301;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;</li>
</ul>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x8BF4;&#x6CD5;&#x8FC7;&#x53BB;&#x548C;&#x73B0;&#x5728;&#x90FD;&#x662F;&#x51C6;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x5982;&#x201C;&#x4E07;&#x7269;&#x7686;&#x5BF9;&#x8C61;&#xFF01;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x53E3;&#x53F7;&#x90A3;&#x4E48;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x3002;</p>
<h2 id="22-&#x7B2C;&#x4E8C;&#x4E2A;&#x5341;&#x5E74;">2.2 &#x7B2C;&#x4E8C;&#x4E2A;&#x5341;&#x5E74;</h2>
<p>ANSI C++ &#x59D4;&#x5458;&#x4F1A;&#x662F; 1989 &#x5E74; 12 &#x6708;&#x5728;&#x534E;&#x76DB;&#x987F;&#x7279;&#x533A;&#x7684;&#x4E00;&#x6B21;&#x4F1A;&#x8BAE;&#x4E0A;&#x6210;&#x7ACB;&#x7684;&#xFF0C;&#x8DDD;&#x79BB;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x201C;&#x5E26;&#x7C7B;&#x7684; C&#x201D;&#x8FD9;&#x4E2A;&#x540D;&#x79F0;&#x4EC5;&#x4EC5; 10 &#x5E74;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5927;&#x7EA6;&#x6709; 25 &#x540D; C++ &#x7A0B;&#x5E8F;&#x5458;&#x51FA;&#x5E2D;&#x4E86;&#x4F1A;&#x8BAE;&#x3002;&#x6211;&#x51FA;&#x5E2D;&#x4E86;&#x4F1A;&#x8BAE;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x8FD1;&#x4E9B;&#x5E74;&#x6765;&#x4F9D;&#x7136;&#x6D3B;&#x8DC3;&#x7684; ISO C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x5F53;&#x65F6;&#x4E5F;&#x5728;&#x3002;</p>
<p>&#x7ECF;&#x8FC7;&#x4E86;&#x60EF;&#x4F8B;&#x6027;&#x7684;&#x3001;&#x5927;&#x7EA6;&#x5341;&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BE5;&#x59D4;&#x5458;&#x4F1A;&#x7EC8;&#x4E8E;&#x53D1;&#x5E03;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#xFF1A;C++98&#x3002;&#x6211;&#x548C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x4EBA;&#x81EA;&#x7136;&#x66F4;&#x613F;&#x610F;&#x66F4;&#x5FEB;&#x5730;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#xFF0C;&#x4F46;&#x662F;&#x59D4;&#x5458;&#x4F1A;&#x89C4;&#x5219;&#x3001;&#x8FC7;&#x5EA6;&#x7684;&#x96C4;&#x5FC3;&#x548C;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5EF6;&#x8FDF;&#x4F7F;&#x6211;&#x4EEC;&#x5728;&#x65F6;&#x95F4;&#x8868;&#x65B9;&#x9762;&#x4E0E; Fortran&#x3001;C &#x548C;&#x5176;&#x4ED6;&#x6B63;&#x5F0F;&#x6807;&#x51C6;&#x5316;&#x7684;&#x8BED;&#x8A00;&#x7AD9;&#x5728;&#x4E86;&#x540C;&#x4E00;&#x8D77;&#x8DD1;&#x7EBF;&#x4E0A;&#x3002;</p>
<p>&#x5F62;&#x6210; C++98 &#x7684;&#x5DE5;&#x4F5C;&#x662F; HOPL3 &#x8BBA;&#x6587;&#x7684;&#x6838;&#x5FC3; [Stroustrup 2007]&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6211;&#x53EA;&#x7B80;&#x5355;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x3002;</p>
<h3 id="221-&#x8BED;&#x8A00;&#x7279;&#x6027;">2.2.1 &#x8BED;&#x8A00;&#x7279;&#x6027;</h3>
<p>C++98 &#x7684;&#x4E3B;&#x8981;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x662F;</p>
<ul>
<li>&#x6A21;&#x677F;&#x2014;&#x2014;&#x65E0;&#x7EA6;&#x675F;&#x7684;&#x3001;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7684;&#x3001;&#x5BF9;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x7684;&#x7F16;&#x8BD1;&#x671F;&#x652F;&#x6301;&#xFF0C;&#x5728;&#x6211;&#x65E9;&#x671F;&#x5DE5;&#x4F5C;&#xFF08;<a href="#21-&#x7B2C;&#x4E00;&#x4E2A;&#x5341;&#x5E74;">&#xA7;2.1</a>&#xFF09;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x4E86;&#x8BB8;&#x591A;&#x7EC6;&#x5316;&#x548C;&#x6539;&#x8FDB;&#xFF1B;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x4ECD;&#x5728;&#x7EE7;&#x7EED;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x3002;</li>
<li>&#x5F02;&#x5E38;&#x2014;&#x2014;&#x4E00;&#x5957;&#x5728;&#x5355;&#x72EC;&#xFF08;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF09;&#x8DEF;&#x5F84;&#x4E0A;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x503C;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x7531;&#x8C03;&#x7528;&#x65B9;&#x6808;&#x9876;&#x4E0A;&#x7684;&#x201C;&#x5728;&#x522B;&#x5904;&#x201D;&#x7684;&#x4EE3;&#x7801;&#x5904;&#x7406;&#xFF1B;&#x89C1;&#xFF08;<a href="07.html#7-&#x9519;&#x8BEF;&#x5904;&#x7406;">&#xA7;7</a>&#xFF09;&#x3002;</li>
<li><code>dynamic_cast</code> &#x548C; <code>typeid</code>&#x2014;&#x2014;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x8FD0;&#x884C;&#x671F;&#x53CD;&#x5C04;&#x5F62;&#x5F0F;&#xFF08;&#x201C;&#x8FD0;&#x884C;&#x671F;&#x7C7B;&#x578B;&#x8BC6;&#x522B;&#x201D;&#xFF0C;&#x53C8;&#x540D; RTTI&#xFF09;&#x3002;</li>
<li><code>namespace</code>&#x2014;&#x2014;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x7F16;&#x5199;&#x7531;&#x51E0;&#x4E2A;&#x72EC;&#x7ACB;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x7684;&#x8F83;&#x5927;&#x7A0B;&#x5E8F;&#x65F6;&#x907F;&#x514D;&#x540D;&#x79F0;&#x51B2;&#x7A81;&#x3002;</li>
<li>&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x5185;&#x7684;&#x58F0;&#x660E;&#x2014;&#x2014;&#x8BA9;&#x5199;&#x6CD5;&#x66F4;&#x7D27;&#x51D1;&#x548C;&#x9650;&#x5236;&#x53D8;&#x91CF;&#x4F5C;&#x7528;&#x57DF;&#x3002;</li>
<li>&#x5177;&#x540D;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x2014;&#x2014;&#xFF08;<code>static_cast</code>&#x3001;<code>reinterpret_cast</code> &#x548C; <code>const_cast</code>&#xFF09;&#xFF1A;&#x6D88;&#x9664;&#x4E86; C &#x98CE;&#x683C;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x4E2D;&#x7684;&#x4E8C;&#x4E49;&#x6027;&#xFF0C;&#x5E76;&#x4F7F;&#x663E;&#x5F0F;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x66F4;&#x52A0;&#x663E;&#x773C;&#x3002;</li>
<li><code>bool</code>&#xFF1A;&#x4E00;&#x79CD;&#x88AB;&#x8BC1;&#x660E;&#x975E;&#x5E38;&#x6709;&#x7528;&#x548C;&#x6D41;&#x884C;&#x7684;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#xFF1B;C &#x548C; C++ &#x66FE;&#x7ECF;&#x4F7F;&#x7528;&#x6574;&#x6570;&#x4F5C;&#x4E3A;&#x5E03;&#x5C14;&#x53D8;&#x91CF;&#x548C;&#x5E38;&#x91CF;&#x3002;</li>
</ul>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684; C++98 &#x4F8B;&#x5B50;&#x3002;<code>dynamic_cast</code> &#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x4E2D;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x7C7B;&#x4F3C;&#x201C;&#x662F;&#x67D0;&#x79CD;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x7684; C++ &#x7248;&#x672C;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">do_something</span><span class="hljs-params">(Shape* p)</span>
</span>{
    <span class="hljs-keyword">if</span> (Circle* pc = <span class="hljs-keyword">dynamic_cast</span>&lt;Circle*&gt;(p)) { <span class="hljs-comment">// p &#x662F;&#x67D0;&#x79CD; Circle&#xFF1F;</span>
        <span class="hljs-comment">// ... &#x4F7F;&#x7528; pc &#x6307;&#x5411;&#x7684; Circle ...</span>
    }
    <span class="hljs-keyword">else</span> {
        <span class="hljs-comment">// ... &#x4E0D;&#x662F; Circle&#xFF0C;&#x505A;&#x5176;&#x4ED6;&#x4E8B;&#x60C5; ...</span>
    }
}
</code></pre>
<p><code>dynamic_cast</code> &#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x671F;&#x64CD;&#x4F5C;&#xFF0C;&#x4F9D;&#x8D56;&#x4E8E;&#x5B58;&#x50A8;&#x5728; Shape &#x7684;&#x865A;&#x62DF;&#x51FD;&#x6570;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;&#x5B83;&#x901A;&#x7528;&#x3001;&#x6613;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x4E00;&#x6837;&#x9AD8;&#x6548;&#x3002;&#x7136;&#x800C;&#xFF0C;<code>dynamic_cast</code> &#x53D8;&#x5F97;&#x975E;&#x5E38;&#x4E0D;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x5B9E;&#x73B0;&#x5F80;&#x5F80;&#x662F;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#x624B;&#x52A8;&#x7F16;&#x7801;&#x53EF;&#x80FD;&#x66F4;&#x9AD8;&#x6548;&#xFF08;&#x53EF;&#x4EE5;&#x8BF4;&#x8FD9;&#x5BFC;&#x81F4; <code>dynamic_cast</code> &#x8FDD;&#x53CD;&#x4E86;&#x96F6;&#x5F00;&#x9500;&#x539F;&#x5219;&#xFF09;&#x3002;&#x5728;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x91CC;&#x4F7F;&#x7528;&#x58F0;&#x660E;&#x5F88;&#x65B0;&#x9896;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F53;&#x65F6;&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x53EA;&#x662F;&#x6CBF;&#x7528;&#x4E86; Algol68 &#x91CC;&#x7684;&#x8FD9;&#x4E2A;&#x4E3B;&#x610F;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x53D8;&#x79CD;&#x662F;&#x4F7F;&#x7528;&#x5F15;&#x7528;&#x800C;&#x4E0D;&#x662F;&#x6307;&#x9488;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">do_something2</span><span class="hljs-params">(Shape&amp; r)</span>
</span>{
    Circle&amp; rc = <span class="hljs-keyword">dynamic_cast</span>&lt;Circle&amp;&gt;(r);  <span class="hljs-comment">// r &#x662F;&#x67D0;&#x79CD; Circle&#xFF01;</span>
    <span class="hljs-comment">// ... &#x4F7F;&#x7528; rc &#x5F15;&#x7528;&#x7684; Circle ...</span>
}
</code></pre>
<p>&#x8FD9;&#x7B80;&#x5355;&#x5730;&#x65AD;&#x8A00; <code>r</code> &#x6307;&#x4EE3;&#x4E00;&#x4E2A; <code>Circle</code>&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5219;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x3002;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#xFF0C;&#x9519;&#x8BEF;&#x80FD;&#x591F;&#x5728;&#x672C;&#x5730;&#x88AB;&#x5408;&#x7406;&#x5730;&#x5904;&#x7406;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x6307;&#x9488;&#x548C;&#x6D4B;&#x8BD5;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x5219;&#x4F9D;&#x8D56;&#x5F15;&#x7528;&#x548C;&#x5F02;&#x5E38;&#x3002;</p>
<p>C++98 &#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x4E4B;&#x4E00;&#x662F; RAII&#xFF08;Resource Acquisition Is Initialization, &#x8D44;&#x6E90;&#x83B7;&#x53D6;&#x5373;&#x521D;&#x59CB;&#x5316;&#xFF09;&#x3002;&#x90A3;&#x662F;&#x6211;&#x7ED9;&#x5B83;&#x53D6;&#x7684;&#x4E00;&#x4E2A;&#x7B28;&#x62D9;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x60F3;&#x6CD5;&#x5C31;&#x662F;&#x6BCF;&#x4E2A;&#x8D44;&#x6E90;&#x90FD;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x8005;&#xFF0C;&#x5B83;&#x7531;&#x4F5C;&#x7528;&#x57DF;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#xFF1A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x3001;&#x6790;&#x6784;&#x51FD;&#x6570;&#x9690;&#x5F0F;&#x5730;&#x91CA;&#x653E;&#x5B83;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x51FA;&#x73B0;&#x5728;&#x65E9;&#x671F;&#x7684;&#x201C;&#x5E26;&#x7C7B;&#x7684; C &#x201D;&#x4E2D;&#xFF0C;&#x4F46;&#x76F4;&#x5230;&#x5341;&#x591A;&#x5E74;&#x540E;&#x624D;&#x88AB;&#x547D;&#x540D;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x6211;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7528;&#x6765;&#x8BF4;&#x660E;&#x5E76;&#x975E;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x90FD;&#x662F;&#x5185;&#x5B58;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">my_fct</span><span class="hljs-params">(<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span>* name)</span>  <span class="hljs-comment">// C &#x98CE;&#x683C;&#x7684;&#x8D44;&#x6E90;&#x7BA1;&#x7406;</span>
</span>{
    FILE* p = fopen(name, <span class="hljs-string">&quot;r&quot;</span>);  <span class="hljs-comment">// &#x6253;&#x5F00;&#x6587;&#x4EF6; name &#x6765;&#x8BFB;&#x53D6;</span>
    <span class="hljs-comment">// ... &#x4F7F;&#x7528; p ...</span>
    fclose(p);
}
</code></pre>
<p>&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x679C;&#xFF08;&#x5728; <code>fopen()</code> &#x548C; <code>fclose()</code> &#x7684;&#x8C03;&#x7528;&#x4E4B;&#x95F4;&#xFF09;&#x6211;&#x4EEC;&#x4ECE;&#x51FD;&#x6570; <code>return</code> &#x4E86;&#xFF0C;&#x6216;&#x8005; <code>throw</code> &#x4E86;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E86; C &#x7684; <code>longjmp</code>&#xFF0C;&#x90A3;&#x4E48; <code>p</code> &#x6307;&#x5411;&#x7684;&#x6587;&#x4EF6;&#x53E5;&#x67C4;&#x5C31;&#x6CC4;&#x6F0F;&#x4E86;&#x3002;&#x6587;&#x4EF6;&#x53E5;&#x67C4;&#x6CC4;&#x6F0F;&#x4F1A;&#x6BD4;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x66F4;&#x5FEB;&#x5730;&#x8017;&#x5C3D;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x53E5;&#x67C4;&#x662F;<strong>&#x975E;&#x5185;&#x5B58;&#x8D44;&#x6E90;</strong>&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5C06;&#x6587;&#x4EF6;&#x53E5;&#x67C4;&#x8868;&#x793A;&#x4E3A;&#x5E26;&#x6709;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x7684;&#x7C7B;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">class</span> File_handle {
    FILE* p;
<span class="hljs-keyword">public</span>:
    File_handle(<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span>* name,<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span>* permissions);  <span class="hljs-comment">// &#x6253;&#x5F00;&#x6587;&#x4EF6;</span>
    ~File_handle();  <span class="hljs-comment">// &#x5173;&#x95ED;&#x6587;&#x4EF6;</span>
    <span class="hljs-comment">// ...</span>
};
</code></pre>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x6211;&#x4EEC;&#x7684;&#x7528;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">my_fct2</span><span class="hljs-params">(<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span>* name)</span>  <span class="hljs-comment">// RAII &#x98CE;&#x683C;&#x7684;&#x8D44;&#x6E90;&#x7BA1;&#x7406;</span>
</span>{
    <span class="hljs-function">File_handle <span class="hljs-title">p</span><span class="hljs-params">(name,<span class="hljs-string">&quot;r&quot;</span>)</span></span>;    <span class="hljs-comment">// &#x6253;&#x5F00;&#x6587;&#x4EF6; name &#x6765;&#x8BFB;&#x53D6;</span>
    <span class="hljs-comment">// ... &#x4F7F;&#x7528; p ...</span>
} <span class="hljs-comment">// p &#x88AB;&#x9690;&#x5F0F;&#x5730;&#x5173;&#x95ED;</span>
</code></pre>
<p>&#x968F;&#x7740;&#x5F02;&#x5E38;&#x7684;&#x5F15;&#x5165;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8D44;&#x6E90;&#x53E5;&#x67C4;&#x53D8;&#x5F97;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x7279;&#x522B;&#x7684;&#xFF0C;&#x6807;&#x51C6;&#x5E93;&#x6587;&#x4EF6;&#x6D41;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x53E5;&#x67C4;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528; C++98 &#x6807;&#x51C6;&#x5E93;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53D8;&#x6210;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">my_fct3</span><span class="hljs-params">(<span class="hljs-keyword">const</span> <span class="hljs-built_in">string</span>&amp; name)</span>
</span>{
    <span class="hljs-function">ifstream <span class="hljs-title">p</span><span class="hljs-params">(name)</span></span>;    <span class="hljs-comment">// &#x6253;&#x5F00;&#x6587;&#x4EF6; name &#x6765;&#x8BFB;&#x53D6;</span>
    <span class="hljs-comment">// ... &#x4F7F;&#x7528; p ...</span>
} <span class="hljs-comment">// p &#x88AB;&#x9690;&#x5F0F;&#x7684;&#x5173;&#x95ED;</span>
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;RAII &#x4EE3;&#x7801;&#x4E0D;&#x540C;&#x4E8E;&#x4F20;&#x7EDF;&#x7684;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5728;&#x5E93;&#x4E2D;&#x4E00;&#x52B3;&#x6C38;&#x9038;&#x5730;&#x5B9A;&#x4E49;&#x201C;&#x6E05;&#x7406;&#x5185;&#x5B58;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x65F6;&#x90FD;&#x5FC5;&#x987B;&#x8BB0;&#x4F4F;&#x5E76;&#x663E;&#x5F0F;&#x7F16;&#x5199;&#x3002;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6B63;&#x786E;&#x548C;&#x5065;&#x58EE;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x5355;&#x3001;&#x66F4;&#x77ED;&#xFF0C;&#x5E76;&#x4E14;&#x81F3;&#x5C11;&#x4E0E;&#x4F20;&#x7EDF;&#x98CE;&#x683C;&#x4E00;&#x6837;&#x9AD8;&#x6548;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684; 20 &#x5E74;&#x91CC;&#xFF0C;RAII &#x5DF2;&#x904D;&#x5E03; C++ &#x5E93;&#x3002;</p>
<p>&#x62E5;&#x6709;&#x975E;&#x5185;&#x5B58;&#x8D44;&#x6E90;&#x610F;&#x5473;&#x7740;&#x5783;&#x573E;&#x6536;&#x96C6;&#x672C;&#x8EAB;&#x4E0D;&#x8DB3;&#x4EE5;&#x8FDB;&#x884C;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x3002;&#x6B64;&#x5916;&#xFF0C;RAII &#x52A0;&#x4E0A;&#x667A;&#x80FD;&#x6307;&#x9488;&#xFF08;<a href="04.html#424-&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x6307;&#x9488;">&#xA7;4.2.4</a>&#xFF09;&#x6D88;&#x9664;&#x4E86;&#x5BF9;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x9700;&#x6C42;&#x3002;&#x53E6;&#x89C1;&#xFF08;<a href="10.html#106-&#x7F16;&#x7801;&#x6307;&#x5357;">&#xA7;10.6</a>&#xFF09;&#x3002;</p>
<h3 id="222-&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;">2.2.2 &#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;</h3>
<p>C++98 &#x6807;&#x51C6;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#xFF1A;</p>
<ul>
<li>STL&#x2014;&#x2014;&#x521B;&#x9020;&#x6027;&#x7684;&#x3001;&#x901A;&#x7528;&#x7684;&#x3001;&#x4F18;&#x96C5;&#x7684;&#x3001;&#x9AD8;&#x6548;&#x7684;&#x5BB9;&#x5668;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x548C;&#x7B97;&#x6CD5;&#x6846;&#x67B6;&#xFF0C;&#x7531; Alexander Stepanov &#x8BBE;&#x8BA1;&#x3002;</li>
<li>&#x7279;&#x5F81;&#xFF08;trait&#xFF09;&#x2014;&#x2014;&#x5BF9;&#x4F7F;&#x7528;&#x6A21;&#x677F;&#x7F16;&#x7A0B;&#x6709;&#x7528;&#x7684;&#x7F16;&#x8BD1;&#x671F;&#x5C5E;&#x6027;&#x96C6;&#xFF08;<a href="04.html#451-&#x5B9E;&#x73B0;&#x6280;&#x5DE7;">&#xA7;4.5.1</a>&#xFF09;&#x3002;</li>
<li><code>string</code>&#x2014;&#x2014;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x548C;&#x64CD;&#x4F5C;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x6A21;&#x677F;&#x53C2;&#x6570;&#xFF0C;&#x5176;&#x9ED8;&#x8BA4;&#x503C;&#x662F; <code>char</code>&#x3002;</li>
<li><code>iostream</code>&#x2014;&#x2014;&#x7531; Jerry Schwartz &#x548C;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x7CBE;&#x5FC3;&#x5236;&#x4F5C;&#xFF0C;&#x57FA;&#x4E8E;&#x6211; 1984 &#x5E74;&#x7684;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF0C;&#x5904;&#x7406;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5B57;&#x7B26;&#x7C7B;&#x578B;&#x3001;&#x533A;&#x57DF;&#x8BBE;&#x7F6E;&#x548C;&#x7F13;&#x51B2;&#x7B56;&#x7565;&#x3002;</li>
<li><code>bitset</code>&#x2014;&#x2014;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x548C;&#x64CD;&#x4F5C;&#x6BD4;&#x7279;&#x4F4D;&#x96C6;&#x5408;&#x7684;&#x7C7B;&#x578B;&#x3002;</li>
<li><code>locale</code>&#x2014;&#x2014;&#x7528;&#x6765;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x6587;&#x5316;&#x4F20;&#x7EDF;&#x7684;&#x7CBE;&#x81F4;&#x6846;&#x67B6;&#xFF0C;&#x4E3B;&#x8981;&#x4E0E;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x6709;&#x5173;&#x3002;</li>
<li><code>valarray</code>&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x6570;&#x7EC4;&#xFF0C;&#x5E26;&#x6709;&#x53EF;&#x4F18;&#x5316;&#x7684;&#x5411;&#x91CF;&#x8FD0;&#x7B97;&#xFF0C;&#x4F46;&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x672A;&#x89C1;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x3002;</li>
<li><code>auto_ptr</code>&#x2014;&#x2014;&#x65E9;&#x671F;&#x7684;&#x4EE3;&#x8868;&#x72EC;&#x5360;&#x6240;&#x6709;&#x6743;&#x7684;&#x6307;&#x9488;&#xFF1B;&#x5728; C++11 &#x4E2D;&#xFF0C;&#x5B83;&#x88AB; <code>shared_ptr</code>&#xFF08;&#x5171;&#x4EAB;&#x6240;&#x6709;&#x6743;&#xFF09;&#x548C; <code>unique_ptr</code>&#xFF08;&#x72EC;&#x5360;&#x6240;&#x6709;&#x6743;&#xFF09;&#xFF08;<a href="04.html#424-&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x6307;&#x9488;">&#xA7;4.2.4</a>&#xFF09;&#x66FF;&#x4EE3;&#x3002;</li>
</ul>
<p>&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;STL &#x6846;&#x67B6;&#x662F;&#x6700;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;STL &#x548C;&#x5B83;&#x5F00;&#x521B;&#x7684;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x633D;&#x6551;&#x4E86; C++&#xFF0C;&#x4F7F;&#x5B83;&#x6210;&#x957F;&#x4E3A;&#x4E00;&#x79CD;&#x6709;&#x6D3B;&#x529B;&#x7684;&#x73B0;&#x4EE3;&#x8BED;&#x8A00;&#x3002;&#x50CF;&#x6240;&#x6709;&#x7684; C++98 &#x529F;&#x80FD;&#x4E00;&#x6837;&#xFF0C;STL &#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x63CF;&#x8FF0;&#xFF08;&#x4F8B;&#x5982; [Stroustrup 1997, 2007]&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x53EA;&#x4F1A;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">test</span><span class="hljs-params">(<span class="hljs-built_in">vector</span>&lt;<span class="hljs-built_in">string</span>&gt;&amp; v, <span class="hljs-built_in">list</span>&lt;<span class="hljs-keyword">int</span>&gt;&amp; lst)</span>
</span>{
    <span class="hljs-built_in">vector</span>&lt;<span class="hljs-built_in">string</span>&gt;::iterator p
        = find_if(v.begin(), v.end(), Less_than&lt;<span class="hljs-built_in">string</span>&gt;(<span class="hljs-string">&quot;falcon&quot;</span>));
    <span class="hljs-keyword">if</span> (p != v.end())  {  <span class="hljs-comment">// p &#x6307;&#x5411; &apos;falcon&apos;</span>
        <span class="hljs-comment">// ... &#x4F7F;&#x7528; *p ...</span>
    }
    <span class="hljs-keyword">else</span> {                <span class="hljs-comment">// &#x6CA1;&#x627E;&#x5230; &apos;falcon&apos;</span>
        <span class="hljs-comment">// ...</span>
    }

    <span class="hljs-built_in">list</span>&lt;<span class="hljs-keyword">int</span>&gt;::iterator q
        = find_if(lst.begin(), lst.end(), Greater_than&lt;<span class="hljs-keyword">int</span>&gt;(<span class="hljs-number">42</span>));
    <span class="hljs-comment">// ...</span>
}
</code></pre>
<p>&#x6807;&#x51C6;&#x5E93;&#x7B97;&#x6CD5; <code>find_if</code> &#x904D;&#x5386;&#x5E8F;&#x5217;&#xFF08;&#x7531; <code>begin</code>/<code>end</code> &#x5B9A;&#x754C;&#xFF09;&#x5BFB;&#x627E;&#x8C13;&#x8BCD;&#x4E3A;&#x771F;&#x7684;&#x5143;&#x7D20;&#x3002;&#x8BE5;&#x7B97;&#x6CD5;&#x5728;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0A;&#x90FD;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x5E8F;&#x5217;&#x5143;&#x7D20;&#x7684;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF08;&#x8FD9;&#x91CC;&#x662F; <code>vector</code> &#x548C; <code>list</code>&#xFF09;</li>
<li>&#x5143;&#x7D20;&#x7684;&#x7C7B;&#x578B;&#xFF08;&#x8FD9;&#x91CC;&#x662F; <code>string</code> &#x548C; <code>int</code>&#xFF09;</li>
<li>&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x4F55;&#x65F6;&#x627E;&#x5230;&#x5143;&#x7D20;&#x7684;&#x8C13;&#x8BCD;&#xFF08;&#x6B64;&#x5904;&#x4E3A; <code>Less_than</code> &#x548C; <code>Greater_than</code>&#xFF09;</li>
</ul>
<p>&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x7528;&#x5230;&#x4EFB;&#x4F55;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x662F;&#x4F9D;&#x8D56;&#x6A21;&#x677F;&#x7684;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x7F16;&#x8BD1;&#x671F;&#x591A;&#x6001;&#x3002;</p>
<p>&#x6A21;&#x677F;&#x7684;&#x5199;&#x6CD5;&#x4ECD;&#x7136;&#x5F88;&#x539F;&#x59CB;&#xFF0C;&#x4F46;&#x662F;&#x4ECE; 2017 &#x5E74;&#x5DE6;&#x53F3;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>auto</code>&#xFF08;<a href="04.html#421-auto-&#x548C;-decltype">&#xA7;4.2.1</a>&#xFF09;&#x3001;&#x8303;&#x56F4;&#xFF08;<a href="09.html#935-&#x8303;&#x56F4;">&#xA7;9.3.5</a>&#xFF09;&#x548C; lambda &#x8868;&#x8FBE;&#x5F0F;&#xFF08;<a href="04.html#431-lambda-&#x8868;&#x8FBE;&#x5F0F;">&#xA7;4.3.1</a>&#xFF09;&#x6765;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">test2</span><span class="hljs-params">(<span class="hljs-built_in">vector</span>&lt;<span class="hljs-built_in">string</span>&gt;&amp; v, <span class="hljs-built_in">list</span>&lt;<span class="hljs-keyword">int</span>&gt;&amp; lst)</span>
</span>{
    <span class="hljs-keyword">auto</span> p = find_if(v,[](<span class="hljs-keyword">const</span> <span class="hljs-built_in">string</span>&amp; s) { <span class="hljs-keyword">return</span> s&lt;<span class="hljs-string">&quot;falcon&quot;</span>; })
    <span class="hljs-keyword">if</span> (p!=v.end()) {
        <span class="hljs-comment">// ...</span>
    }
    <span class="hljs-comment">// ...</span>
    <span class="hljs-keyword">auto</span> q = find_if(lst,[](<span class="hljs-keyword">int</span> x) { <span class="hljs-keyword">return</span> x&gt;<span class="hljs-number">42</span>; })
    <span class="hljs-keyword">if</span> (q!=lst.end()) {
        <span class="hljs-comment">// ...</span>
    }
    <span class="hljs-comment">// ...</span>
}
</code></pre>
<h2 id="23-c-&#x7684;-2006">2.3 C++ &#x7684; 2006</h2>
<p>2006 &#x5E74;&#xFF0C;&#x6211;&#x548C; ISO C++ &#x59D4;&#x5458;&#x4F1A;&#x7684;&#x5927;&#x591A;&#x6570;&#x5176;&#x4ED6;&#x6210;&#x5458;&#x90FD;&#x5BF9;&#x529F;&#x80FD;&#x4E30;&#x5BCC;&#x7684; C++0x &#x6807;&#x51C6;&#x5BC4;&#x4E88;&#x539A;&#x671B;&#x3002;&#x8BA1;&#x5212;&#x5728; 2007 &#x8FDB;&#x884C;&#x7279;&#x6027;&#x51BB;&#x7ED3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x9884;&#x671F;&#xFF0C;C++0x &#x5C06;&#x662F; C++08 &#x6216; C++09&#x3002;&#x4E8B;&#x5B9E;&#x4E0A; C++0x &#x53D8;&#x6210;&#x4E86; C++11&#xFF0C;&#x5F15;&#x51FA;&#x4E86;&#x5173;&#x4E8E;&#x5341;&#x516D;&#x8FDB;&#x5236; C++0xB &#x7684;&#x7B11;&#x8BDD;&#x3002;</p>
<p>&#x5728;&#x6211; 2006 &#x5E74;&#x7684; HOPL &#x8BBA;&#x6587; [Stroustrup 2007] &#x4E2D;&#xFF0C;&#x6211;&#x5217;&#x51FA;&#x4E86; 39 &#x4E2A;&#x63D0;&#x6848;&#xFF0C;&#x5E76;&#x9884;&#x6D4B;&#x524D; 21 &#x4E2A;&#x4F1A;&#x8FDB;&#x5165; C++0x&#x3002;&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x5217;&#x8868;&#x4E0A;&#x7684;&#x524D; 25 &#x4E2A;&#x5EFA;&#x8BAE;&#x4E2D;&#xFF0C;&#x6709; 24 &#x4E2A;&#x8FDB;&#x5165;&#x4E86; C++11&#x3002;&#x6211;&#x628A;&#x63D0;&#x6848; 22&#x2013;25 &#x5217;&#x4E3A;&#x201C;&#x6B63;&#x5728;&#x5236;&#x5B9A;&#x4E2D;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x5728; 2007 &#x5E74; 7 &#x6708;&#x8FDB;&#x884C;&#x6295;&#x7968;&#x201D;&#x3002;&#x4EE4;&#x6211;&#x60CA;&#x559C;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x5168;&#x90FD;&#x6210;&#x529F;&#x4E86;&#x3002;&#x800C;&#x63D0;&#x6848; 26&#x2013;39 &#x5219;&#x8FDE; C++17 &#x90FD;&#x6CA1;&#x6709;&#x8FDB;&#x5165;&#x3002;&#x8FD9;&#x4E2D;&#x95F4;&#x5C31;&#x7559;&#x4E0B;&#x4E86;&#x7B2C; 10 &#x53F7;&#x63D0;&#x6848;&#x201C;&#x6982;&#x5FF5;&#x201D;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x957F;&#x957F;&#x7684;&#x60B2;&#x4F24;&#x6545;&#x4E8B;&#xFF0C;&#x4E0D;&#x8FC7;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x4EE5;&#x8FDB;&#x5165; C++20 &#x800C;&#x5FEB;&#x4E50;&#x6536;&#x5C3E;&#x3002;</p>
<p>&#x6211;&#x548C;&#x5176;&#x4ED6;&#x8BB8;&#x591A;&#x4EBA;&#x5BF9; C++0x &#x7684;&#x5EF6;&#x8FDF;&#x611F;&#x5230;&#x6CAE;&#x4E27;&#xFF0C;&#x5E76;&#x62C5;&#x5FC3;&#x5728;&#x9762;&#x5BF9;&#x6765;&#x81EA;&#x66F4;&#x73B0;&#x4EE3;&#x3001;&#x8D44;&#x91D1;&#x66F4;&#x5145;&#x8DB3;&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#x7684;&#x7ADE;&#x4E89;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x672A;&#x7ECF;&#x6539;&#x8FDB;&#x7684; C++ &#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x6D3B;&#x7684;&#x8BED;&#x8A00;&#x751F;&#x5B58;&#x4E0B;&#x53BB;&#x3002;&#x5728; 2006 &#x5E74;&#xFF0C;Java &#x7684;&#x4F7F;&#x7528;&#x4ECD;&#x5728;&#x589E;&#x52A0;&#xFF0C;&#x5FAE;&#x8F6F;&#x7684; C# &#x4E5F;&#x6709;&#x5927;&#x91CF;&#x7684;&#x652F;&#x6301;&#x548C;&#x8425;&#x9500;&#x3002;&#x6211;&#x5728; 2006 &#x5E74;&#x7684;&#x4F30;&#x8BA1;&#x662F; C++ &#x7684;&#x4F7F;&#x7528;&#x5728;&#x8FC7;&#x53BB; 4 &#x5E74;&#x4E2D;&#x9996;&#x6B21;&#x7565;&#x6709;&#x4E0B;&#x964D;&#x3002;&#x83B7;&#x53D6;&#x771F;&#x5B9E;&#x7684;&#x6570;&#x5B57;&#x5F88;&#x96BE;&#xFF0C;&#x6211;&#x7684;&#x6700;&#x4F73;&#x4F30;&#x8BA1;&#xFF08;&#x4E0B;&#x964D; 7%&#xFF09;&#x5B8C;&#x5168;&#x5728;&#x8BEF;&#x5DEE;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x6709;&#x7406;&#x7531;&#x53BB;&#x62C5;&#x5FC3;&#x3002;&#x7C7B;&#x4F3C; Java &#x548C; C# &#x8FD9;&#x6837;&#x7684;&#x8BED;&#x8A00;&#x4F1A;&#x4F5C;&#x51FA;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x5047;&#x8BBE;&#x2014;&#x2014;&#x5E76;&#x5E38;&#x5E38;&#x5927;&#x58F0;&#x5BA3;&#x626C;&#x2014;&#x2014;C++ &#x6CA1;&#x6709;&#x751F;&#x6001;&#x4F4D;&#xFF1A;</p>
<ul>
<li>&#x201C;&#x4F4E;&#x7EA7;&#x7F16;&#x7A0B;&#x201D;&#x53EF;&#x4EE5;&#x7531;&#x5C11;&#x91CF;&#x7684; C &#x6216;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x5904;&#x7406;&#x3002;</li>
<li>&#x201C;&#x9AD8;&#x7EA7;&#x7F16;&#x7A0B;&#x201D;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x5E26;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x5B89;&#x5168;&#x3001;&#x66F4;&#x5C0F;&#x5E76;&#x4F7F;&#x7528;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x505A;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x4FBF;&#x5B9C;&#x3001;&#x66F4;&#x9AD8;&#x6548;&#x5730;&#x5B8C;&#x6210;&#x3002;</li>
<li>&#x50CF; Java &#x548C; C# &#x8FD9;&#x6837;&#x7684;&#x6258;&#x7BA1;&#x8BED;&#x8A00;&#x4F7F;&#x7528;&#x5783;&#x573E;&#x6536;&#x96C6;&#x548C;&#x4E00;&#x81F4;&#x7684;&#x8FD0;&#x884C;&#x671F;&#x8303;&#x56F4;&#x68C0;&#x67E5;&#xFF0C;&#x4F7F;&#x5F97;&#x4E0D;&#x592A;&#x4E13;&#x4E1A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x80FD;&#x66F4;&#x6709;&#x751F;&#x4EA7;&#x529B;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5BF9;&#x9AD8;&#x6280;&#x80FD;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x9700;&#x6C42;&#x3002;</li>
<li>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0E;&#x5E73;&#x53F0;&#x7684;&#x6DF1;&#x5EA6;&#x96C6;&#x6210;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x96C6;&#x6210;&#x5DE5;&#x5177;&#x6765;&#x8FDB;&#x884C;&#x652F;&#x6301;&#xFF0C;&#x8FD9;&#x5BF9;&#x751F;&#x4EA7;&#x529B;&#x548C;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x6784;&#x5EFA;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</li>
</ul>
<p>&#x663E;&#x7136;&#xFF0C;&#x6211;&#x548C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x4EBA;&#x5E76;&#x4E0D;&#x540C;&#x610F;&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x5728;&#x8FC7;&#x53BB;&#x548C;&#x73B0;&#x5728;&#x90FD;&#x662F;&#x4E25;&#x8083;&#x7684;&#x4E89;&#x8FA9;&#xFF0C;&#x5B83;&#x4EEC;&#x5982;&#x679C;&#x6B63;&#x786E;&#x7684;&#x8BDD;&#x5E94;&#x8BE5;&#x5BFC;&#x81F4; C++ &#x88AB;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x3002;C++ &#x57FA;&#x4E8E;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6A21;&#x578B;&#xFF0C;&#x4E0E;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5206;&#x79BB;&#xFF0C;&#x5E76;&#x7531;&#x4F17;&#x591A;&#x72EC;&#x7ACB;&#x7684;&#x5DE5;&#x5177;&#x4F9B;&#x5E94;&#x8005;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#x3002;&#x6258;&#x7BA1;&#x8BED;&#x8A00;&#x5F80;&#x5F80;&#x662F;&#x4E13;&#x6709;&#x7684;&#xFF1B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5E9E;&#x5927;&#x800C;&#x5BCC;&#x6709;&#x7684;&#x7EC4;&#x7EC7;&#x624D;&#x80FD;&#x5F00;&#x53D1;&#x6240;&#x9700;&#x7684;&#x5E9E;&#x5927;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x548C;&#x5E93;&#x3002;&#x6211;&#x548C; C++ &#x793E;&#x533A;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x8BB8;&#x591A;&#x4EBA;&#x66F4;&#x559C;&#x6B22;&#x4E0D;&#x53D7;&#x516C;&#x53F8;&#x63A7;&#x5236;&#x7684;&#x8BED;&#x8A00;&#xFF1B;&#x8FD9;&#x662F;&#x6211;&#x53C2;&#x52A0; ISO &#x6807;&#x51C6;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x56DE;&#x60F3;&#x8D77;&#x6765;&#xFF0C;2006 &#x5E74;&#x53EF;&#x80FD;&#x662F; C++ &#x7684;&#x6700;&#x4F4E;&#x8C37;&#xFF0C;&#x4F46;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x4E8B;&#x4EF6;&#x4E5F;&#x6070;&#x597D;&#x5728;&#x6B64;&#x65F6;&#x53D1;&#x751F;&#x4E86;&#xFF1A;&#x5927;&#x7EA6;&#x5728; 2005 &#x5E74;&#xFF0C;&#x5386;&#x53F2;&#x4E0A;&#x7B2C;&#x4E00;&#x6B21;&#x5355;&#x4E2A;&#x5904;&#x7406;&#x5668;&#xFF08;&#x5355;&#x6838;&#xFF09;&#x7684;&#x6027;&#x80FD;&#x505C;&#x6B62;&#x63D0;&#x9AD8;&#xFF0C;&#x80FD;&#x6548;&#xFF08;&#x201C;&#x6BCF;&#x74E6;&#x7279;&#x7684;&#x6027;&#x80FD;&#x201D;&#xFF09;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x6307;&#x6807;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x548C;&#x624B;&#x6301;&#x8BBE;&#x5907;&#xFF09;&#x3002;&#x8BA1;&#x7B97;&#x7ECF;&#x6D4E;&#x5B66;&#x8F6C;&#x800C;&#x9752;&#x7750;&#x66F4;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x786C;&#x4EF6;&#x7684;&#x8FDB;&#x6B65;&#x518D;&#x4E5F;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x63A9;&#x76D6;&#x8BED;&#x8A00;&#x6216;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x7684;&#x4F4E;&#x6548;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6267;&#x638C;&#x201C;&#x5229;&#x5668;&#x201D;&#x7684;&#x9AD8;&#x624B;&#x8DDF;&#x5DEE;&#x70B9;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6216;&#x53D7;&#x5DE5;&#x5177;&#x94FE;&#x5F00;&#x9500;&#x675F;&#x7F1A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x76F8;&#x6BD4;&#xFF0C;&#x80FD;&#x8D62;&#x5F97;&#x9AD8;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x7684;&#x7ECF;&#x6D4E;&#x4F18;&#x52BF;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x4F18;&#x52BF;&#x5341;&#x591A;&#x5E74;&#x4E4B;&#x540E;&#x8FD8;&#x4F9D;&#x7136;&#x5B58;&#x5728;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x4ECA;&#x5929;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x5B9E;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x6240;&#x6709;&#x7684;&#x6559;&#x80B2;&#x548C;&#x7BA1;&#x7406;&#x4F53;&#x5236;&#x5145;&#x5206;&#x9886;&#x4F1A;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6709;&#x8BB8;&#x591A;&#x91CD;&#x8981;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E3A;&#x5B83;&#x4EEC;&#x82B1;&#x65F6;&#x95F4;&#x7CBE;&#x5FC3;&#x6253;&#x9020;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x83B7;&#x5F97;&#x5DE8;&#x5927;&#x7684;&#x56DE;&#x62A5;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x8F6C;&#x6298;&#x70B9;&#x6765;&#x81EA;&#x4F9B;&#x5E94;&#x5546;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x6807;&#x51C6;&#x63A5;&#x53E3;&#xFF08;&#x6BD4;&#x5982;&#x56FE;&#x5F62;&#x7528;&#x6237;&#x754C;&#x9762;&#xFF09;&#x5C06;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x8BED;&#x8A00;&#x5F3A;&#x52A0;&#x7ED9;&#x6240;&#x6709;&#x7528;&#x6237;&#xFF0C;&#x800C;&#x8FD9;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#x3001;&#x901A;&#x5E38;&#x662F;&#x4E13;&#x6709;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x6BD4;&#x5982;&#x8C37;&#x6B4C;&#x5BF9;&#x5B89;&#x5353;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528; Java&#xFF0C;&#x82F9;&#x679C;&#x5BF9; iOS &#x4F7F;&#x7528; Objective-C&#xFF0C;&#x5FAE;&#x8F6F;&#x5BF9; Windows &#x4F7F;&#x7528; C#&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9B;&#x5E94;&#x5546;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x7F16;&#x7A0B;&#x65B9;&#x8A00;&#x6765;&#x907F;&#x5F00;&#x9501;&#x5B9A;&#xFF0C;&#x4F8B;&#x5982; Objective C++ [Objective C++ Wikipedia 2020] &#x6216; C++/CLI [ECMA International 2005]&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x5199;&#x51FA;&#x7684;&#x4EE3;&#x7801;&#x4ECD;&#x7136;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x3002;&#x8BB8;&#x591A;&#x7EC4;&#x7EC7;&#xFF0C;&#x6BD4;&#x5982; Adobe&#x3001;&#x8C37;&#x6B4C;&#x548C;&#x5FAE;&#x8F6F;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x54CD;&#x5E94;&#x65B9;&#x5F0F;&#x662F;&#x4F7F;&#x7528; C++ &#x7F16;&#x5199;&#x4ED6;&#x4EEC;&#x8981;&#x6C42;&#x82DB;&#x523B;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x8981;&#x90E8;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x4E3A;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#xFF08;&#x5982; Android&#x3001;iOS &#x548C; Windows&#xFF09;&#x4F7F;&#x7528;&#x8584;&#x63A5;&#x53E3;&#x5C42;&#x3002;2006 &#x5E74;&#x65F6;&#x8FD9;&#x4E00;&#x8D8B;&#x52BF;&#x51E0;&#x4E4E;&#x4E0D;&#x5F15;&#x4EBA;&#x6CE8;&#x76EE;&#x3002;</p>
<p>&#x5728;&#x4FBF;&#x643A;&#x5F0F;&#x8BBE;&#x5907;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x667A;&#x80FD;&#x624B;&#x673A;&#xFF09;&#x4E0A;&#xFF0C;&#x5BF9;&#x80FD;&#x6548;&#x548C;&#x5E73;&#x53F0;&#x72EC;&#x7ACB;&#x6027;&#x7684;&#x9700;&#x6C42;&#x662F;&#x5F7C;&#x6B64;&#x878D;&#x5408;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x5F71;&#x54CD;&#x662F;&#xFF0C;&#x636E;&#x6211;&#x5728; 2018 &#x5E74;&#x7684;&#x6700;&#x4F73;&#x4F30;&#x8BA1;&#xFF0C;&#x81EA; 2006 &#x5E74;&#x4EE5;&#x6765; C++ &#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6570;&#x91CF;&#x589E;&#x957F;&#x4E86;&#x7EA6; 50%&#xFF0C;&#x8FBE;&#x5230;&#x7EA6; 450 &#x4E07;&#x540D;&#x5F00;&#x53D1;&#x4EBA;&#x5458; [Kazakova 2015]&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5F00;&#x53D1;&#x8005;&#x6BCF;&#x5E74;&#x589E;&#x957F; 15 &#x4E07;&#x4EBA;&#xFF0C;&#x5341;&#x5E74;&#x6765;&#x6BCF;&#x5E74;&#x5927;&#x7EA6;&#x589E;&#x957F; 4%&#x3002;</p>
<p>2006 &#x5E74;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x6CE8;&#x610F;&#x5230;&#x786C;&#x4EF6;&#x8D8B;&#x52BF;&#x5BF9; C++ &#x56FA;&#x6709;&#x4F18;&#x52BF;&#x7684;&#x6ECB;&#x517B;&#x3002;&#x800C;&#x793E;&#x533A;&#x548C;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6B63;&#x5728;&#x5173;&#x6CE8;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x548C;&#x5E93;&#xFF0C;&#x4EE5;&#x589E;&#x52A0; C++ &#x7684;&#x5B9E;&#x7528;&#x6027;&#x5E76;&#x63D0;&#x9AD8;&#x5BF9;&#x5B83;&#x7684;&#x70ED;&#x60C5;&#x3002;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#x7684;&#x4E00;&#x4E9B;&#x59D4;&#x5458;&#x611F;&#x5230;&#x8FEB;&#x5207;&#x9700;&#x8981;&#x91CD;&#x5927;&#x6539;&#x8FDB;&#x3002;&#x5176;&#x4ED6;&#x4EBA;&#x66F4;&#x5173;&#x6CE8;&#x4E8E;&#x7A33;&#x5B9A;&#x8BED;&#x8A00;&#x548C;&#x6539;&#x8FDB;&#x5B83;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x9700;&#x8981;&#x8FD9;&#x4E24;&#x4E2A;&#x7FA4;&#x4F53;&#xFF0C;&#x4F46;&#x521B;&#x65B0;&#x548C;&#x6574;&#x987F;&#x4E4B;&#x95F4;&#x4E0D;&#x65AD;&#x7684;&#x62C9;&#x952F;&#x6218;&#x662F;&#x7D27;&#x5F20;&#x7684;&#x6765;&#x6E90;&#x3002;&#x5C31;&#x50CF;&#x5728;&#x4EFB;&#x4F55;&#x5927;&#x578B;&#x7EC4;&#x7EC7;&#x4E2D;&#x4E00;&#x6837;&#xFF0C;&#x7EF4;&#x62A4;&#x73B0;&#x72B6;&#x548C;&#x670D;&#x52A1;&#x5F53;&#x524D;&#x7528;&#x6237;&#x7684;&#x4EBA;&#x6709;&#x7EC4;&#x7EC7;&#x4E0A;&#x4F18;&#x52BF;&#x3002;&#x5728;&#x300A;C++ &#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#xFF08;&#x7B2C;&#x4E09;&#x7248;&#xFF09;&#x300B;[Stroustrup 1997] &#x4E2D;&#xFF0C;&#x6211;&#x5F15;&#x7528;&#x4E86;&#x5C3C;&#x79D1;&#x6D1B;&#xB7;&#x9A6C;&#x57FA;&#x96C5;&#x7EF4;&#x5229;&#xFF08;Niccol&#xF2; Machiavelli&#xFF09;&#x7684;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x5F00;&#x521B;&#x4E00;&#x79CD;&#x65B0;&#x79E9;&#x5E8F;&#x66F4;&#x96BE;&#x4E8E;&#x63A8;&#x884C;&#x3001;&#x66F4;&#x8BA9;&#x4EBA;&#x6000;&#x7591;&#x80FD;&#x5426;&#x6210;&#x529F;&#x3001;&#x5904;&#x7406;&#x8D77;&#x6765;&#x66F4;&#x52A0;&#x5371;&#x9669;&#x3002;&#x56E0;&#x4E3A;&#x6539;&#x9769;&#x8005;&#x4F1A;&#x4E0E;&#x6240;&#x6709;&#x4ECE;&#x65E7;&#x79E9;&#x5E8F;&#x4E2D;&#x83B7;&#x5229;&#x7684;&#x4EBA;&#x4E3A;&#x654C;&#xFF0C;&#x800C;&#x6240;&#x6709;&#x4ECE;&#x65B0;&#x79E9;&#x5E8F;&#x4E2D;&#x83B7;&#x5229;&#x7684;&#x4EBA;&#x5374;&#x53EA;&#x662F;&#x51B7;&#x6DE1;&#x7684;&#x634D;&#x536B;&#x8005;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x7684;&#x89C2;&#x70B9;&#x662F; C++ &#x9700;&#x8981;&#x663E;&#x8457;&#x7684;&#x6539;&#x8FDB;&#x6765;&#x66F4;&#x597D;&#x5730;&#x670D;&#x52A1;&#x4E8E;&#x5B83;&#x7684;&#x7528;&#x6237;&#x7FA4;&#x4F53;&#x3002;C++ &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x5927;&#x89C4;&#x6A21;&#x90E8;&#x7F72;&#xFF0C;&#x4F46;&#x662F;&#x65B0;&#x9879;&#x76EE;&#x901A;&#x5E38;&#x9009;&#x62E9;&#x66F4;&#x6D41;&#x884C;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4E00;&#x4E9B;&#x6210;&#x529F;&#x7684; C++ &#x9879;&#x76EE;&#x88AB;&#x6539;&#x5199;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x8C37;&#x6B4C;&#x7684;&#x8BB8;&#x591A;&#x5927;&#x89C4;&#x6A21;&#x5E94;&#x7528;&#xFF0C;&#x5982;&#x641C;&#x7D22;&#xFF0C;&#x4E00;&#x76F4;&#x662F;&#x57FA;&#x4E8E;&#x4ED6;&#x4EEC;&#x7684; map-reduce &#x6846;&#x67B6; [Dean and Ghemawat 2004, 2008]&#x3002;&#x5B83;&#x5C31;&#x662F; C++ &#x7A0B;&#x5E8F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x56E0;&#x4E3A;&#x5546;&#x4E1A;&#x539F;&#x56E0;&#x662F;&#x4E13;&#x6709;&#x7684;&#xFF0C;&#x4EBA;&#x4EEC;&#x590D;&#x5236;&#x4E86;&#x5B83;&#xFF0C;&#x800C;&#x5F00;&#x6E90;&#x7684; map-reduce &#x6846;&#x67B6;&#xFF08;Hadoop&#xFF09;&#x51FA;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#x662F;&#x7528; Java &#x5B9E;&#x73B0;&#x7684;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E; C++ &#x793E;&#x533A;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4EF6;&#x61BE;&#x4E8B;&#x3002;</p>
<p>&#x5F00;&#x53D1;&#x8F6C;&#x5411;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x6A21;&#x677F;&#x63D0;&#x4F9B;&#x7684;&#x63A5;&#x53E3;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x4F7F;&#x5F97;&#x4F7F;&#x7528;&#x6240;&#x6709; C++ &#x7279;&#x6027;&#x5E76;&#x63D0;&#x4F9B;&#x7A33;&#x5B9A;&#x7684; ABI &#x53D8;&#x5F97;&#x6781;&#x5176;&#x56F0;&#x96BE;&#xFF1A;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7A33;&#x5B9A;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x7EC4;&#x7EC7;&#x90FD;&#x505A;&#x4E0D;&#x5230;&#x4E24;&#x8005;&#x517C;&#x987E;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x4EBA;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x9700;&#x8981; C++ &#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B; C&#x3001;Java&#x3001;C# &#x4E4B;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x4FC3;&#x6210;&#x56E0;&#x7D20;&#x3002;C++ &#x7684; ABI &#x7A33;&#x5B9A;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x6280;&#x672F;&#x96BE;&#x9898;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x56E0;&#x4E3A; C++ &#x6807;&#x51C6;&#x5FC5;&#x987B;&#x72EC;&#x7ACB;&#x4E8E;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x66F4;&#x8BA9; C++ &#x793E;&#x533A;&#x7684;&#x95EE;&#x9898;&#x96EA;&#x4E0A;&#x52A0;&#x971C;&#x7684;&#x662F;&#xFF0C;&#x5230;&#x4E86; 2006 &#x5E74;&#xFF0C;&#x968F;&#x7740;&#x7EB8;&#x8D28;&#x51FA;&#x7248;&#x7684;&#x8870;&#x9000;&#xFF0C;&#x4EE5;&#x53CA;&#x8BB0;&#x8005;&#x4EEC;&#x5173;&#x6CE8;&#x66F4;&#x6D41;&#x884C;&#x7684;&#x6280;&#x672F;&#x548C;&#x5E7F;&#x544A;&#x6536;&#x5165;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x62A5;&#x9053; C++ &#x7684;&#x4E13;&#x4E1A;&#x8F6F;&#x4EF6;&#x6742;&#x5FD7;&#x5DF2;&#x7ECF;&#x6D88;&#x4EA1;&#x3002;Dr. Dobbs &#x671F;&#x520A;&#x8FD8;&#x652F;&#x6491;&#x4E86;&#x51E0;&#x5E74;&#xFF08;2009 &#x5E74; 2 &#x6708;&#x505C;&#x520A;&#xFF09;&#x3002;C++ &#x4F1A;&#x8BAE;&#x88AB;&#x5438;&#x6536;&#x5230;&#x201C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x201D;&#x6216;&#x4E00;&#x822C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4F1A;&#x8BAE;&#x4E2D;&#xFF0C;&#x5265;&#x593A;&#x4E86; C++ &#x793E;&#x533A;&#x5C55;&#x793A;&#x65B0;&#x53D1;&#x5C55;&#x7684;&#x573A;&#x6240;&#x3002;&#x4E66;&#x7C4D;&#x4ECD;&#x5728;&#x7F16;&#x5199;&#x4E2D;&#xFF0C;&#x4F46;&#x7A0B;&#x5E8F;&#x5458;&#x9605;&#x8BFB;&#x7684;&#x4E66;&#x7C4D;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF08;&#x6216;&#x81F3;&#x5C11;&#x8D2D;&#x4E70;&#x7684;&#x4E66;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x56E0;&#x4E3A;&#x76D7;&#x7248;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x6B64;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x53EF;&#x9760;&#xFF09;&#xFF0C;&#x5728;&#x7EBF;&#x8D44;&#x6E90;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x53D7;&#x6B22;&#x8FCE;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x66F4;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x662F; C++ &#x5728;&#x6559;&#x80B2;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x6B63;&#x5728;&#x6025;&#x5267;&#x4E0B;&#x964D;&#x3002;C++ &#x4E0D;&#x518D;&#x662F;&#x201C;&#x65B0;&#x7684;&#x3001;&#x6709;&#x8DA3;&#x7684;&#x201D;&#xFF0C;&#x800C; Java &#x6B63;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x3001;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x8BED;&#x8A00;&#x88AB;&#x76F4;&#x63A5;&#x63A8;&#x5411;&#x5927;&#x5B66;&#x3002;&#x7F8E;&#x56FD;&#x9AD8;&#x4E2D;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x8003;&#x8BD5;&#x7A81;&#x7136;&#x4ECE; C++ &#x53D8;&#x6210;&#x4E86; Java&#x3002;&#x5728;&#x5927;&#x5B66;&#x91CC;&#xFF0C;Java &#x4F5C;&#x4E3A;&#x5165;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x4F7F;&#x7528;&#x6025;&#x5267;&#x589E;&#x52A0;&#x3002;C++ &#x7684;&#x6559;&#x5B66;&#x8D28;&#x91CF;&#x4E5F;&#x5728;&#x4E0B;&#x964D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x8BFE;&#x7A0B;&#x4F18;&#x5148;&#x9009;&#x62E9; C &#x8BED;&#x8A00;&#xFF0C;&#x6216;&#x8005;&#x8BA4;&#x4E3A;&#x4E25;&#x91CD;&#x4F9D;&#x8D56;&#x7C7B;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x662F;&#x552F;&#x4E00;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x5F31;&#x5316;&#x4E86; C++ &#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x5B8F;&#x3002;&#x6807;&#x51C6;&#x5E93;&#xFF08;&#x4F9D;&#x9760;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#xFF1B;&#xFF08;<a href="#22-&#x7B2C;&#x4E8C;&#x4E2A;&#x5341;&#x5E74;">&#xA7;2.2</a>&#xFF09;&#xFF09;&#x548C; RAII&#xFF08;&#x4F9D;&#x8D56;&#x6784;&#x9020;&#x51FD;&#x6570;/&#x6790;&#x6784;&#x51FD;&#x6570;&#x5BF9;&#xFF08;<a href="#221-&#x8BED;&#x8A00;&#x7279;&#x6027;">&#xA7;2.2.1</a>&#xFF09;&#xFF09;&#x7ECF;&#x5E38;&#x88AB;&#x5B8C;&#x5168;&#x6392;&#x9664;&#x5728;&#x57FA;&#x7840;&#x8BFE;&#x7A0B;&#x4E4B;&#x5916;&#xFF0C;&#x6216;&#x8005;&#x88AB;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6240;&#x8C13;&#x7684;&#x201C;&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x201D;&#x90E8;&#x5206;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5B66;&#x751F;&#x8981;&#x4E48;&#x4ECE;&#x672A;&#x63A5;&#x89E6;&#x8FC7;&#xFF0C;&#x8981;&#x4E48;&#x8BA4;&#x4E3A;&#x5B83;&#x5F88;&#x53EF;&#x6015;&#x3002;&#x6559;&#x79D1;&#x4E66;&#x7ECF;&#x5E38;&#x9677;&#x5165;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x4F8B;&#x5916;&#xFF0C;&#x4F46;&#x5E73;&#x5747;&#x6765;&#x8BF4;&#xFF0C;&#x5448;&#x73B0;&#x7ED9;&#x5B66;&#x751F;&#x7684; C++ &#x8FDC;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x7684;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x3002;&#x5728; 2005 &#x5E74;&#xFF0C;&#x6211;&#x63A5;&#x53D7;&#x4E86;&#x6311;&#x6218;&#xFF0C;&#x7ED9;&#x5927;&#x5B66;&#x4E00;&#x5E74;&#x7EA7;&#x7684;&#x5B66;&#x751F;&#x6559;&#x7F16;&#x7A0B;&#x3002;&#x6211;&#x8C03;&#x67E5;&#x4E86;&#x5927;&#x7EA6;&#x4E8C;&#x5341;&#x672C;&#x6700;&#x6D41;&#x884C;&#x7684; C++ &#x7F16;&#x7A0B;&#x6559;&#x6750;&#xFF0C;&#x6700;&#x540E;&#x5927;&#x58F0;&#x62B1;&#x6028;&#xFF1A;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x90A3;&#x5C31;&#x662F; C++&#xFF0C;&#x6211;&#x4E5F;&#x4F1A;&#x4E0D;&#x559C;&#x6B22;&#x5B83;&#xFF01;</p>
</blockquote>
<p>&#x5728;&#x7528;&#x4E00;&#x672C;&#x8457;&#x540D;&#x7684;&#x6559;&#x79D1;&#x4E66;&#x6559;&#x4E86;&#x4E00;&#x5E74;&#x4E66;&#x540E;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x53EA;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x6559;&#x6848;&#xFF0C;&#x5E76;&#x4E14;&#x5728; 2008 &#x5E74;&#x51FA;&#x7248;&#x4E86;&#x300A;C++ &#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#xFF1A;&#x539F;&#x7406;&#x4E0E;&#x5B9E;&#x8DF5;&#x300B;&#xFF08;<em>Programming: Principles and Practice Using C++</em>&#xFF09;[Stroustrup 2008a]&#xFF0C;&#x4F46;&#x76F4;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x8BB8;&#x591A; C++ &#x6559;&#x5B66;&#x4ECD;&#x5E26;&#x6709; 1980 &#x5E74;&#x4EE3;&#x7684;&#x7279;&#x8272;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;C++ &#x7684;&#x4F7F;&#x7528;&#x53C8;&#x5F00;&#x59CB;&#x589E;&#x52A0;&#x4E86;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6839;&#x672C;&#x7684;&#x6280;&#x672F;&#x8D8B;&#x52BF;&#x518D;&#x6B21;&#x9752;&#x7750; C++&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5341;&#x5E74;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x5019;&#xFF0C;C++11 &#x7684;&#x51FA;&#x73B0;&#x4E5F;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<p>Boost &#x5E93;&#x548C; Boost &#x7EC4;&#x7EC7;&#x975E;&#x5E38;&#x91CD;&#x8981; [Boost 1998&#x2013;2020]&#x3002;1998 &#x5E74;&#xFF0C;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x53CA; WG21 &#x7684;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x6210;&#x5458; Beman Dawes &#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x201C;C++ &#x4EE3;&#x7801;&#x5E93;&#x7F51;&#x7AD9;&#x201D;[Dawes 1998]&#xFF0C;&#x5176;&#x660E;&#x786E;&#x76EE;&#x6807;&#x662F;&#x5F00;&#x53D1; C++ &#x5E93;&#x4EE5;&#x786E;&#x7ACB;&#x73B0;&#x6709;&#x5B9E;&#x8DF5;&#xFF0C;&#x4F7F;&#x5F97;&#x672A;&#x6765;&#x7684;&#x6807;&#x51C6;&#x5316;&#x53EF;&#x4EE5;&#x636E;&#x6B64;&#x8FDB;&#x884C;&#x3002;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;C++ &#x751A;&#x81F3;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#x3002;Boost &#x6162;&#x6162;&#x6210;&#x957F;&#x4E3A;&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x6709;&#x65B0;&#x5E93;&#x7684;&#x540C;&#x884C;&#x8BC4;&#x5BA1;&#x548C;&#x4E00;&#x5E74;&#x4E00;&#x5EA6;&#x7684;&#x4F1A;&#x8BAE;&#x3002;Boost &#x5E93;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x6700;&#x6D41;&#x884C;&#x7684;&#x88AB;&#x5438;&#x6536;&#x5230;&#x6807;&#x51C6;&#x4E2D;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;<code>regex</code>&#xFF08;<a href="04.html#46-c11&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;">&#xA7;4.6</a>&#xFF09;&#x3001;<code>thread</code>&#xFF08;<a href="04.html#412-&#x7EBF;&#x7A0B;&#x548C;&#x9501;">&#xA7;4.1.2</a>&#xFF09;&#x3001;<code>shared_ptr</code>&#xFF08;<a href="04.html#46-c11&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;">&#xA7;4.6</a>&#xFF09;&#x3001;<code>variant</code>&#xFF08;<a href="08.html#83-variantoptional-&#x548C;-any">&#xA7;8.3</a>&#xFF09;&#x548C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;<a href="08.html#86-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;">&#xA7;8.6</a>&#xFF09;&#xFF09;&#x3002;&#x5BF9;&#x4E8E; C++ &#x793E;&#x533A;&#x6765;&#x8BF4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;Boost &#x5E93;&#x6BD4;&#x5B83;&#x4EEC;&#x7684; ISO &#x6807;&#x51C6;&#x7248;&#x672C;&#x65E9;&#x5341;&#x591A;&#x5E74;&#xFF0C;&#x4F46;&#x4ECD;&#x88AB;&#x5F53;&#x4F5C;&#x67D0;&#x79CD;&#x201C;&#x9884;&#x5907;&#x6807;&#x51C6;&#x201D;&#x6765;&#x4FE1;&#x4EFB;&#x3002;&#x6709;&#x8BB8;&#x591A;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x90FD;&#x53C2;&#x4E0E;&#x4E86; Boost&#xFF0C;&#x7279;&#x522B;&#x662F; Dave Abrahams&#x3001;Doug Gregor&#x3001;Jaakko J&#xE4;rvi&#x3001;Andrew Sutton&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x6709; Beman Dawes&#x3002;</p>
<p>&#x5230; 2006 &#x5E74;&#xFF0C;C++ &#x5728;&#x4E1A;&#x754C;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x662F;&#x65B0;&#x9C9C;&#x523A;&#x6FC0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x5B83;&#x904D;&#x5E03;&#x5F88;&#x591A;&#x884C;&#x4E1A;&#x3002;&#x5728; C++ &#x8BDE;&#x751F;&#x7684;&#x7535;&#x4FE1;&#x884C;&#x4E1A;&#xFF0C;&#x5B83;&#x4E00;&#x76F4;&#x88AB;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x3002;&#x4ECE;&#x7535;&#x4FE1;&#x9886;&#x57DF;&#x51FA;&#x53D1;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x6269;&#x5C55;&#x5230;&#x6E38;&#x620F;&#xFF08;&#x5982; Unreal&#x3001;PlayStation&#x3001;Xbox &#x548C; Douglas Adams &#x7684;&#x300A;&#x5B87;&#x5B99;&#x98DE;&#x8239;&#x6CF0;&#x5766;&#x300B;&#xFF09;&#x3001;&#x91D1;&#x878D;&#xFF08;&#x5982;&#x6469;&#x6839;&#x58EB;&#x4E39;&#x5229;&#x548C; Renaissance Technologies&#xFF09;&#x3001;&#x5FAE;&#x7535;&#x5B50;&#xFF08;&#x5982;&#x82F1;&#x7279;&#x5C14;&#x548C; Mentor Graphics&#xFF09;&#x3001;&#x7535;&#x5F71;&#xFF08;&#x5982;&#x76AE;&#x514B;&#x65AF;&#x548C; Maya&#xFF09;&#x3001;&#x822A;&#x7A7A;&#x822A;&#x5929;&#xFF08;&#x5982;&#x6D1B;&#x514B;&#x5E0C;&#x5FB7;&#xB7;&#x9A6C;&#x4E01;&#x548C;&#x7F8E;&#x56FD;&#x56FD;&#x5BB6;&#x822A;&#x7A7A;&#x822A;&#x5929;&#x5C40;&#xFF09;&#x548C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x884C;&#x4E1A;&#x3002;</p>
<p>&#x5C31;&#x6211;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x7279;&#x522B;&#x559C;&#x6B22; C++ &#x5728;&#x79D1;&#x5B66;&#x548C;&#x5DE5;&#x7A0B;&#x4E2D;&#x7684;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x9AD8;&#x80FD;&#x7269;&#x7406;&#xFF08;&#x4F8B;&#x5982; CERN &#x6B27;&#x6D32;&#x6838;&#x5B50;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x3001;SLAC &#x56FD;&#x5BB6;&#x52A0;&#x901F;&#x5668;&#x5B9E;&#x9A8C;&#x5BA4;&#x3001;&#x8D39;&#x7C73;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF09;&#x3001;&#x751F;&#x7269;&#x5B66;&#xFF08;&#x4F8B;&#x5982;&#x4EBA;&#x7C7B;&#x57FA;&#x56E0;&#x7EC4;&#x9879;&#x76EE;&#xFF09;&#x3001;&#x7A7A;&#x95F4;&#x63A2;&#x7D22;&#xFF08;&#x4F8B;&#x5982;&#x706B;&#x661F;&#x6F2B;&#x6E38;&#x8F66;&#x548C;&#x6DF1;&#x7A7A;&#x901A;&#x4FE1;&#x7F51;&#x7EDC;&#xFF09;&#x3001;&#x533B;&#x5B66;&#x548C;&#x751F;&#x7269;&#x5B66;&#xFF08;&#x4F8B;&#x5982;&#x65AD;&#x5C42;&#x626B;&#x63CF;&#x3001;&#x5E38;&#x89C4;&#x6210;&#x50CF;&#x3001;&#x4EBA;&#x7C7B;&#x57FA;&#x56E0;&#x7EC4;&#x9879;&#x76EE;&#x548C;&#x76D1;&#x63A7;&#x8BBE;&#x5907;&#xFF09;&#x7B49;&#x7B49;&#x3002;</p>
<h2 id="24-&#x5176;&#x4ED6;&#x8BED;&#x8A00;">2.4 &#x5176;&#x4ED6;&#x8BED;&#x8A00;</h2>
<p>&#x4EBA;&#x4EEC;&#x5E38;&#x5E38;&#x4F1A;&#x5BFB;&#x627E;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5BF9; C++ &#x7684;&#x76F4;&#x63A5;&#x6280;&#x672F;&#x5F71;&#x54CD;&#x3002;&#x5176;&#x5B9E;&#x975E;&#x5E38;&#x4E4B;&#x5C11;&#x3002;&#x5178;&#x578B;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x5F71;&#x54CD;&#x6D8C;&#x73B0;&#x81EA;&#x5171;&#x540C;&#x7684;&#x524D;&#x4EE3;&#x8BED;&#x8A00;&#x548C;&#x5171;&#x540C;&#x601D;&#x60F3;&#xFF08;&#x800C;&#x975E;&#x7279;&#x5B9A;&#x7684;&#x73B0;&#x6709;&#x8BED;&#x8A00;&#xFF09;&#x3002;&#x6269;&#x5C55; C++ &#x7684;&#x51B3;&#x5B9A;&#x6027;&#x7406;&#x7531;&#x5F80;&#x5F80;&#x4E0E; C++ &#x793E;&#x533A;&#x4E2D;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x6709;&#x5173;&#x3002;&#x76F4;&#x63A5;&#x4ECE;&#x6D41;&#x884C;&#x8BED;&#x8A00;&#x4E2D;&#x501F;&#x9274;&#x7684;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x5E38;&#x89C1;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;&#x4EBA;&#x4EEC;&#x60F3;&#x8C61;&#x7684;&#x8981;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#x3002;&#x5927;&#x591A;&#x6570;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x90FD;&#x638C;&#x63E1;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x5BC6;&#x5207;&#x7559;&#x610F;&#xFF08;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E2D;&#xFF09;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#x3001;&#x5E93;&#x548C;&#x6280;&#x5DE7;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x5728;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x5BF9; C++ &#x7684;&#x67D0;&#x4E9B;&#x771F;&#x5B9E;&#x6216;&#x5047;&#x60F3;&#x7684;&#x5F71;&#x54CD;&#xFF1A;</p>
<ul>
<li><code>auto</code>&#x2014;&#x2014;&#x4ECE;&#x521D;&#x59CB;&#x5316;&#x5668;&#x63A8;&#x65AD;&#x7C7B;&#x578B;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5B83;&#x5728;&#x73B0;&#x4EE3;&#x8BED;&#x8A00;&#x4E2D;&#x5F88;&#x6D41;&#x884C;&#xFF0C;&#x4F46;&#x4E5F;&#x5DF2;&#x7531;&#x6765;&#x5DF2;&#x4E45;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x5B83;&#x7684;&#x6700;&#x65E9;&#x8D77;&#x6E90;&#xFF0C;&#x4F46;&#x6211;&#x5728; 1983 &#x5E74;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5E76;&#x4E0D;&#x8BA4;&#x4E3A;&#x5B83;&#x5F88;&#x65B0;&#x9896;&#xFF08;<a href="04.html#421-auto-&#x548C;-decltype">&#xA7;4.2.1</a>&#xFF09;&#x3002;</li>
<li><code>tuple</code>&#x2014;&#x2014;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6E90;&#x81EA;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x4F20;&#x7EDF;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x90FD;&#x6709;&#x5143;&#x7EC4;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x3002;C++ &#x6807;&#x51C6;&#x5E93; <code>tuple</code> &#x53CA;&#x5176;&#x8BB8;&#x591A;&#x7528;&#x6CD5;&#x90FD;&#x4ECE;&#x4E2D;&#x53D7;&#x5230;&#x542F;&#x53D1;&#x3002;<code>std::tuple</code> &#x6D3E;&#x751F;&#x81EA; <code>boost::tuple</code> [Boost 1998&#x2013;2020]&#xFF08;<a href="04.html#434-tuple">&#xA7;4.3.4</a>&#xFF09;&#x3002;</li>
<li><code>regex</code>&#x2014;&#x2014;&#x52A0;&#x5165; C++11 &#x7684;&#x6807;&#x51C6;&#x5E93; <code>regex</code> &#x662F;&#xFF08;&#x7ECF;&#x7531; Boost&#xFF1B;&#x5DF2;&#x81F4;&#x8C22;&#xFF09;&#x4ECE; Unix &#x548C; JavaScript &#x7684;&#x529F;&#x80FD;&#x4E2D;&#x62F7;&#x8D1D;&#x6765;&#x7684;&#xFF08;<a href="04.html#46-c11&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;">&#xA7;4.6</a>&#xFF09;&#x3002;</li>
<li>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x2014;&#x2014;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7279;&#x6027;&#x548C; C++ &#x6784;&#x4EF6;&#x4E4B;&#x95F4;&#x6709;&#x8BB8;&#x591A;&#x660E;&#x663E;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3002;&#x5927;&#x591A;&#x6570;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x8BED;&#x8A00;&#x7279;&#x6027;&#xFF0C;&#x800C;&#x662F;&#x7F16;&#x7A0B;&#x6280;&#x5DE7;&#x3002;STL &#x53D7;&#x5230;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x542F;&#x53D1;&#xFF0C;&#x5E76;&#x9996;&#x5148;&#x5728; Scheme [Stepanov 1986] &#x548C; Ada [Musser and Stepanov 1987] &#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x5C1D;&#x8BD5;&#xFF08;&#x672A;&#x6210;&#x529F;&#xFF09;&#x3002;</li>
<li><code>future</code> &#x548C; <code>promise</code>&#x2014;&#x2014;&#x6E90;&#x81EA; Multilisp&#xFF0C;&#x7ECF;&#x7531;&#x5176;&#x4ED6; Lisp &#x65B9;&#x8A00;&#xFF08;<a href="04.html#413-&#x671F;&#x503C;future">&#xA7;4.1.3</a>&#xFF09;&#x3002;</li>
<li>&#x8303;&#x56F4; <code>for</code>&#x2014;&#x2014;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x6709;&#x5BF9;&#x5E94;&#x7269;&#xFF0C;&#x4F46;&#x76F4;&#x63A5;&#x542F;&#x53D1;&#x6765;&#x81EA; STL &#x5E8F;&#x5217;&#xFF08;<a href="04.html#422-&#x8303;&#x56F4;-for">&#xA7;4.2.2</a>&#xFF09;&#x3002;</li>
<li><code>variant</code>&#x3001;<code>any</code> &#x548C; <code>optional</code>&#x2014;&#x2014;&#x663E;&#x7136;&#x53D7;&#x5230;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x542F;&#x53D1;&#xFF08;<a href="08.html#83-variantoptional-&#x548C;-any">&#xA7;8.3</a>&#xFF09;&#x3002;</li>
<li>lambda &#x8868;&#x8FBE;&#x5F0F;&#x2014;&#x2014;&#x663E;&#x7136;&#xFF0C;&#x90E8;&#x5206;&#x7075;&#x611F;&#x6765;&#x81EA;&#x4E8E;&#x51FD;&#x6570;&#x5F0F;&#x8BED;&#x8A00;&#x4E2D; lambda &#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728; C++ &#x4E2D;&#xFF0C;lambda &#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6839;&#x6E90;&#x8FD8;&#x53EF;&#x4EE5;&#x4E0A;&#x6EAF;&#x5230; BCPL &#x8BED;&#x8A00;&#x4E2D;&#x7528;&#x4F5C;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x3001;&#x5C40;&#x90E8;&#x51FD;&#x6570;&#xFF08;&#x591A;&#x6B21;&#x88AB; C &#x548C; C++ &#x62D2;&#x7EDD;&#xFF0C;&#x56E0;&#x5176;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x4E14;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x6027;&#xFF09;&#x548C;&#xFF08;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF09;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#xFF08;<a href="04.html#431-lambda-&#x8868;&#x8FBE;&#x5F0F;">&#xA7;4.3.1</a>&#xFF09;&#x3002;</li>
<li><code>final</code> &#x548C; <code>override</code>&#x2014;&#x2014;&#x7528;&#x4E8E;&#x66F4;&#x660E;&#x786E;&#x5730;&#x7BA1;&#x7406;&#x7C7B;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8BB8;&#x591A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;&#x5728;&#x65E9;&#x671F;&#x7684; C++ &#x4E2D;&#x5DF2;&#x7ECF;&#x8003;&#x8651;&#x8FC7;&#x5B83;&#x4EEC;&#x4E86;&#xFF0C;&#x4F46;&#x5F53;&#x65F6;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x3002;</li>
<li>&#x4E09;&#x5411;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26; <code>&lt;=&gt;</code>&#xFF0C;&#x53D7; C &#x7684; <code>strcmp</code> &#x53CA; PERL&#x3001;PHP&#x3001;Python &#x548C; Ruby &#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x542F;&#x53D1;&#xFF08;<a href="09.html#934-">&#xA7;9.3.4</a>&#xFF09;&#x3002;</li>
<li><code>await</code>&#x2014;&#x2014;C++ &#x91CC;&#x6700;&#x65E9;&#x7684;&#x534F;&#x7A0B;&#xFF08;<a href="01.html#11-&#x5E74;&#x8868;">&#xA7;1.1</a>&#xFF09;&#x53D7; Simula &#x542F;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x5E93;&#x63D0;&#x4F9B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F5C;&#x4E3A;&#x8BED;&#x8A00;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x5176;&#x4ED6;&#x66FF;&#x4EE3;&#x7684;&#x5E76;&#x53D1;&#x6280;&#x672F;&#x7559;&#x51FA;&#x7A7A;&#x95F4;&#x3002;C++20 &#x4E2D;&#x7684;&#x65E0;&#x6808;&#x534F;&#x7A0B;&#x7684;&#x601D;&#x60F3;&#x4E3B;&#x8981;&#x6765;&#x81EA; F#&#xFF08;<a href="09.html#932-&#x534F;&#x7A0B;">&#xA7;9.3.2</a>&#xFF09;&#x3002;</li>
</ul>
<p>&#x5373;&#x4F7F;&#x4EE5;&#x975E;&#x5E38;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#x4ECE;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x501F;&#x7528;&#x4E86;&#x67D0;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x8BE5;&#x7279;&#x6027;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x4E3A;&#x4E86;&#x9002;&#x5408; C++ &#x8BED;&#x6CD5;&#x4F1A;&#x53D1;&#x751F;&#x5F88;&#x5927;&#x53D8;&#x5316;&#x3002;&#x5F53;&#x4ECE;&#x652F;&#x6301;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x8BED;&#x8A00;&#x501F;&#x9274;&#x65F6;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x95EE;&#x9898;&#x5FC5;&#x987B;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#x3002;&#x800C; C++ &#x533A;&#x5206;&#x5BF9;&#x8C61;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x4F7F;&#x5F97; C++ &#x9700;&#x8981;&#x4EE5;&#x548C;&#x539F;&#x8BED;&#x8A00;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x5728;&#x201C;&#x7FFB;&#x8BD1;&#x201D;&#x6210; C++ &#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x53D1;&#x73B0;&#x5168;&#x65B0;&#x7684;&#x7528;&#x6CD5;&#x3002;&#x5728;&#x628A; lambda &#x5F15;&#x5165; C++ &#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x5927;&#x91CF;&#x6B64;&#x7C7B;&#x73B0;&#x8C61;&#x7684;&#x4F8B;&#x5B50;&#xFF08;<a href="04.html#431-lambda-&#x8868;&#x8FBE;&#x5F0F;">&#xA7;4.3.1</a>&#xFF09;&#x3002;</p>
<p>&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x60F3;&#x8C61;&#x4E2D;&#xFF0C;&#x6211;&#xFF08;&#x548C;&#x5176;&#x4ED6;&#x53C2;&#x4E0E; C++ &#x7684;&#x4EBA;&#xFF09;&#x6574;&#x65E5;&#x65E0;&#x6240;&#x4E8B;&#x4E8B;&#xFF0C;&#x6EE1;&#x8111;&#x5B50;&#x60F3;&#x7684;&#x662F;&#x5728;&#x6D41;&#x884C;&#x8BED;&#x8A00;&#x4E2D;&#x5982;&#x4F55;&#x5360;&#x636E;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#xFF0C;&#x4E3A;&#x8FD9;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x8BED;&#x8A00;&#x6218;&#x4E89;&#x5236;&#x5B9A;&#x6218;&#x7565;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x5728;&#x90A3;&#x4E0A;&#x9762;&#x82B1;&#x65F6;&#x95F4;&#x3002;&#x5927;&#x591A;&#x6570;&#x65E5;&#x5B50;&#x91CC;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x53BB;&#x601D;&#x8003;&#x5176;&#x4ED6;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x9664;&#x975E;&#x6211;&#x78B0;&#x5DE7;&#x51FA;&#x4E8E;&#x4E00;&#x822C;&#x7684;&#x6280;&#x672F;&#x5174;&#x8DA3;&#x53BB;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x6216;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x5B8C;&#x6210;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x8981;&#x505A;&#x7684;&#x662F;&#x4E0E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4EA4;&#x8C08;&#xFF0C;&#x8003;&#x8651;&#x4EBA;&#x4EEC;&#x5728;&#x4F7F;&#x7528; C++ &#x65F6;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x6F6E;&#x6C34;&#x822C;&#x6D8C;&#x5165;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x6539;&#x8FDB;&#x5EFA;&#x8BAE;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4E5F;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x6765;&#x4F53;&#x9A8C;&#x95EE;&#x9898;&#x5E76;&#x6D4B;&#x8BD5;&#x6539;&#x8FDB;&#x601D;&#x8DEF;&#x3002;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x8981;&#x80FD;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#x51B7;&#x9759;&#x5730;&#x8003;&#x8651;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x6839;&#x672C;&#x7684;&#xFF0C;&#x4EC0;&#x4E48;&#x53EA;&#x662F;&#x4E00;&#x65F6;&#x6D41;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x4F1A;&#x9020;&#x6210;&#x5371;&#x5BB3;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;C++ &#x5BF9;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x8D21;&#x732E;&#x4E5F;&#x96BE;&#x4EE5;&#x4F30;&#x91CF;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x7C7B;&#x4F3C;&#x7684;&#x7279;&#x6027;&#x662F;&#x5E73;&#x884C;&#x6F14;&#x5316;&#x7684;&#xFF0C;&#x6216;&#x6709;&#x7740;&#x5171;&#x540C;&#x7684;&#x6839;&#x6E90;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>Java &#x548C; C# &#x4E2D;&#x7684;&#x6CDB;&#x578B;&#x2014;&#x2014;&#x4ED6;&#x4EEC;&#x91C7;&#x7528;&#x4E86;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x6CDB;&#x578B;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x91C7;&#x7528;&#x4E86; C++ &#x8BED;&#x6CD5;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x5728; C++ &#x5927;&#x89C4;&#x6A21;&#x5C55;&#x793A;&#x4E86;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x7684;&#x7528;&#x9014;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x6DFB;&#x52A0;&#x6CDB;&#x578B;&#x3002;</li>
<li>Java&#x3001;Python &#x7B49;&#x7684;&#x8D44;&#x6E90;&#x5F03;&#x7F6E;&#x60EF;&#x7528;&#x6CD5;&#xFF08;dispose idiom&#xFF09;&#x2014;&#x2014;&#x8FD9;&#x5927;&#x81F4;&#x662F;&#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x8BED;&#x8A00;&#x4E2D;&#x6700;&#x80FD;&#x63A5;&#x8FD1;&#x6790;&#x6784;&#x51FD;&#x6570;&#x7684;&#x505A;&#x6CD5;&#x4E86;&#x3002;</li>
<li>D &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x671F;&#x6C42;&#x503C;&#x2014;&#x2014;&#x6211;&#x5411; Walter Bright &#x89E3;&#x91CA;&#x4E86;&#x65E9;&#x671F;&#x7684; constexpr &#x8BBE;&#x8BA1;&#x3002;</li>
<li>C++ &#x57FA;&#x4E8E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x7684;&#x5BF9;&#x8C61;&#x751F;&#x5B58;&#x671F;&#x6A21;&#x578B;&#x662F; Rust &#x7075;&#x611F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x597D;&#x7B11;&#x7684;&#x662F;&#xFF0C;&#x6700;&#x8FD1; C++ &#x7ECF;&#x5E38;&#x88AB;&#x6307;&#x8D23;&#x4ECE; Rust &#x90A3;&#x91CC;&#x501F;&#x7528;&#x4E86;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x3002;</li>
<li>C &#x91C7;&#x7528;&#x4E86; C++11 &#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x3001;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x548C;&#x5B9A;&#x4E49;&#x8BED;&#x6CD5;&#x3001;&#x4EE5;&#x58F0;&#x660E;&#x4E3A;&#x8BED;&#x53E5;&#x3001;<code>const</code>&#x3001;<code>//</code> &#x6CE8;&#x91CA;&#x3001;<code>inline</code> &#x4EE5;&#x53CA; <code>for</code> &#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x521D;&#x59CB;&#x5316;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</li>
</ul>
<p>C++ &#x4E0E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E4B;&#x95F4;&#x7684;&#x8BB8;&#x591A;&#x5DEE;&#x5F02;&#x6E90;&#x4E8E; C++ &#x5BF9;&#x6790;&#x6784;&#x51FD;&#x6570;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x8BED;&#x8A00;&#x5F88;&#x96BE;&#x76F4;&#x63A5;&#x4ECE; C++ &#x501F;&#x7528;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01.html" class="navigation navigation-prev " aria-label="Previous page: 1. 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="03.html" class="navigation navigation-next " aria-label="Next page: 3. C++ 标准委员会">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2. 背景：C++ 的 1979–2006","level":"1.3","depth":1,"next":{"title":"3. C++ 标准委员会","level":"1.4","depth":1,"path":"03.md","ref":"03.md","articles":[]},"previous":{"title":"1. 前言","level":"1.2","depth":1,"path":"01.md","ref":"01.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"02.md","mtime":"2023-07-06T11:17:01.970Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-07-06T11:29:00.567Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

