
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3. C++ 标准委员会 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="04.html" />
    
    
    <link rel="prev" href="02.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    1. 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    2. 背景：C++ 的 1979–2006
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    3. C++ 标准委员会
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    4. C++11：感觉像是门新语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    5. C++14：完成 C++11
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    6. 概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    7. 错误处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08.html">
            
                <a href="08.html">
            
                    
                    8. C++17：大海迷航
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09.html">
            
                <a href="09.html">
            
                    
                    9. C++20：方向之争
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10. 2020 年的 C++
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11. 回顾
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >3. C++ 标准委员会</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="3-c-&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;">3. C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;</h1>
<p>&#x56FD;&#x9645; C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6B63;&#x5F0F;&#x540D;&#x79F0;&#x4E3A; <strong>ISO/IEC JTC1/SC22/WG21</strong>&#xFF0C;&#x5B83;&#x662F; C++ &#x53D1;&#x5C55;&#x7684;&#x6838;&#x5FC3;&#x3002;&#x81EA; 1991 &#x5E74;&#x6210;&#x7ACB;&#x4EE5;&#x6765;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x5982;&#x6B64;&#x3002;&#x800C;&#x4ECE; 1989 &#x5E74;&#x5F00;&#x59CB;&#x5230;&#x5B83;&#x6210;&#x7ACB;&#x4E4B;&#x524D;&#xFF0C;C++ &#x5F00;&#x53D1;&#x7684;&#x4E2D;&#x5FC3;&#x5219;&#x662F;&#x7F8E;&#x56FD;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x5B66;&#x4F1A;&#xFF08;ANSI&#xFF09;&#x7684; C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A; [Stroustrup 1993]&#x3002;C++ &#x6CA1;&#x6709;&#x8170;&#x7F20;&#x4E07;&#x8D2F;&#x7684;&#x6240;&#x6709;&#x8005;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x91CD;&#x8981;&#x7684;&#x8D44;&#x91D1;&#x63D0;&#x4F9B;&#x6765;&#x6E90;&#xFF0C;&#x56E0;&#x6B64;&#x793E;&#x533A;&#x4F9D;&#x8D56;&#x4E8E;&#x4F01;&#x4E1A;&#x5F00;&#x53D1;&#x548C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x5904;&#x4E8E;&#x76F8;&#x4E92;&#x7ADE;&#x4E89;&#x7684;&#x7EC4;&#x7EC7;&#x4E2D;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;WG21 &#x548C;&#x5404;&#x4E2A;&#x56FD;&#x5BB6;&#x7684;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x662F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x4F1A;&#x9762;&#x5E76;&#x8054;&#x5408;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x552F;&#x4E00;&#x573A;&#x5408;&#x3002;</p>
<p>&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x90FD;&#x662F;&#x5FD7;&#x613F;&#x8005;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5E26;&#x85AA;&#x7684;&#x79D8;&#x4E66;&#x5904;&#xFF0C;&#x867D;&#x7136;&#x8BB8;&#x591A;&#x59D4;&#x5458;&#x786E;&#x5B9E;&#x4EE5;&#x5176;&#x5DE5;&#x4F5C;&#x7EC4;&#x7EC7;&#x7684;&#x4EE3;&#x8868;&#x8EAB;&#x4EFD;&#x51FA;&#x73B0;&#x3002;&#x5728;&#x6BCF;&#x6B21;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4EBA;&#x81EA;&#x8C6A;&#x5730;&#x58F0;&#x79F0;&#x5C31;&#x4EE3;&#x8868;&#x201C;&#x81EA;&#x5DF1;&#x201D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x8D5E;&#x52A9;&#xFF0C;&#x53EA;&#x4EE3;&#x8868;&#x81EA;&#x5DF1;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x6362;&#x5DE5;&#x4F5C;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x4EE3;&#x8868;&#x65B0;&#x7EC4;&#x7EC7;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x5C11;&#x89C1;&#x3002;&#x8BB8;&#x591A;&#x4EBA;&#x4EE5;&#x201C;&#x53C2;&#x52A0; C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x201D;&#x4F5C;&#x4E3A;&#x63A5;&#x53D7;&#x65B0;&#x5DE5;&#x4F5C;&#x7684;&#x6761;&#x4EF6;&#x3002;&#x6709;&#x4EBA;&#x52A0;&#x5165;&#x4E86;&#x59D4;&#x5458;&#x4F1A;&#x6765;&#x5B66;&#x4E60; C++&#xFF0C;&#x6709;&#x4EBA;&#x5219;&#x628A;&#x201C;C++ &#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x201D;&#x5F53;&#x4F5C;&#x8D44;&#x683C;&#x6765;&#x5F15;&#x7528;&#xFF08;&#x5E76;&#x975E;&#x4E00;&#x5B9A;&#x662F;&#x771F;&#x7684;&#xFF09;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x4EBA;&#x4EC5;&#x53C2;&#x52A0;&#x8FC7;&#x51E0;&#x6B21;&#x4F1A;&#x8BAE;&#xFF0C;&#x4E0D;&#x90A3;&#x4E48;&#x7ECF;&#x5E38;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x4E00;&#x76F4;&#x53C2;&#x52A0;&#x4E86;&#x5927;&#x591A;&#x6570;&#x4F1A;&#x8BAE;&#xFF0C;&#x6570;&#x5341;&#x5E74;&#x6CA1;&#x6709;&#x95F4;&#x65AD;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x8FD8;&#x6709;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5E74;&#x5F00;&#x4E09;&#x6B21;&#x4F1A;&#x3002;&#x5728; 1998 &#x5E74;&#x6807;&#x51C6;&#x4E4B;&#x540E;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5E74;&#x53EA;&#x5F00;&#x4E24;&#x6B21;&#x4F1A;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x9664;&#x4E86;&#x9762;&#x5BF9;&#x9762;&#x7684;&#x4F1A;&#x8BAE;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7684;&#x7535;&#x8BDD;&#x4F1A;&#x8BAE;&#x8FDB;&#x884C;&#x8865;&#x5145;&#xFF0C;&#x4EE5;&#x53CA;&#x5929;&#x5929;&#x90FD;&#x6709;&#x7684;&#x5927;&#x91CF;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4F1A;&#x63CF;&#x8FF0;</p>
<ul>
<li>&#x6807;&#x51C6;&#x7684;&#x4F5C;&#x7528;&#xFF08;<a href="#31-&#x6807;&#x51C6;">&#xA7;3.1</a>&#xFF09;</li>
<li>&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x7EC4;&#x7EC7;&#xFF08;<a href="#32-&#x7EC4;&#x7EC7;">&#xA7;3.2</a>&#xFF09;</li>
<li>&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x7ED3;&#x6784;&#x5BF9; C++ &#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;&#xFF08;<a href="#33-&#x5BF9;&#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;">&#xA7;3.3</a>&#xFF09;</li>
</ul>
<h2 id="31-&#x6807;&#x51C6;">3.1 &#x6807;&#x51C6;</h2>
<p>&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x7F16;&#x5199;&#x6807;&#x51C6;&#x3002;&#x5236;&#x5B9A;&#x6807;&#x51C6;&#x7684;&#x4E00;&#x4E2A;&#x5B98;&#x65B9;&#x7406;&#x7531;&#x662F;&#x201C;<strong>&#x4FC3;&#x8FDB;&#x8D38;&#x6613;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x51CF;&#x5C11;&#x56FD;&#x9645;&#x8D38;&#x6613;&#x7684;&#x6280;&#x672F;&#x58C1;&#x5792;&#x548C;&#x4EBA;&#x4E3A;&#x969C;&#x788D;</strong>&#x201D;&#xFF0C;&#x53CA;&#x201C;<strong>&#x63D0;&#x4F9B;&#x5B9E;&#x73B0;&#x7ECF;&#x6D4E;&#x3001;&#x6548;&#x7387;&#x548C;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#x7684;&#x6846;&#x67B6;</strong>&#x201D;&#x3002;&#x6807;&#x51C6;&#x662F;&#x89C4;&#x8303;&#xFF0C;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x3002;&#x5B83;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4FDD;&#x6301;&#x591A;&#x4E2A;&#x5B9E;&#x73B0;&#x4E00;&#x81F4;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x201C;&#x4E00;&#x81F4;&#x6027;&#x201D;&#x5728;&#x4E00;&#x4E2A;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5229;&#x7528;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x5E95;&#x5C42;&#x786C;&#x4EF6;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x5230;&#x5E95;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x7406;&#x89E3;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x8981;&#x4E48;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x662F;&#x8BED;&#x8A00;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8981;&#x4E48;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x5F88;&#x96BE;&#x5728;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x3001;&#x901A;&#x5E38;&#x662F;&#x7ADE;&#x4E89;&#x6027;&#x7684;&#x7EC4;&#x7EC7;&#x4E4B;&#x95F4;&#x8FBE;&#x6210; 100&#xFF05; &#x7684;&#x534F;&#x8BAE;&#x3002;&#x5728; 1990 &#x5E74;&#x4EE3;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x8003;&#x8651;&#x8FC7;&#x5236;&#x5B9A;&#x5F62;&#x5F0F;&#x89C4;&#x7EA6;&#xFF08;formal specification&#xFF09;&#xFF0C;&#x4F46;&#x54A8;&#x8BE2;&#x8FC7;&#x4E16;&#x754C;&#x4E00;&#x6D41;&#x7684;&#x4E13;&#x5BB6;&#x540E;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x89C4;&#x7EA6;&#x6280;&#x672F;&#x7684;&#x8FDB;&#x5C55;&#x548C;&#x6210;&#x5458;&#x7684;&#x6C34;&#x5E73;&#x90FD;&#x8FD8;&#x8FBE;&#x4E0D;&#x5230;&#x5236;&#x5B9A; C++ &#x5F62;&#x5F0F;&#x89C4;&#x7EA6;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x8003;&#x8651;&#x8FC7;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x8BED;&#x8A00;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E0E;&#x786C;&#x4EF6;&#x4F7F;&#x7528;&#x548C;&#x4F18;&#x5316;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5DF2;&#x7ECF;&#x632B;&#x8D25;&#x4E86;&#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x6709;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x4F1A;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x4E5F;&#x4F1A;&#x4EE3;&#x4EF7;&#x8FC7;&#x5927;&#x3002;&#x8981;&#x4E48;&#x5C31;&#x5F97;&#x628A;&#x5B83;&#x7B80;&#x5316;&#x5230;&#x4E00;&#x79CD;&#x5BF9;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x7684;&#x56F0;&#x96BE;&#x95EE;&#x9898;&#x6B63;&#x662F;&#x6700;&#x9700;&#x8981;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#x7684;&#x573A;&#x5408;&#x3002;&#x518D;&#x6709;&#xFF0C;&#x5F53; N &#x4E2A;&#x5F7C;&#x6B64;&#x7ADE;&#x4E89;&#x7684;&#x5B9E;&#x73B0;&#x56E2;&#x961F;&#x8BB0;&#x5F55;&#x4ED6;&#x4EEC;&#x7684;&#x51B3;&#x7B56;&#x3001;&#x8FD0;&#x884C;&#x5E7F;&#x6CDB;&#x7684;&#x5408;&#x89C4;&#x6027;&#x6D4B;&#x8BD5;&#x5E76;&#x8BA8;&#x8BBA;&#x5B83;&#x4EEC;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x65F6;&#xFF0C;&#x4F1A;&#x6709;&#x4E9B;&#x610F;&#x5916;&#x6536;&#x83B7;&#xFF1B;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x63A9;&#x76D6;&#x6389;&#x8FD9;&#x6837;&#x7684;&#x610F;&#x5916;&#x6536;&#x83B7;&#x3002;&#x5BF9;&#x4E8E; C++&#xFF0C;&#x4ECE;&#x524D;&#x7AEF;&#x5B9E;&#x73B0;&#x6765;&#x8BF4;&#xFF08;Clang&#x3001;EDG&#x3001;GCC &#x548C;&#x5FAE;&#x8F6F;&#xFF09;N &#x81F3;&#x5C11;&#x4E3A; 4&#xFF0C;&#x81F3;&#x4E8E;&#x540E;&#x7AEF;&#xFF0C;N &#x5C11;&#x8BF4;&#x6709;&#x5341;&#x51E0;&#x4E2A;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6B63;&#x5728;&#x52AA;&#x529B;&#x89E3;&#x51B3;&#x62E5;&#x6709;&#x591A;&#x79CD;&#x5B9E;&#x73B0;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x3002;&#x53E6;&#x4E00;&#x6761;&#x8DEF;&#x662F;&#x5192;&#x9669;&#x641E;&#x5355;&#x4E00;&#x6587;&#x5316;&#x3002;&#x5982;&#x679C; C++ &#x6280;&#x672F;&#x53EA;&#x6765;&#x6E90;&#x4E8E;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x597D;&#x574F;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x201C;&#x552F;&#x4E00;&#x771F;&#x6B63;&#x5B9E;&#x73B0;&#x201D;&#x7684;&#x7EC4;&#x7EC7;&#x5C06;&#x5728;&#x793E;&#x533A;&#x4E2D;&#x62E5;&#x6709;&#x4E3B;&#x5BFC;&#x8BDD;&#x8BED;&#x6743;&#xFF0C;&#x4ED6;&#x4EEC;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x6240;&#x6709;&#x4EBA;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x4E00;&#x65E6;&#x6709;&#x8D44;&#x91D1;&#x95EE;&#x9898;&#x3001;&#x5546;&#x4E1A;&#x987E;&#x8651;&#x3001;&#x653F;&#x6CBB;&#x89C1;&#x89E3;&#x6216;&#x8005;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x4E00;&#x610F;&#x5B64;&#x884C;&#xFF0C;&#x5C31;&#x4F1A;&#x4E25;&#x91CD;&#x7834;&#x574F;&#x8BED;&#x8A00;&#x53CA;&#x5176;&#x7528;&#x6237;&#x7FA4;&#x4F53;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x597D;&#x574F;&#xFF0C;C++ &#x793E;&#x533A;&#x9009;&#x62E9;&#x4E86;&#x201C;&#x534A;&#x7EC4;&#x7EC7;&#x201D;&#x7684;&#x6DF7;&#x4E71;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x59D4;&#x5458;&#x4F1A;&#x52A0;&#x4E0A;&#x591A;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x5DE5;&#x5177;&#x53CA;&#x5E93;&#x7684;&#x4F9B;&#x5E94;&#x8005;&#x3002;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x7528;&#x7EDF;&#x4E00;&#x6240;&#x6709;&#x6743;&#x6216;&#x72EC;&#x88C1;&#x8005;&#x6A21;&#x5F0F;&#x3002;</p>
<h2 id="32-&#x7EC4;&#x7EC7;">3.2 &#x7EC4;&#x7EC7;</h2>
<p>&#x5BF9;&#x4E8E; C++17 &#x548C; C++ 20 &#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BCF;&#x6B21;&#x9762;&#x5BF9;&#x9762;&#x7684; WG21 &#x4F1A;&#x8BAE;&#x6709;&#x591A;&#x8FBE; 250 &#x4EBA;&#x51FA;&#x5E2D;&#xFF0C;&#x800C;&#x603B;&#x6210;&#x5458;&#x4EBA;&#x6570;&#x7EA6;&#x4E3A;&#x51FA;&#x5E2D;&#x4EBA;&#x6570;&#x7684;&#x4E24;&#x500D;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x52A0;&#x62FF;&#x5927;&#x3001;&#x82AC;&#x5170;&#x3001;&#x6CD5;&#x56FD;&#x3001;&#x5FB7;&#x56FD;&#x3001;&#x4FC4;&#x7F57;&#x65AF;&#x3001;&#x897F;&#x73ED;&#x7259;&#x3001;&#x82F1;&#x56FD;&#x3001;&#x7F8E;&#x56FD;&#x7B49;&#x5341;&#x51E0;&#x4E2A;&#x56FD;&#x5BB6;&#x90FD;&#x6709;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x4EE5;&#x53CA; C++ &#x6807;&#x51C6;&#x6280;&#x672F;&#x8054;&#x76DF;&#x7684;&#x4ED8;&#x8D39;&#x652F;&#x6301;&#x6210;&#x5458;&#x3002;&#x6210;&#x5458;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x767E;&#x591A;&#x4E2A;&#x7EC4;&#x7EC7;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x5927;&#x5BB6;&#x6709;&#x6240;&#x4E86;&#x89E3;&#xFF0C;&#x5728;&#x6B64;&#x5217;&#x4E3E;&#x90E8;&#x5206;&#x6210;&#x5458;&#x6240;&#x5C5E;&#x7EC4;&#x7EC7;&#xFF1A;&#x82F9;&#x679C;&#x3001;Bloomberg&#x3001;&#x6B27;&#x6D32;&#x6838;&#x5B50;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x3001;Codeplay&#x3001;EDG&#xFF08;Edison Design Group&#xFF09;&#x3001;Facebook&#x3001;&#x8C37;&#x6B4C;&#x3001;IBM&#x3001;&#x82F1;&#x7279;&#x5C14;&#x3001;&#x5FAE;&#x8F6F;&#x3001;&#x6469;&#x6839;&#x58EB;&#x4E39;&#x5229;&#x3001;&#x82F1;&#x4F1F;&#x8FBE;&#x3001;Qt&#x3001;&#x9AD8;&#x901A;&#x3001;&#x7EA2;&#x5E3D;&#x3001;Ripple&#x3001;&#x7F8E;&#x56FD; Sandia &#x56FD;&#x5BB6;&#x5B9E;&#x9A8C;&#x5BA4;&#x3001;&#x62C9;&#x73C0;&#x65AF;&#x7EF4;&#x5C14;&#x5E94;&#x7528;&#x79D1;&#x6280;&#x5927;&#x5B66;&#xFF08;HSR&#xFF09;&#x548C;&#x9A6C;&#x5FB7;&#x91CC;&#x5361;&#x6D1B;&#x65AF;&#x4E09;&#x4E16;&#x5927;&#x5B66;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x4F9B;&#x5E94;&#x8005;&#x3001;&#x786C;&#x4EF6;&#x4F9B;&#x5E94;&#x8005;&#x3001;&#x91D1;&#x878D;&#x3001;&#x6E38;&#x620F;&#x3001;&#x5E93;&#x4F9B;&#x5E94;&#x8005;&#x3001;&#x5E73;&#x53F0;&#x4F9B;&#x5E94;&#x8005;&#x3001;&#x56FD;&#x5BB6;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF08;&#x7269;&#x7406;&#xFF09;&#x7B49;&#x90FD;&#x6709;&#x575A;&#x5B9E;&#x7684;&#x4EE3;&#x8868;&#x3002;&#x65E9;&#x671F; C++ &#x4E2D;&#x7A81;&#x51FA;&#x7684;&#x7535;&#x4FE1;&#x4E1A;&#x8005;&#x7684;&#x8EAB;&#x5F71;&#x5DF2;&#x7ECF;&#x51CF;&#x5C11;&#xFF0C;&#x800C;&#x8FC7;&#x53BB;&#x6781;&#x5C11;&#x7684;&#x5927;&#x5B66;&#x7684;&#x8EAB;&#x5F71;&#x4F3C;&#x4E4E;&#x5728;&#x589E;&#x52A0;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x5982;&#x6B64;&#x5E9E;&#x5927;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x4E2A;&#x4EBA;&#x7EC4;&#x6210;&#x7684;&#x7FA4;&#x4F53;&#x4EE3;&#x8868;&#x7740;&#x5343;&#x5DEE;&#x4E07;&#x522B;&#x7684;&#x5174;&#x8DA3;&#x548C;&#x6280;&#x672F;&#x80CC;&#x666F;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x6765;&#x8FD0;&#x4F5C;&#x3002;&#x4F1A;&#x8BAE;&#x662F;&#x56F4;&#x7ED5;&#x5DE5;&#x4F5C;&#x7EC4;&#xFF08;WG&#xFF09;&#x548C;&#x7814;&#x7A76;&#x7EC4;&#xFF08;SG&#xFF09;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#x7684;&#x3002;2019 &#x5E74;&#x7684;&#x590F;&#x5929;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E9B;&#x5206;&#x7EC4;&#xFF1A;</p>
<ul>
<li><strong>&#x6838;&#x5FC3;&#x5DE5;&#x4F5C;&#x7EC4;</strong>&#xFF08;Core WG &#x6216; CWG&#xFF09;&#x2014;&#x2014;&#x7F16;&#x5199;&#x8BED;&#x8A00;&#x7684;&#x6700;&#x7EC8;&#x6807;&#x51C6;&#x6587;&#x672C;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Michael Miller&#xFF08;EDG&#xFF09;&#x3002;</li>
<li><strong>&#x5E93;&#x5DE5;&#x4F5C;&#x7EC4;</strong>&#xFF08;Library WG &#x6216; LWG&#xFF09;&#x2014;&#x2014;&#x4E3A;&#x6807;&#x51C6;&#x5E93;&#x7F16;&#x5199;&#x6700;&#x7EC8;&#x6807;&#x51C6;&#x6587;&#x672C;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Marshall Clow&#xFF08;C++ &#x8054;&#x76DF;&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868;&#x9AD8;&#x901A;&#xFF09;&#x3002;</li>
<li><strong>&#x6F14;&#x5316;&#x5DE5;&#x4F5C;&#x7EC4;</strong>&#xFF08;Evolution WG &#x6216; EWG&#xFF09;&#x2014;&#x2014;&#x5904;&#x7406;&#x8BED;&#x8A00;&#x5EFA;&#x8BAE;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Ville Voutilainen&#xFF08;Qt&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868; Symbio&#xFF09;&#x3002;</li>
<li><strong>&#x5E93;&#x6F14;&#x5316;&#x5DE5;&#x4F5C;&#x7EC4;</strong>&#xFF08;Library Evolution WG &#x6216; LEWG&#xFF09;&#x2014;&#x2014;&#x5904;&#x7406;&#x6807;&#x51C6;&#x5E93;&#x63D0;&#x6848;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Titus Winters&#xFF08;&#x8C37;&#x6B4C;&#xFF09;&#x3002;</li>
</ul>
<p>&#x7814;&#x7A76;&#x7EC4;&#x63A2;&#x7D22;&#x65B0;&#x9886;&#x57DF;&#x5E76;&#x8BBE;&#x8BA1;&#x53EF;&#x80FD;&#x7684;&#x6807;&#x51C6;&#x5316;&#xFF1A;</p>
<ul>
<li><strong>SG1 &#x5E76;&#x53D1;</strong>&#x2014;&#x2014;&#x5E76;&#x53D1;&#x548C;&#x5E76;&#x884C;&#x6027;&#x4E3B;&#x9898;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Olivier Giroux&#xFF08;&#x82F1;&#x4F1F;&#x8FBE;&#xFF09;&#x3002;</li>
<li><strong>SG5 &#x4E8B;&#x52A1;&#x5185;&#x5B58;</strong>&#x2014;&#x2014;&#x63A2;&#x7D22;&#x4E8B;&#x52A1;&#x5185;&#x5B58;&#x7684;&#x6784;&#x4EF6;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Michael Wong&#xFF08;Codeplay&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868; IBM&#xFF09;&#x3002;</li>
<li><strong>SG6 &#x6570;&#x503C;</strong>&#x2014;&#x2014;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#x5B9A;&#x70B9;&#x6570;&#x3001;&#x6D6E;&#x70B9;&#x6570;&#x548C;&#x5206;&#x6570;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Lawrence Crowl&#xFF08;&#x201C;&#x81EA;&#x5DF1;&#x201D;&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868;&#x8C37;&#x6B4C;&#x548C; Sun&#xFF09;&#x3002;</li>
<li><strong>SG7 &#x7F16;&#x8BD1;&#x671F;&#x7F16;&#x7A0B;</strong>&#x2014;&#x2014;&#x6700;&#x521D;&#x4E13;&#x6CE8;&#x4E8E;&#x7F16;&#x8BD1;&#x671F;&#x53CD;&#x5C04;&#xFF0C;&#x7136;&#x540E;&#x6269;&#x5C55;&#x5230;&#x4E00;&#x822C;&#x7684;&#x7F16;&#x8BD1;&#x671F;&#x7F16;&#x7A0B;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Chandler Carruth&#xFF08;&#x8C37;&#x6B4C;&#xFF09;&#x3002;</li>
<li><strong>SG12 &#x672A;&#x5B9A;&#x4E49;&#x7684;&#x884C;&#x4E3A;&#x548C;&#x6F0F;&#x6D1E;</strong>&#x2014;&#x2014;&#x7CFB;&#x7EDF;&#x5730;&#x5BA1;&#x67E5;&#x6F0F;&#x6D1E;&#x548C;&#x672A;&#x5B9A;&#x4E49;/&#x672A;&#x6307;&#x5B9A;&#x7684;&#x884C;&#x4E3A;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Gabriel Dos Reis&#xFF08;&#x5FAE;&#x8F6F;&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868;&#x5F97;&#x5DDE;&#x519C;&#x5DE5;&#x5927;&#x5B66;&#xFF09;&#x3002;</li>
<li><strong>SG13 &#x4EBA;&#x673A;&#x754C;&#x9762;&#x548C; I/O</strong>&#x2014;&#x2014;&#x7CBE;&#x9009;&#x7684;&#x5E95;&#x5C42;&#x8F93;&#x51FA;&#xFF08;&#x4F8B;&#x5982;&#x56FE;&#x5F62;&#x3001;&#x97F3;&#x9891;&#xFF09;&#x548C;&#x8F93;&#x5165;&#xFF08;&#x4F8B;&#x5982;&#x952E;&#x76D8;&#x3001;&#x6307;&#x70B9;&#x8BBE;&#x5907;&#xFF09;&#x7684; I/O &#x539F;&#x8BED;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Roger Orr&#xFF08;&#x82F1;&#x56FD;&#x6807;&#x51C6;&#xFF08;BSI&#xFF09;&#xFF09;&#x3002;</li>
<li><strong>SG14 &#x6E38;&#x620F;&#x5F00;&#x53D1;&#x548C;&#x4F4E;&#x5EF6;&#x8FDF;</strong>&#x2014;&#x2014;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x5176;&#x4ED6;&#x6709;&#x4F4E;&#x5EF6;&#x8FDF;&#x8981;&#x6C42;&#x7684;&#x4EBA;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E3B;&#x9898;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Michael Wong&#xFF08;Codeplay&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868; IBM&#xFF09;&#x3002;</li>
<li><strong>SG15 &#x5DE5;&#x5177;</strong>&#x2014;&#x2014;&#x4E0E;&#x9488;&#x5BF9;&#x6807;&#x51C6; C++ &#x7684;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x521B;&#x5EFA;&#x6709;&#x5173;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x6A21;&#x5757;&#x548C;&#x5305;&#x7BA1;&#x7406;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Titus Winters&#xFF08;&#x8C37;&#x6B4C;&#xFF09;&#x3002;</li>
<li><strong>SG16 Unicode</strong>&#x2014;&#x2014;&#x4E0E; C++ &#x4E2D;&#x7684; Unicode &#x6587;&#x672C;&#x5904;&#x7406;&#x76F8;&#x5173;&#x7684;&#x4E3B;&#x9898;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Tom Honermann&#xFF08;Synopsys&#xFF09;&#x3002;</li>
<li><strong>SG19 &#x673A;&#x5668;&#x5B66;&#x4E60;</strong>&#x2014;&#x2014;&#x4E3B;&#x5E2D; Michael Wong&#xFF08;CodePlay&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868; IBM&#xFF09;</li>
<li><strong>SG20 &#x6559;&#x80B2;</strong>&#x2014;&#x2014;&#x63A2;&#x7D22;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x5B66;&#x4E60;&#x8005;&#x548C;&#x6559;&#x5E08;&#x638C;&#x63E1;&#x4ECA;&#x5929;&#x7684; C++ &#x7684;&#x65B9;&#x6CD5;&#x2014;&#x2014;&#x4E3B;&#x5E2D; Jan Christiaan van Winkel&#xFF08;&#x8C37;&#x6B4C;&#xFF09;</li>
<li><strong>SG21 &#x5951;&#x7EA6;</strong>&#x2014;&#x2014;&#x5728; C++20 &#x5931;&#x8D25;&#x540E;&#x5C1D;&#x8BD5;&#x8BBE;&#x8BA1;&#x51FA;&#x5951;&#x7EA6;&#x7CFB;&#x7EDF;&#xFF08;<a href="09.html#961-&#x5951;&#x7EA6;">&#xA7;9.6.1</a>&#xFF09;&#x2014;&#x2014;&#x4E3B;&#x5E2D; John Spicer&#xFF08;EDG&#xFF09;</li>
</ul>
<p>2017 &#x5E74;&#x6210;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x7EC4;&#x6765;&#x89E3;&#x51B3;&#x4E0E;&#x8BED;&#x8A00;&#x548C;&#x6807;&#x51C6;&#x5E93;&#x8BBE;&#x8BA1;&#x7F3A;&#x4E4F;&#x65B9;&#x5411;&#x6709;&#x5173;&#x7684;&#x95EE;&#x9898; [Dawes et al. 2018]&#x3002;&#x8BE5;<strong>&#x65B9;&#x5411;&#x7EC4;</strong>&#xFF08;DG&#xFF09;&#x7684;&#x6210;&#x5458;&#x7531;&#x53EC;&#x96C6;&#x4EBA;&#x4E0E;&#x5DE5;&#x4F5C;&#x7EC4;&#x4E3B;&#x5E2D;&#x534F;&#x5546;&#x540E;&#x4EFB;&#x547D;&#xFF0C;&#x5176;&#x6210;&#x5458;&#x662F;&#x59D4;&#x5458;&#x4F1A;&#x3001;&#x8BED;&#x8A00;&#x548C;&#x6807;&#x51C6;&#x5E93;&#x7684;&#x957F;&#x671F;&#x8D21;&#x732E;&#x8005;&#x3002;&#x6700;&#x521D;&#x7684;&#x6210;&#x5458;&#x662F; Beman Dawes&#x3001;Howard Hinnant&#x3001;Bjarne Stroustrup&#x3001;David Vandevoorde &#x548C; Michael Wong&#x3002;&#x4E4B;&#x540E;&#xFF0C;Beman &#x9000;&#x4F11;&#xFF0C;Roger Orr &#x52A0;&#x5165;&#x3002;DG &#x7684;&#x4E3B;&#x5E2D;&#x662F;&#x8F6E;&#x6D41;&#x62C5;&#x4EFB;&#x7684;&#xFF0C;&#x4ECE;&#x6211;&#x5F00;&#x59CB;&#x3002;DG &#x662F;&#x54A8;&#x8BE2;&#x673A;&#x6784;&#xFF0C;&#x5176;&#x653F;&#x7B56;&#x662F;&#x53EA;&#x6709;&#x5728;&#x5176;&#x6210;&#x5458;&#x4E00;&#x81F4;&#x540C;&#x610F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x80FD;&#x63D0;&#x51FA;&#x610F;&#x89C1;&#x3002;&#x5B83;&#x7EF4;&#x62A4;&#x6709;&#x4E00;&#x4EFD;&#x63CF;&#x8FF0;&#x5176;&#x5EFA;&#x8BAE;&#x7684;&#x6587;&#x6863; [Dawes et al. 2018; Hinnant et al. 2019]&#x3002;</p>
<p>&#x5DE5;&#x4F5C;&#x7EC4;&#x53EF;&#x6301;&#x7EED;&#x5341;&#x5E74;&#x4EE5;&#x4E0A;&#xFF0C;&#x6210;&#x5458;&#x53D8;&#x5316;&#x4E5F;&#x5F88;&#x5C11;&#x3002;&#x7814;&#x7A76;&#x7EC4;&#x5219;&#x805A;&#x6563;&#x81EA;&#x7531;&#xFF0C;&#x53EF;&#x80FD;&#x56E0;&#x5174;&#x8DA3;&#x4F7F;&#x7136;&#xFF0C;&#x6216;&#x8005;&#x56E0;&#x4E3A;&#x5DE5;&#x4F5C;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x5E76;&#x63D0;&#x4EA4;&#x7ED9;&#x5DE5;&#x4F5C;&#x7EC4;&#x8FDB;&#x884C;&#x6700;&#x540E;&#x7684;&#x5904;&#x7406;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x56DB;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7814;&#x7A76;&#x7EC4;&#x5DF2;&#x5BA3;&#x544A;&#x80DC;&#x5229;&#x5B8C;&#x6210;&#x5E76;&#x89E3;&#x6563;&#xFF1A;</p>
<ul>
<li><strong>SG2 &#x6A21;&#x5757;</strong>&#x2014;&#x2014;&#x4E3B;&#x5E2D; Gabriel Dos Reis&#xFF08;&#x5FAE;&#x8F6F;&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868;&#x5F97;&#x5DDE;&#x519C;&#x5DE5;&#x5927;&#x5B66;&#xFF09;&#x3002;</li>
<li><strong>SG3 &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</strong>&#x2014;&#x2014;&#x4E3B;&#x5E2D; Beman Dawes&#xFF08;&#x201C;&#x81EA;&#x5DF1;&#x201D;&#xFF09;&#x3002;</li>
<li><strong>SG8 &#x6982;&#x5FF5;</strong>&#x2014;&#x2014;&#x4E3B;&#x5E2D; Andrew Sutton&#xFF08;&#x4FC4;&#x4EA5;&#x4FC4;&#x5DDE;&#x963F;&#x514B;&#x4F26;&#x5927;&#x5B66;&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868;&#x5F97;&#x5DDE;&#x519C;&#x5DE5;&#x5927;&#x5B66;&#xFF09;&#x3002;</li>
<li><strong>SG9 &#x8303;&#x56F4;</strong>&#x2014;&#x2014;&#x66F4;&#x65B0; STL&#xFF0C;&#x4EE5;&#x4F7F;&#x7528;&#x6982;&#x5FF5;&#xFF0C;&#x7B80;&#x5316;&#x5199;&#x6CD5;&#xFF0C;&#x53CA;&#x63D0;&#x4F9B;&#x65E0;&#x9650;&#x5E8F;&#x5217;&#x548C;&#x7BA1;&#x9053;&#x2014;&#x2014;&#x4E3B;&#x5E2D;&#xFF0C;Eric Niebler&#xFF08;Facebook&#xFF09;&#x3002;</li>
</ul>
<p><strong>SG4 &#x7F51;&#x7EDC;</strong>&#xFF0C;&#x76EE;&#x524D;&#x5904;&#x4E8E;&#x4F11;&#x7720;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x7ED3;&#x679C;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x88AB;&#x5408;&#x5E76;&#x5230;&#x6807;&#x51C6;&#xFF08;<a href="08.html#881-&#x7F51;&#x7EDC;&#x5E93;">&#xA7;8.8.1</a>&#xFF09;&#x4E2D;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x7EC4; <strong>SG11 &#x6570;&#x636E;&#x5E93;</strong>&#xFF0C;&#x56E0;&#x7F3A;&#x4E4F;&#x5171;&#x8BC6;&#x548C;&#x7F3A;&#x4E4F;&#x8DB3;&#x591F;&#x6570;&#x91CF;&#x7684;&#x5FD7;&#x613F;&#x8005;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x800C;&#x89E3;&#x6563;&#x3002;</p>
<p>&#x67D0;&#x4E9B;&#x7814;&#x7A76;&#x7EC4;&#x4F1A;&#x4EA7;&#x51FA;&#x6280;&#x672F;&#x89C4;&#x8303;&#xFF08;TS&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x89C4;&#x8303;&#x53EF;&#x80FD;&#x662F;&#x5177;&#x6709;&#x91CD;&#x8981;&#x610F;&#x4E49;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x4EE5;&#x6807;&#x51C6;&#x672C;&#x8EAB;&#x7684;&#x98CE;&#x683C;&#x5199;&#x5C31;&#x3002;&#x5B83;&#x4EEC;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5B98;&#x65B9;&#xFF08;ISO&#xFF09;&#x5730;&#x4F4D;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x63D0;&#x4F9B;&#x56FD;&#x9645;&#x6807;&#x51C6;&#xFF08;IS&#xFF09;&#x6240;&#x5177;&#x6709;&#x7684;&#x957F;&#x671F;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x5E76;&#x53D1;&#x7814;&#x7A76;&#x7EC4;&#xFF08;SG1&#xFF09;&#x81EA; 2006 &#x5E74;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x6D3B;&#x8DC3;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x7531; Hans-J. Boehm&#xFF08;&#x8C37;&#x6B4C;&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868;&#x8FC7;&#x60E0;&#x666E;&#x5B9E;&#x9A8C;&#x5BA4;&#x548C; SGI&#xFF09;&#x9886;&#x5BFC;&#xFF0C;&#x5B83;&#x7684;&#x5730;&#x4F4D;&#x5DF2;&#x7ECF;&#x63A5;&#x8FD1; WG &#x4E86;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x5206;&#x7EC4;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x534A;&#x5B98;&#x65B9;&#x7684; C/C++ &#x8054;&#x7EDC;&#x7EC4;&#xFF0C;&#x7531;&#x540C;&#x65F6;&#x52A0;&#x5165; C++ &#x59D4;&#x5458;&#x4F1A;&#x548C; C &#x59D4;&#x5458;&#x4F1A;&#xFF08;ISO/SC22/WG14&#xFF09;&#x7684;&#x6210;&#x5458;&#x7EC4;&#x6210;&#x3002;&#x8FD9;&#x4E2A;&#x5C0F;&#x7EC4;&#x529B;&#x56FE;&#x51CF;&#x5C11; C &#x548C; C++ &#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x800C; C++ &#x6807;&#x51C6;&#x4E5F;&#x4F1A;&#x628A;&#x6BCF;&#x79CD;&#x4E0D;&#x517C;&#x5BB9;&#x4E4B;&#x5904;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8054;&#x7EDC;&#x5C0F;&#x7EC4;&#x7684;&#x4E0D;&#x65AD;&#x52AA;&#x529B;&#xFF0C;C &#x548C; C++ &#x7684;&#x517C;&#x5BB9;&#x6027;&#x8FDC;&#x6CA1;&#x6709;&#x73B0;&#x5728;&#x597D;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4ECE; C++ &#x5BFC;&#x5165; C &#x7684;&#x7279;&#x6027;&#x90FD;&#x88AB;&#x4FEE;&#x6539;&#x8FC7;&#xFF0C;&#x800C;&#x8FD9;&#x5C31;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E9B;&#x4E0D;&#x517C;&#x5BB9;&#x6027;&#x3002;</p>
<p>ISO &#x53EA;&#x9700;&#x8981;&#x4E5F;&#x53EA;&#x8BA4;&#x53EF;&#x4E09;&#x540D;&#x6B63;&#x5F0F;&#x5B98;&#x5458;&#xFF1A;</p>
<ul>
<li><strong>&#x53EC;&#x96C6;&#x4EBA;</strong>&#x2014;&#x2014;&#x62C5;&#x4EFB;&#x5DE5;&#x4F5C;&#x7EC4;&#x4E3B;&#x5E2D;&#xFF0C;&#x5236;&#x5B9A;&#x5DE5;&#x4F5C;&#x7EC4;&#x4F1A;&#x8BAE;&#x65F6;&#x95F4;&#x8868;&#xFF08;&#x53EC;&#x5F00;&#x4F1A;&#x8BAE;&#xFF09;&#xFF0C;&#x4EFB;&#x547D;&#x7814;&#x7A76;&#x7EC4;&#xFF0C;&#x5E76;&#x5411;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684; ISO&#xFF08;SC22&#x3001;JTC1 &#x548C; ITTF&#xFF09;&#x8D1F;&#x8D23;&#x2014;&#x2014;Herb Sutter&#xFF08;&#x5FAE;&#x8F6F;&#xFF09;&#xFF0C;&#x81EA; 2002 &#x5E74;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x62C5;&#x4EFB;&#x8BE5;&#x804C;&#x4F4D;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x9664; 2008&#x2013;2009 &#x5E74;&#x671F;&#x95F4;&#x662F;&#x7531; P.J. Plauger&#xFF08;Dinkumware&#xFF09;&#x62C5;&#x4EFB;&#x3002;</li>
<li><strong>&#x9879;&#x76EE;&#x7F16;&#x8F91;</strong>&#x2014;&#x2014;&#x6700;&#x7EC8;&#x8D1F;&#x8D23;&#x5C06;&#x59D4;&#x5458;&#x4F1A;&#x6279;&#x51C6;&#x7684;&#x66F4;&#x6539;&#x5E94;&#x7528;&#x4E8E;&#x6807;&#x51C6;&#x7684;&#x5DE5;&#x4F5C;&#x8349;&#x6848;&#x2014;&#x2014;Richard Smith&#xFF08;&#x8C37;&#x6B4C;&#xFF09;&#xFF1B;Pete Becker&#xFF08;Dinkumware&#xFF09;&#x8D1F;&#x8D23; C++11&#xFF1B;Stefanus Du Toit&#xFF08;Intel&#xFF09;&#x8D1F;&#x8D23; C++14&#x3002;</li>
<li><strong>&#x4E66;&#x8BB0;</strong>&#x2014;&#x2014;&#x8D1F;&#x8D23;&#x8BB0;&#x5F55;&#x548C;&#x5206;&#x53D1; WG21 &#x4F1A;&#x8BAE;&#x7684;&#x4F1A;&#x8BAE;&#x7EAA;&#x8981;&#x2014;&#x2014;Nina Ranns&#xFF08;Edison Design Group&#xFF0C;&#x4E4B;&#x524D;&#x4EE3;&#x8868; Symantec&#xFF09;&#x3002;</li>
</ul>
<p>&#x5404;&#x4E2A;&#x56FD;&#x5BB6;&#x7684;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6709;&#x5404;&#x81EA;&#x81EA;&#x5DF1;&#x7684;&#x5B98;&#x5458;&#x548C;&#x7AE0;&#x7A0B;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#x8FD9;&#x4E9B;&#x804C;&#x4F4D;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x62C5;&#x4EFB;&#x8FC7;&#xFF0C;&#x4F46;&#x5C3D;&#x7BA1;&#x5DE5;&#x4F5C;&#x91CF;&#x901A;&#x5E38;&#x5F88;&#x5927;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x5728;&#x804C;&#x5C11;&#x4E8E; 5 &#x5E74;&#x3002;&#x6211;&#x66FE;&#x62C5;&#x4EFB; EWG &#x7684;&#x4E3B;&#x5E2D; 24 &#x5E74;&#xFF0C;&#x5230; 2014 &#x5E74;&#x624D;&#x628A;&#x8FD9;&#x4E00;&#x804C;&#x4F4D;&#x79FB;&#x4EA4;&#x7ED9; Ville Voutilainen&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x8F83;&#x5C0F;&#x7684;&#x63D0;&#x6848;&#x76F4;&#x63A5;&#x63D0;&#x4EA4;&#x7ED9; EWG &#x548C;/&#x6216; LEWG&#xFF0C;&#x8F83;&#x5927;&#x7684;&#x63D0;&#x6848;&#x5219;&#x4ECE;&#x7814;&#x7A76;&#x7EC4;&#x5F00;&#x59CB;&#x3002;&#x63D0;&#x6848;&#x9700;&#x8981;&#x4EE5;&#x4E66;&#x9762;&#x5F62;&#x5F0F;&#x63D0;&#x51FA;&#xFF0C;&#x5E76;&#x6709;&#x4EBA;&#x8FDB;&#x884C;&#x6F14;&#x793A;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5904;&#x7406;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x7684;&#x63D0;&#x6848;&#x9700;&#x8981;&#x6570;&#x6B21;&#x4F1A;&#x8BAE;&#xFF08;&#x901A;&#x5E38;&#x4E3A;&#x6570;&#x5E74;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x6570;&#x7BC7;&#x8BBA;&#x6587;&#x3001;&#x4FEE;&#x8BA2;&#x8BBA;&#x6587;&#x548C;&#x53CD;&#x590D;&#x6F14;&#x793A;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x5927;&#x529B;&#x652F;&#x6301;&#x7684;&#x63D0;&#x6848;&#x5C06;&#x63D0;&#x4EA4;&#x7ED9;&#x6574;&#x4E2A;&#x59D4;&#x5458;&#x4F1A;&#x8FDB;&#x884C;&#x6700;&#x7EC8;&#x8868;&#x51B3;&#x3002;&#x53EC;&#x96C6;&#x4EBA;&#x67E5;&#x770B;&#x8868;&#x51B3;&#x7ED3;&#x679C;&#x5E76;&#x88C1;&#x5B9A;&#x662F;&#x5426;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x3002;&#x5171;&#x8BC6;&#x4E0D;&#x53EA;&#x662F;&#x8981;&#x591A;&#x6570;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x80FD;&#x5728;&#x7ECF;&#x8FC7;&#x5DE5;&#x4F5C;&#x7EC4;&#x5904;&#x7406;&#x548C;&#x6295;&#x7968;&#x540E;&#x83B7;&#x5F97;&#x4E00;&#x81F4;&#x540C;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x8FBE;&#x4E0D;&#x5230;&#xFF0C;&#x901A;&#x5E38;&#x81F3;&#x5C11;&#x4E5F;&#x9700;&#x8981; 9 &#x6BD4; 1 &#x6216; 8 &#x6BD4; 2 &#x7684;&#x4F18;&#x52BF;&#x3002;&#x53EC;&#x96C6;&#x4EBA;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A; 8 &#x6BD4; 2 &#x7684;&#x591A;&#x6570;&#x7968;&#x201C;&#x672A;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x201D;&#x3002;&#x5982;&#x679C;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x673A;&#x6784;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x6216;&#x51E0;&#x4E2A;&#x4E3B;&#x8981;&#x59D4;&#x5458;&#x8868;&#x793A;&#x5F3A;&#x70C8;&#x53CD;&#x5BF9;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x6837;&#x8BAE;&#x9898;&#x5C31;&#x4F1A;&#x5904;&#x4E8E;&#x60AC;&#x800C;&#x672A;&#x51B3;&#x7684;&#x72B6;&#x6001;&#x6216;&#x8005;&#x5BFC;&#x81F4;&#x63D0;&#x6848;&#x53EA;&#x88AB;&#x90E8;&#x5206;&#x91C7;&#x7EB3;&#x3002;</p>
<p>&#x6807;&#x51C6;&#x4F1A;&#x8BAE;&#x4EE4;&#x4EBA;&#x7B4B;&#x75B2;&#x529B;&#x5C3D;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x59D4;&#x5458;&#x4EEC;&#x4ECE;&#x65E9;&#x9910;&#x5230;&#x5348;&#x591C;&#x4E00;&#x76F4;&#x5728;&#x8BA8;&#x8BBA;&#x5DE5;&#x4F5C;&#x95EE;&#x9898;&#x3002;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x6B63;&#x5F0F;&#x4F1A;&#x8BAE;&#x5728; 8:30&#x2013;12:30 &#x548C; 14:00&#x2013;17:30 &#x4E3E;&#x884C;&#xFF0C;&#x52A0;&#x4E0A;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x8FDB;&#x884C;&#x7684;&#x665A;&#x95F4;&#x4F1A;&#x8BAE;&#xFF08;19:00&#x2013;22:00&#xFF09;&#x3002;&#x6B63;&#x5728;&#x51C6;&#x5907;&#x63D0;&#x6848;&#x7684;&#x59D4;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x6BD4;&#x8FD9;&#x4E9B;&#x8FD8;&#x8981;&#x957F;&#x3002;WG &#x548C; SG &#x4E3B;&#x5E2D;&#x4E00;&#x822C;&#x5728;&#x5927;&#x591A;&#x6570;&#x7528;&#x9910;&#x65F6;&#x95F4;&#x90FD;&#x5728;&#x5F00;&#x4F1A;&#x3002;&#x5468;&#x4E00;&#x81F3;&#x5468;&#x4E94;&#x662F;&#x5168;&#x5929;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x5916;&#x53D1;&#x751F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x5230;&#x4E86;&#x661F;&#x671F;&#x516D;&#x7684; 15:00 &#x5DE6;&#x53F3;&#x4F1A;&#x6536;&#x5DE5;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5F53;&#x4F1A;&#x8BAE;&#x5728;&#x8BF8;&#x5982;&#x590F;&#x5A01;&#x5937;&#x79D1;&#x7EB3;&#xFF08;Kona&#xFF09;&#x4E4B;&#x7C7B;&#x7684;&#x597D;&#x5730;&#x65B9;&#x4E3E;&#x884C;&#x65F6;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x4EE5;&#x5916;&#x7684;&#x4EBA;&#x4F3C;&#x4E4E;&#x90FD;&#x4E0D;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#x5F00;&#x4F1A;&#x5E76;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x5EA6;&#x5047;&#x3002;</p>
<p>&#x5728; WG &#x548C; SG &#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x51FA;&#x5E2D;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x6295;&#x4E00;&#x7968;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x5168;&#x4F53;&#x4F1A;&#x8BAE;&#x7684;&#x6B63;&#x5F0F;&#x6295;&#x7968;&#x5219;&#x662F;&#x6BCF;&#x4E2A;&#x5230;&#x4F1A;&#x7684;&#x7EC4;&#x7EC7;&#x4E00;&#x7968;&#xFF08;&#x8FD9;&#x6837;&#xFF0C;&#x5927;&#x578B;&#x7EC4;&#x7EC7;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x591A;&#x7968;&#xFF09;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x673A;&#x6784;&#x7684;&#x7968;&#x6570;&#x3002;&#x201C;&#x6280;&#x672F;&#x6027;&#x6295;&#x7968;&#x201D;&#x548C;&#x56FD;&#x5BB6;&#x673A;&#x6784;&#x6295;&#x7968;&#x5FC5;&#x987B;&#x4E00;&#x81F4;&#x624D;&#x7B97;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x3002;</p>
<p>&#x59D4;&#x5458;&#x4F1A; 2006 &#x5E74;&#x4EE5;&#x524D;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x5728; [Stroustrup 1993, 1994, 2007] &#x4E2D;&#x3002;C++ &#x57FA;&#x91D1;&#x4F1A;&#xFF08;<a href="10.html#102-c-&#x793E;&#x533A;">&#xA7;10.2</a>&#xFF09;&#x5728;&#x5176;&#x7F51;&#x7AD9;&#xFF08;<a href="https://isocpp.org/std" target="_blank">isocpp.org/std</a>&#xFF09;&#x4E0A;&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4EFD;&#x4F1A;&#x53CA;&#x65F6;&#x66F4;&#x65B0;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6DB5;&#x76D6;&#x7EC4;&#x7EC7;&#x3001;&#x5173;&#x952E;&#x4EBA;&#x7269;&#x548C;&#x59D4;&#x5458;&#x4F1A;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x4ECE; 1989 &#x5E74;&#x8D77;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x6240;&#x6709;&#x8BBA;&#x6587;&#x51E0;&#x4E4E;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x4EFD;&#x6587;&#x96C6;&#x4E2D;&#x83B7;&#x53D6;&#x5230; [WG21 1989&#x2013;2020]&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x8BE5;&#x6587;&#x96C6;&#x6BCF;&#x5E74;&#x589E;&#x52A0; 500 &#x591A;&#x7BC7;&#x8BBA;&#x6587;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5F88;&#x591A;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x8BA8;&#x8BBA;&#x662F;&#x5728;&#x5DF2;&#x5F52;&#x6863;&#x7684;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x6BCF;&#x5929;&#x53EF;&#x80FD;&#x6709;&#x8D85;&#x8FC7;&#x4E00;&#x767E;&#x6761;&#x90AE;&#x4EF6;&#x6D88;&#x606F;&#x3002;&#x8981;&#x8DDF;&#x4E0A;&#x59D4;&#x5458;&#x4F1A;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x975E;&#x5E38;&#x96BE;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x7531;&#x4E8E;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x4E13;&#x95E8;&#x7684;&#x6280;&#x672F;&#x77E5;&#x8BC6;&#x624D;&#x80FD;&#x8DDF;&#x8FDB;&#x3002;&#x6211;&#x5C06;&#x81EA;&#x5DF1;&#x7684; WG21 &#x8BBA;&#x6587;&#x96C6;&#x4FDD;&#x5B58;&#x5728;&#x4E3B;&#x9875; [Stroustrup 1990&#x2013;2020] &#x4E0A;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;ISO &#x6807;&#x51C6;&#x6BCF;&#x5341;&#x5E74;&#x5DE6;&#x53F3;&#x4FEE;&#x8BA2;&#x4E00;&#x6B21;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x6709; C89&#x3001;C99 &#x548C; C11&#x3002;&#x5982;&#x6B64;&#x957F;&#x7684;&#x4FEE;&#x8BA2;&#x5468;&#x671F;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x7279;&#x6027;&#x9519;&#x8FC7;&#x4E86;&#x7279;&#x6027;&#x51BB;&#x7ED3;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x8981;&#x518D;&#x7B49;&#x4E0A; 12 &#x5E74;&#x5DE6;&#x53F3;&#x624D;&#x80FD;&#x5C06;&#x5B83;&#x52A0;&#x5165;&#x6807;&#x51C6;&#x3002;&#x4EBA;&#x4EEC;&#x81EA;&#x7136;&#x5C31;&#x4F1A;&#x4E3B;&#x5F20;&#x5C06;&#x5373;&#x5C06;&#x901A;&#x8FC7;&#x7684;&#x6807;&#x51C6;&#x62D6;&#x5EF6;&#x4E00;&#x4E24;&#x5E74;&#xFF1A;&#x201C;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x592A;&#x91CD;&#x8981;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x7B49;&#xFF0C;&#x56E0;&#x6B64;&#x5F97;&#x5EF6;&#x8FDF;&#x4E00;&#x4E0B;&#x6807;&#x51C6;&#x7684;&#x53D1;&#x5E03;&#xFF01;&#x201D;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x539F;&#x672C;&#x7684; C++0x &#x7ED3;&#x679C;&#x6210;&#x4E86; C++11&#xFF0C;&#x5728; C++98 &#x540E;&#x8FC7;&#x4E86; 13 &#x5E74;&#x3002;</p>
<p>&#x5728; C++11 &#x4E4B;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x5E0C;&#x671B;&#x7F29;&#x77ED;&#x5468;&#x671F;&#xFF0C;&#x53EC;&#x96C6;&#x4EBA; Herb Sutter &#x5EFA;&#x8BAE;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x5217;&#x8F66;&#x6A21;&#x578B;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5217;&#x8F66;&#x5728;&#x9884;&#x5B9A;&#x65F6;&#x95F4;&#x51FA;&#x53D1;&#xFF0C;&#x4EFB;&#x4F55;&#x6CA1;&#x4E0A;&#x8F66;&#x7684;&#x4EBA;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x73ED;&#x3002;&#x5927;&#x5BB6;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x5EFA;&#x8BAE;&#xFF0C;&#x4E5F;&#x82B1;&#x4E86;&#x633A;&#x957F;&#x65F6;&#x95F4;&#x8BA8;&#x8BBA;&#x6807;&#x51C6;&#x4FEE;&#x8BA2;&#x4E4B;&#x95F4;&#x7684;&#x5408;&#x9002;&#x95F4;&#x9694;&#x3002;&#x6211;&#x4E3B;&#x5F20;&#x77ED;&#x70B9;&#xFF0C;3 &#x5E74;&#xFF0C;&#x56E0;&#x4E3A;&#x518D;&#x957F;&#xFF08;&#x4F8B;&#x5982; 5 &#x5E74;&#xFF09;&#x5C31;&#x5BB9;&#x6613;&#x88AB;&#x201C;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x7B49;&#x4E0D;&#x4E86;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8BF4;&#x6CD5;&#x62D6;&#x7D2F;&#xFF0C;&#x5BFC;&#x81F4;&#x53D1;&#x5E03;&#x5EF6;&#x8FDF;&#x3002;&#x6211;&#x4EEC;&#x5546;&#x5B9A;&#x4E86;&#x4E09;&#x5E74;&#x7684;&#x53D1;&#x5E03;&#x5468;&#x671F;&#xFF0C;Herb Sutter &#x8865;&#x5145;&#x5EFA;&#x8BAE;&#x91C7;&#x7528;&#x4EA4;&#x66FF;&#x53D1;&#x884C;&#x5927;&#x7248;&#x672C;&#x548C;&#x5C0F;&#x7248;&#x672C;&#x7684;&#x82F1;&#x7279;&#x5C14;&#x201C;&#x6EF4;&#x7B54;&#x201D;&#x6A21;&#x578B;&#x3002;&#x8FD9;&#x4E5F;&#x5F97;&#x5230;&#x4E86;&#x540C;&#x610F;&#xFF0C;&#x56E0;&#x6B64;&#x5728; C++11&#xFF08;<a href="04.html#4-c11&#x611F;&#x89C9;&#x50CF;&#x662F;&#x95E8;&#x65B0;&#x8BED;&#x8A00;">&#xA7;4</a>&#xFF09;&#x4E09;&#x5E74;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x5E03;&#x4E86; C++14&#xFF08;<a href="05.html#5-c14&#x5B8C;&#x6210;-c11">&#xA7;5</a>&#xFF09;&#xFF0C;&#x5B83;&#x7EB3;&#x5165;&#x4E86;&#x4E4B;&#x524D;&#x88AB;&#x5EF6;&#x8FDF;&#x7684;&#x7279;&#x6027;&#x5E76;&#x7EA0;&#x6B63;&#x4E86;&#x65E9;&#x671F;&#x4F7F;&#x7528;&#x4E2D;&#x53D1;&#x73B0;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x3002;C++17 &#x4E5F;&#x6309;&#x65F6;&#x4EA4;&#x4ED8;&#xFF0C;&#x4F46;&#x53EF;&#x60DC;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x6B21;&#x5927;&#x5347;&#x7EA7;&#xFF08;<a href="08.html#8-c17&#x5927;&#x6D77;&#x8FF7;&#x822A;">&#xA7;8</a>&#xFF09;&#x3002;C++20 &#x5728; 2019 &#x5E74; 2 &#x6708;&#x901A;&#x8FC7;&#x6295;&#x7968;&#xFF0C;&#x786E;&#x5B9A;&#x4E86;&#x5B8C;&#x6574;&#x7684;&#x53D1;&#x5E03;&#x7279;&#x6027;&#x3002;&#x6700;&#x7EC8;&#x6280;&#x672F;&#x6027;&#x6295;&#x7968;&#x4E8E; 2020 &#x5E74; 2 &#x6708;&#x5728;&#x5E03;&#x62C9;&#x683C;&#x5B8C;&#x6210;&#x3002;</p>
<h2 id="33-&#x5BF9;&#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;">3.3 &#x5BF9;&#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;</h2>
<p>&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x3001;&#x590D;&#x6742;&#x7684;&#x51B3;&#x7B56;&#x6D41;&#x7A0B;&#x4EE5;&#x53CA;&#x5927;&#x91CF;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4F1A;&#x5982;&#x4F55;&#x5F71;&#x54CD; C++ &#x7684;&#x53D1;&#x5C55;&#xFF1F;&#x770B;&#x770B;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x89C4;&#x6A21;&#x3001;&#x7EC4;&#x6210;&#x53CA;&#x5176;&#x6D41;&#x7A0B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EFB;&#x4F55;&#x5EFA;&#x8BBE;&#x6027;&#x6210;&#x679C;&#x5C45;&#x7136;&#x80FD;&#x4ECE;&#x4E2D;&#x4EA7;&#x751F;&#xFF0C;&#x90FD;&#x8DB3;&#x4EE5;&#x4EE4;&#x4EBA;&#x60CA;&#x559C;&#x3002;&#x8FD9;&#x5DF2;&#x7ECF;&#x4E0D;&#x53EA;&#x662F;&#x201C;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x8BBE;&#x8BA1;&#x201D;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x201C;&#x591A;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x8054;&#x5408;&#x8BBE;&#x8BA1;&#x201D;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x7BA1;&#x7406;&#x7ED3;&#x6784;&#x975E;&#x5E38;&#x8584;&#x5F31;&#xFF0C;&#x751A;&#x81F3;&#x7F3A;&#x4E4F;&#x6700;&#x57FA;&#x672C;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF1A;</p>
<ul>
<li>&#x6210;&#x5458;&#x8D44;&#x683C;&#x3001;&#x53D1;&#x8A00;&#x6216;&#x6295;&#x7968;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8D44;&#x8D28;&#x8981;&#x6C42;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5B66;&#x5386;&#x6216;&#x5B9E;&#x9645;&#x7ECF;&#x9A8C;&#xFF09;&#x3002;&#x652F;&#x4ED8; ISO &#x4F1A;&#x5458;&#x8D39;&#xFF08;2018 &#x5E74;&#x7F8E;&#x56FD;&#x4F1A;&#x5458;&#x4E3A; 1280 &#x7F8E;&#x5143;&#xFF09;&#x5E76;&#x53C2;&#x52A0;&#x4E24;&#x6B21;&#x4F1A;&#x8BAE;&#xFF0C;&#x5C31;&#x80FD;&#x62E5;&#x6709;&#x6B63;&#x5F0F;&#x6295;&#x7968;&#x6743;&#x3002;&#x5728;&#x7814;&#x7A76;&#x7EC4;&#x548C;&#x5DE5;&#x4F5C;&#x7EC4;&#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x53D1;&#x8A00;&#x4E0E;&#x6295;&#x7968;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x53C2;&#x52A0;&#x4F1A;&#x8BAE;&#x3002;</li>
<li>&#x9664;&#x4E86;&#x8BA9;&#x63D0;&#x6848;&#x5F97;&#x5230;&#x91C7;&#x7EB3;&#xFF0C;&#x4EE5;&#x53CA;&#x770B;&#x5230;&#x6539;&#x8FDB;&#x540E;&#x7684;&#x6807;&#x51C6;&#x800C;&#x611F;&#x5230;&#x6EE1;&#x8DB3;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x56DE;&#x62A5;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6EE1;&#x8DB3;&#x611F;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x52A8;&#x529B;&#x3002;</li>
<li>&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7684;&#x529E;&#x6CD5;&#x6765;&#x963B;&#x6B62;&#x7834;&#x574F;&#x6027;&#x884C;&#x4E3A;&#x3002;&#x975E;&#x5B98;&#x65B9;&#x59D4;&#x5458;&#x4F1A;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x6240;&#x80FD;&#x505A;&#x7684;&#x53EA;&#x662F;&#x6709;&#x793C;&#x8C8C;&#x5730;&#x63D0;&#x9192;&#x4EBA;&#x4EEC;&#x4E0D;&#x8981;&#x505A;&#x522B;&#x4EBA;&#x8BA4;&#x4E3A;&#x5177;&#x6709;&#x7834;&#x574F;&#x6027;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x7136;&#x800C;&#x59D4;&#x5458;&#x4EEC;&#x5BF9;&#x4E8E;&#x4EC0;&#x4E48;&#x662F;&#x6709;&#x7834;&#x574F;&#x6027;&#x7684;&#xFF0C;&#x610F;&#x89C1;&#x4E5F;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</li>
</ul>
<p>&#x5F53;&#x8003;&#x8651;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x59D4;&#x5458;&#x4F1A;&#x91CC;&#x6F14;&#x5316;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x59D4;&#x5458;&#x4F1A;&#x91CC;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x548C;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x201C;&#x5C0F;&#x95EE;&#x9898;&#x201D;&#xFF1B;&#x5C31;&#x662F;&#x90A3;&#x4E9B;&#x4E0D;&#x4F1A;&#x4E0A;&#x5347;&#x5230;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x54F2;&#x5B66;&#x3001;&#x5B66;&#x672F;&#x51FA;&#x7248;&#x7269;&#x3001;&#x6216;&#x4F1A;&#x8BAE;&#x6F14;&#x793A;&#x5C42;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x4EEC;&#x5BF9;&#x4E8E;&#x9632;&#x6B62;&#x8BED;&#x8A00;&#x53CA;&#x5176;&#x6807;&#x51C6;&#x5E93;&#x88AB;&#x5206;&#x5272;&#x6210;&#x65B9;&#x8A00;&#xFF0C;&#x5E76;&#x4FDD;&#x8BC1;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5E73;&#x53F0;&#x4E4B;&#x95F4;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5305;&#x62EC;&#xFF1A;&#x547D;&#x540D;&#x3001;&#x540D;&#x79F0;&#x67E5;&#x627E;&#x3001;&#x91CD;&#x8F7D;&#x51B3;&#x7B56;&#x3001;&#x8BED;&#x6CD5;&#x7EC6;&#x8282;&#x3001;&#x6784;&#x4EF6;&#x7684;&#x786E;&#x5207;&#x542B;&#x4E49;&#x3001;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x7684;&#x751F;&#x5B58;&#x5468;&#x671F;&#x3001;&#x94FE;&#x63A5;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x3002;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x9700;&#x8981;&#x6280;&#x5DE7;&#x624D;&#x80FD;&#x89E3;&#x51B3;&#xFF0C;&#x800C;&#x62D9;&#x52A3;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x8BA9;&#x4EBA;&#x5403;&#x60CA;&#x800C;&#x5177;&#x6709;&#x7834;&#x574F;&#x6027;&#x7684;&#x540E;&#x679C;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5F80;&#x5F80;&#x7ECF;&#x8FC7;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EE5;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x51CF;&#x5C11;&#x5BF9;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x7834;&#x574F;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x6BCF;&#x5E74;&#x89E3;&#x51B3;&#x6570;&#x767E;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4F30;&#x8BA1;&#x59D4;&#x5458;&#x81F3;&#x5C11;&#x8981;&#x4E3A;&#x6B64;&#x82B1;&#x8D39;&#x4ED6;&#x4EEC;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x7684;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x4E43;&#x81F3;&#x4E8E;&#x4E09;&#x5206;&#x4E4B;&#x4E8C;&#x3002;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x5F80;&#x5F80;&#x88AB;&#x5FFD;&#x89C6;&#x548C;&#x4F4E;&#x4F30;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x8BA1;&#x7B97;&#x673A;&#x5316;&#x7684;&#x8BBE;&#x5907;&#xFF08;&#x4F8B;&#x5982;&#x7535;&#x8BDD;&#x6216;&#x6C7D;&#x8F66;&#xFF09;&#xFF0C;&#x4F60;&#x5F97;&#x611F;&#x8C22; CWG &#x548C; LWG &#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5F53;&#x5173;&#x6CE8;&#x7531;&#x4E00;&#x4E2A;&#x5E9E;&#x5927;&#x7684;&#x59D4;&#x5458;&#x4F1A;&#x5F15;&#x8D77;&#x7684;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4E5F;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x672C;&#x8D28;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x94B1;&#x4EBA;&#x7684;&#x70E6;&#x607C;&#xFF1A;C++ &#x7684;&#x6807;&#x51C6;&#x5316;&#x6D41;&#x7A0B;&#x7531;&#x6570;&#x767E;&#x4F4D;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x80CC;&#x666F;&#x7684;&#x70ED;&#x5FC3;&#x4EBA;&#x58EB;&#x6240;&#x9A71;&#x52A8;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x7ECF;&#x9A8C;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x90FD;&#x6EE1;&#x6000;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x3002;</p>
<p>&#x59D4;&#x5458;&#x4F1A;&#x5E94;&#x8D77;&#x5230;&#x8FC7;&#x6EE4;&#x4F5C;&#x7528;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x628A;&#x574F;&#x63D0;&#x6848;&#x6321;&#x5728;&#x6807;&#x51C6;&#x4E4B;&#x5916;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x8981;&#x63D0;&#x5347;&#x6700;&#x540E;&#x901A;&#x8FC7;&#x7684;&#x63D0;&#x6848;&#x7684;&#x54C1;&#x8D28;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x662F;&#x8981;&#x9F13;&#x52B1;&#x5927;&#x5BB6;&#x63D0;&#x51FA;&#x5EFA;&#x8BAE;&#xFF0C;&#x5E76;&#x4E3B;&#x52A8;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x6B63;&#x5F0F;&#x7684;&#x63D0;&#x6848;&#x5F81;&#x6C42;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x4E0D;&#x5B58;&#x5728;&#x5168;&#x804C;&#x7684; C++ &#x8BBE;&#x8BA1;&#x8005;&#xFF0C;&#x5C3D;&#x7BA1;&#x6709;&#x8BB8;&#x591A;&#x5168;&#x804C;&#x4EBA;&#x5458;&#x4ECE;&#x4E8B; C++ &#x7F16;&#x8BD1;&#x5668;&#x3001;&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x76F4;&#x5230;&#x6700;&#x8FD1;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x4E2D;&#x8FD8;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x4ECE;&#x4E8B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x59D4;&#x5458;&#x4F1A;&#x504F;&#x5411;&#x4E8E;&#x8BED;&#x8A00;&#x201C;&#x5F8B;&#x5E08;&#x201D;&#x3001;&#x9AD8;&#x9636;&#x7279;&#x6027;&#x548C;&#x5B9E;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x89E3;&#x51B3;&#x5927;&#x91CF; C++ &#x5F00;&#x53D1;&#x8005;&#x7684;&#x9700;&#x6C42;&#x2014;&#x2014;&#x5F88;&#x591A;&#x6210;&#x5458;&#x53EA;&#x662F;&#x95F4;&#x63A5;&#x5730;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x9700;&#x6C42;&#x3002;&#x6700;&#x8FD1;&#x65B0;&#x6210;&#x5458;&#x6025;&#x5267;&#x589E;&#x52A0;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F1A;&#x90E8;&#x5206;&#x7F13;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x59D4;&#x5458;&#x4F1A;&#x4E2D;&#x7684;&#x6559;&#x80B2;&#x5DE5;&#x4F5C;&#x8005;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x59D4;&#x5458;&#x4F1A;&#xFF08;&#x7406;&#x6240;&#x5F53;&#x7136;&#x5730;&#xFF09;&#x9AD8;&#x5EA6;&#x91CD;&#x89C6;&#x201C;&#x6613;&#x4E8E;&#x5B66;&#x4E60;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x59D4;&#x5458;&#x4EEC;&#x5BF9;&#x5176;&#x542B;&#x4E49;&#x6709;&#x7740;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x7684;&#x7406;&#x5FF5;&#xFF08;&#x7ECF;&#x5E38;&#x4F1A;&#x610F;&#x89C1;&#x5F3A;&#x70C8;&#xFF09;&#x3002;&#x8FD9;&#x5F80;&#x5F80;&#x4F7F;&#x5173;&#x4E8E;&#x201C;&#x7B80;&#x5355;&#x6027;&#x201D;&#x548C;&#x201C;&#x6613;&#x7528;&#x6027;&#x201D;&#x7684;&#x8BA8;&#x8BBA;&#x53D8;&#x5F97;&#x6DF7;&#x4E71;&#x3002;</p>
<p>&#x5F53;&#x601D;&#x8003;&#x7EC4;&#x7EC7;&#x95EE;&#x9898;&#x5BF9; C++ &#x53D1;&#x5C55;&#x7684;&#x5F71;&#x54CD;&#x65F6;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;ISO &#x6D41;&#x7A0B;&#x672C;&#x4E0D;&#x662F;&#x4E3A; 200 &#x4EBA;&#x7684;&#x4F1A;&#x8BAE;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x2014;&#x2014;&#x5178;&#x578B;&#x7684; ISO &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x59D4;&#x5458;&#x4F1A;&#x53EA;&#x6709;&#x4E00;&#x4E8C;&#x5341;&#x4EBA;&#x3002;&#x5E73;&#x5747;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x901A;&#x8FC7;&#x8BC6;&#x522B;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x6765;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li><p><strong>&#x5EF6;&#x8FDF;</strong>&#xFF1A;&#x591A;&#x9636;&#x6BB5;&#x7684;&#x6D41;&#x7A0B;&#x4E3A;&#x5EF6;&#x8FDF;&#x3001;&#x963B;&#x6B62;&#x63D0;&#x6848;&#x548C;&#x63D0;&#x6848;&#x53D8;&#x5316;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x673A;&#x4F1A;&#x3002;&#x5E38;&#x5E38;&#x51FA;&#x73B0;&#x51E0;&#x5341;&#x540D;&#x59D4;&#x5458;&#x575A;&#x6301;&#x8981;&#x6EE1;&#x8DB3;&#x4ED6;&#x4EEC;&#x7684;&#x8981;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x901A;&#x8FC7;&#x9610;&#x91CA;&#x3001;&#x6269;&#x5C55;&#x548C;&#x5BFB;&#x627E;&#x7279;&#x4F8B;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x773C;&#x4E2D;&#x7684;&#x8FC7;&#x5EA6;&#x5EF6;&#x8FDF;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x770B;&#x6765;&#x5374;&#x662F;&#x5C3D;&#x804C;&#x5C3D;&#x529B;&#x3002;</p>
<p>  &#x4F8B;&#x5982;&#xFF1A;&#x6982;&#x5FF5;&#xFF08;&#x5F53;&#x524D;&#x65B9;&#x6848;&#x4E3A; 6 &#x5E74;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#xFF09;&#x3001;&#x5951;&#x7EA6;&#xFF08;&#x4ECE;&#x5F00;&#x59CB;&#x5230;&#x5931;&#x8D25;&#x82B1;&#x4E86; 6 &#x5E74;&#xFF08;<a href="09.html#961-&#x5951;&#x7EA6;">&#xA7;9.6.1</a>&#xFF09;&#xFF09;&#x3001;&#x7F51;&#x7EDC;&#xFF08;15 &#x5E74;&#xFF0C;&#x4ECD;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#xFF08;<a href="08.html#881-&#x7F51;&#x7EDC;&#x5E93;">&#xA7;8.8.1</a>&#xFF09;&#xFF09;&#x548C; constexpr&#xFF08;5 &#x5E74;&#xFF08;<a href="04.html#427-constexpr-&#x51FD;&#x6570;">&#xA7;4.2.7</a>&#xFF09;&#xFF09;&#x3002;&#x751A;&#x81F3; <code>nullptr</code> &#x88AB;&#x63A5;&#x53D7;&#x4E5F;&#x82B1;&#x8D39;&#x4E86;&#x4E09;&#x5E74;&#x65F6;&#x95F4;&#xFF08;<a href="04.html#426-nullptr">&#xA7;4.2.6</a>&#xFF09;&#x3002;</p>
</li>
<li><p><strong>&#x5B64;&#x7ACB;&#x7279;&#x6027;</strong>&#xFF1A;&#x5927;&#x591A;&#x6570;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x559C;&#x6B22;&#x7279;&#x6027;&#x7684;&#x6DFB;&#x52A0;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4ED6;&#x4EEC;&#xFF08;&#x975E;&#x5E38;&#x5408;&#x7406;&#x5730;&#xFF09;&#x6DF1;&#x523B;&#x5730;&#x62C5;&#x5FC3;&#x7834;&#x574F;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x8FD9;&#x7ED9;&#x4E86;<strong>&#x5B64;&#x7ACB;&#x7279;&#x6027;</strong>&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x5B64;&#x7ACB;&#x7279;&#x6027;&#x662F;&#x4E0D;&#x5F71;&#x54CD;&#x8BED;&#x8A00;&#x548C;&#x6807;&#x51C6;&#x5E93;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x5C0F;&#x63D0;&#x6848;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x63D0;&#x6848;&#x5F88;&#x5C11;&#x4F1A;&#x5BF9;&#x8BED;&#x8A00;&#x7684;&#x4F7F;&#x7528;&#x4EA7;&#x751F;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x5374;&#x4F1A;&#x589E;&#x52A0;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5230;&#x5934;&#x6765;&#xFF0C;&#x5B83;&#x4EEC;&#x5F80;&#x5F80;&#x8FD8;&#x662F;&#x4F1A;&#x548C;&#x5176;&#x4ED6;&#x7279;&#x6027;&#x53D1;&#x751F;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<p>  &#x4F8B;&#x5982;&#xFF1A;&#x5927;&#x591A;&#x6570;&#x5728;&#x672C;&#x8BED;&#x8A00;&#x6F14;&#x5316;&#x603B;&#x7ED3;&#x4E2D;&#x4E0D;&#x503C;&#x5F97;&#x63D0;&#x53CA;&#x7684;&#x7279;&#x6027;&#x3002;&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;&#xFF08;<a href="08.html#82-&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;">&#xA7;8.2</a>&#xFF09;&#x548C;&#x8FD0;&#x7B97;&#x7B26; <code>&lt;=&gt;</code>&#xFF08;<a href="08.html#884-&#x7F3A;&#x7701;&#x6BD4;&#x8F83;">&#xA7;8.8.4</a>&#xFF09;&#x90FD;&#x9700;&#x8981;&#x591A;&#x6B21;&#x4F1A;&#x8BAE;&#x53BB;&#x5B8C;&#x5584;&#x3002;</p>
</li>
<li><p><strong>&#x540E;&#x6765;&#x8005;&#x5C45;&#x4E0A;</strong>&#xFF1A;&#x6709;&#x65F6;&#x7ECF;&#x8FC7;&#x591A;&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x63D0;&#x6848;&#x5DF2;&#x63A5;&#x8FD1;&#x6295;&#x7968;&#x8868;&#x51B3;&#xFF0C;&#x4E00;&#x4E9B;&#x4E00;&#x5411;&#x672A;&#x66FE;&#x5173;&#x6CE8;&#x63D0;&#x6848;&#x7684;&#x59D4;&#x5458;&#x6B64;&#x65F6;&#x8FDB;&#x5165;&#x8BA8;&#x8BBA;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x66FF;&#x4EE3;&#x63D0;&#x6848;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x63D0;&#x6848;&#x53EF;&#x80FD;&#x4E0E;&#x539F;&#x59CB;&#x63D0;&#x6848;&#x6709;&#x620F;&#x5267;&#x6027;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x5C0F;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x5F80;&#x5F80;&#x5BFC;&#x81F4;&#x5EF6;&#x8FDF;&#x3001;&#x6DF7;&#x4E71;&#x3001;&#x751A;&#x81F3;&#x6709;&#x65F6;&#x662F;&#x4E89;&#x6267;&#x3002;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#xFF0C;&#x5DF2;&#x7ECF;&#x8BAE;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#x53C8;&#x91CD;&#x88AB;&#x6FC0;&#x6D3B;&#xFF0C;&#x800C;&#x672A;&#x7ECF;&#x5C1D;&#x8BD5;&#xFF08;&#x901A;&#x5E38;&#x4E5F;&#x672A;&#x5B9E;&#x73B0;&#xFF09;&#x7684;&#x65B0;&#x60F3;&#x6CD5;&#x548C;&#x591A;&#x5E74;&#x5DE5;&#x4F5C;&#x7684;&#x6210;&#x679C;&#x83B7;&#x5F97;&#x4E86;&#x63A5;&#x8FD1;&#x76F8;&#x7B49;&#x7684;&#x6743;&#x91CD;&#x3002;&#x5BF9;&#x8001;&#x63D0;&#x6848;&#x800C;&#x8A00;&#xFF0C;&#x7455;&#x75B5;&#x5DF2;&#x7ECF;&#x88AB;&#x53D1;&#x73B0;&#x8FC7;&#x4E86;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x6280;&#x672F;&#x6298;&#x4E2D;&#x4E5F;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x3002;&#x4EBA;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x8C61;&#x65B0;&#x4E8B;&#x7269;&#x7684;&#x597D;&#x5904;&#x800C;&#x5FD8;&#x8BB0;&#x610F;&#x5916;&#x540E;&#x679C;&#x5B9A;&#x5F8B;&#xFF1A;<strong>&#x610F;&#x5916;&#x540E;&#x679C;&#x603B;&#x662F;&#x4F1A;&#x51FA;&#x73B0;&#x7684;</strong>&#x3002;&#x65B0;&#x7684;&#x548C;&#x76F8;&#x5BF9;&#x672A;&#x7ECF;&#x5BA1;&#x67E5;&#x7684;&#x603B;&#x662F;&#x770B;&#x8D77;&#x6765;&#x6BD4;&#x8001;&#x7684;&#x66F4;&#x597D;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x8F83;&#x65E9;&#x63D0;&#x6848;&#x7684;&#x62E5;&#x62A4;&#x8005;&#x53D8;&#x5F97;&#x5177;&#x6709;&#x9632;&#x5FA1;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x5206;&#x6563;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x5B8C;&#x5584;&#x201C;&#x8001;&#x63D0;&#x6848;&#x201D;&#x7684;&#x7CBE;&#x529B;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x201C;&#x8001;&#x201D;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x51E0;&#x5E74;&#xFF0C;&#x6216;&#x8005;&#x5C31;&#x50CF;&#x6982;&#x5FF5;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x90A3;&#x6837;&#x5341;&#x51E0;&#x5E74;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x63A5;&#x53D7;&#x672A;&#x7ECF;&#x5C1D;&#x8BD5;&#x7684;&#x540E;&#x671F;&#x53D8;&#x66F4;&#xFF08;&#x6240;&#x8C13;&#x6539;&#x8FDB;&#xFF09;&#x662F;&#x4E3A;&#x4E86;&#x5B89;&#x629A;&#x53CD;&#x5BF9;&#x6D3E;&#xFF1B;&#x8FD9;&#x7ECF;&#x5E38;&#x5BFC;&#x81F4;&#x610F;&#x5916;&#x7684;&#x540E;&#x679C;&#x3002;&#x540E;&#x671F;&#x52A0;&#x5165;&#x8BA8;&#x8BBA;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x8BA4;&#x4E3A;&#x6709;&#x201C;&#x51B2;&#x523A;&#x7684;&#x5FC5;&#x8981;&#x201D;&#xFF0C;&#x800C;&#x662F;&#x81EA;&#x7136;&#x5730;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x5F97;&#x5230;&#x8BA4;&#x771F;&#x8003;&#x8651;&#xFF08;&#x800C;&#x901A;&#x5E38;&#x5E76;&#x6CA1;&#x6709;&#x8BA4;&#x771F;&#x8003;&#x8651;&#x8001;&#x63D0;&#x6848;&#x7684;&#x7EC6;&#x8282;&#x548C;&#x7406;&#x7531;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x4E0E;&#x5DF2;&#x7ECF;&#x5728;&#x8001;&#x63D0;&#x6848;&#x4E0A;&#x6295;&#x5165;&#x591A;&#x5E74;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x4EEC;&#x4EA7;&#x751F;&#x6469;&#x64E6;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;&#xFF08;&#x8BED;&#x6CD5;&#x66F4;&#x6539;&#xFF0C;&#x5BF9;&#x4F4D;&#x57DF;&#x7684;&#x65B0;&#x589E;&#x652F;&#x6301;&#xFF0C;&#x7B28;&#x62D9;&#x7684; <code>get()</code>&#xFF08;<a href="08.html#82-&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;">&#xA7;8.2</a>&#xFF09;&#xFF09;&#x3001;&#x6982;&#x5FF5;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x3002;&#x6570;&#x5B57;&#x5206;&#x9694;&#x7B26;&#xFF08;<a href="05.html#51-&#x6570;&#x5B57;&#x5206;&#x9694;&#x7B26;">&#xA7;5.1</a>&#xFF09;&#x3001;&#x70B9;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;<a href="08.html#882-&#x70B9;&#x8FD0;&#x7B97;&#x7B26;">&#xA7;8.8.2</a>&#xFF09;&#x3001;&#x6A21;&#x5757;&#xFF08;<a href="09.html#931-&#x6A21;&#x5757;">&#xA7;9.3.1</a>&#xFF09;&#x3001;&#x534F;&#x7A0B;&#xFF08;<a href="09.html#932-&#x534F;&#x7A0B;">&#xA7;9.3.2</a>&#xFF09;&#x3001;&#x5951;&#x7EA6;&#xFF08;<a href="09.html#961-&#x5951;&#x7EA6;">&#xA7;9.6.1</a>&#xFF09;&#x3002;</p>
</li>
<li><p><strong>&#x70ED;&#x60C5;&#x603B;&#x9752;&#x7750;&#x65B0;&#x4E8B;&#x7269;</strong>&#xFF1A;&#x5524;&#x8D77;&#x5BF9;&#x65B0;&#x4E8B;&#x7269;&#x7684;&#x70ED;&#x60C5;&#x6BD4;&#x53CD;&#x5BF9;&#x5B83;&#x4EEC;&#x5BB9;&#x6613;&#x3002;&#x6BCF;&#x4E2A;&#x63D0;&#x6848;&#x90FD;&#x662F;&#x4E3A;&#x67D0;&#x4EBA;&#x89E3;&#x51B3;&#x67D0;&#x4E8B;&#xFF0C;&#x652F;&#x6301;&#x8005;&#x613F;&#x610F;&#x82B1;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x5C55;&#x73B0;&#x5176;&#x4EF7;&#x503C;&#x3002;&#x800C;&#x8981;&#x53CD;&#x5BF9;&#x5B83;&#x4EEC;&#xFF0C;&#x6709;&#x4EBA;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF1A;</p>
<ul>
<li>&#x201C;&#x4E0D;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x3002;&#x201D;</li>
<li>&#x201C;&#x4E0D;&#xFF0C;&#x8FD9;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6709;&#x7F3A;&#x9677;&#x3002;&#x201D;</li>
<li>&#x201C;&#x4E0D;&#xFF0C;&#x4F60;&#x8FD8;&#x6CA1;&#x6709;&#x5145;&#x5206;&#x8BB0;&#x5F55;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x201D;</li>
<li><p>&#x201C;&#x4E0D;&#xFF0C;&#x4F60;&#x8FD8;&#x6CA1;&#x6709;&#x4ED4;&#x7EC6;&#x68C0;&#x67E5;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;&#x201D;</p>
<p>&#x4E0D;&#x7BA1;&#x63AA;&#x8F9E;&#x600E;&#x4E48;&#x5BA2;&#x6C14;&#xFF0C;&#x8FD9;&#x90FD;&#x8BA9;&#x53CD;&#x5BF9;&#x8005;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x50CF;&#x201C;&#x574F;&#x4EBA;&#x201D;&#xFF0C;&#x662F;&#x4ED6;&#x4EEC;&#x963B;&#x788D;&#x4E86;&#x8FDB;&#x6B65;&#x5E76;&#x5426;&#x8BA4;&#x652F;&#x6301;&#x8005;&#x9700;&#x6C42;&#x7684;&#x5408;&#x7406;&#x6027;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x62E5;&#x62A4;&#x8005;&#x603B;&#x662F;&#x6BD4;&#x53CD;&#x5BF9;&#x8005;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x51C6;&#x5907;&#x8BBA;&#x6587;&#x548C;&#x6F14;&#x8BB2;&#x3002;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x559C;&#x6B22;&#x5BF9;&#x81EA;&#x5DF1;&#x76F8;&#x4FE1;&#x7684;&#x4E8B;&#x7269;&#x8FDB;&#x884C;&#x5EFA;&#x8BBE;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C0F;&#x5FC3;&#x5730;&#x62C6;&#x9664;&#x4ED6;&#x4EBA;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x652F;&#x6301;&#x8005;&#x901A;&#x5E38;&#x90FD;&#x5F88;&#x70ED;&#x60C5;&#x5E76;&#x4E14;&#x51C6;&#x5907;&#x5145;&#x5206;&#xFF0C;&#x800C;&#x53CD;&#x5BF9;&#x8005;&#x603B;&#x662F;&#x663E;&#x5F97;&#x610F;&#x89C1;&#x542B;&#x7CCA;&#x800C;&#x4E0D;&#x61C2;&#x7EC6;&#x8282;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6BCF;&#x9879;&#x65B0;&#x7279;&#x6027;&#x90FD;&#x6709;&#x5176;&#x6210;&#x672C;&#xFF1A;&#x5982;&#x8BBE;&#x8BA1;&#x3001;&#x89C4;&#x8303;&#x3001;&#x5B9E;&#x73B0;&#x3001;&#x4FEE;&#x8BA2;&#x3001;&#x90E8;&#x7F72;&#x548C;&#x6559;&#x5B66;&#xFF08;<a href="09.html#95-&#x6B21;&#x8981;&#x7279;&#x6027;">&#xA7;9.5</a>&#xFF09;&#x3002;&#x6211;&#x5BB3;&#x6015;&#x5728;&#x6F14;&#x5316;&#x5DE5;&#x4F5C;&#x7EC4;&#x5EA6;&#x8FC7;&#x5468;&#x56DB;&#x4E0B;&#x5348;&#x3002;&#x90A3;&#x65F6;&#xFF0C;EWG &#x6210;&#x5458;&#x7ECF;&#x8FC7;&#x51E0;&#x5929;&#x7684;&#x5927;&#x63D0;&#x6848;&#x5DE5;&#x4F5C;&#x800C;&#x611F;&#x5230;&#x75B2;&#x5026;&#xFF0C;&#x8BB8;&#x591A;&#x8001;&#x6210;&#x5458;&#xFF08;&#x4F8B;&#x5982;&#x6211;&#xFF09;&#x5DF2;&#x7ECF;&#x88AB;&#x62D6;&#x5165;&#x5176;&#x4ED6;&#x5C0F;&#x7EC4;&#xFF0C;&#x53C2;&#x4F1A;&#x8005;&#x53C8;&#x6025;&#x4E8E;&#x770B;&#x5230;&#x6709;&#x6210;&#x679C;&#x3002;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#xFF0C;&#x5C0F;&#x63D0;&#x6848;&#x5C31;&#x4F1A;&#x53EA;&#x7ECF;&#x53D7;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#x7684;&#x5BA1;&#x67E5;&#x800C;&#x6ED1;&#x5165;&#x6807;&#x51C6;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x6761;&#x4EF6;&#x4E2D;&#x7684;&#x663E;&#x5F0F;&#x6D4B;&#x8BD5;&#xFF08;<a href="08.html#87-&#x6761;&#x4EF6;&#x7684;&#x663E;&#x5F0F;&#x6D4B;&#x8BD5;">&#xA7;8.7</a>&#xFF09;&#x3001;<code>inline</code> &#x53D8;&#x91CF;&#xFF08;<a href="08.html#8-c17&#x5927;&#x6D77;&#x8FF7;&#x822A;">&#xA7;8</a>&#xFF09;&#x3001;&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;&#x7684;&#x540E;&#x671F;&#x66F4;&#x6539;&#xFF08;<a href="08.html#82-&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;">&#xA7;8.2</a>&#xFF09;&#x3002;</p>
</li>
</ul>
</li>
<li><p><strong>&#x8FC7;&#x5EA6;&#x81EA;&#x4FE1;</strong>&#xFF1A;&#x76F8;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x8BED;&#x8A00;&#x53CA;&#x6807;&#x51C6;&#x5E93;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E0D;&#x540C;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x7684; C++ &#x7528;&#x6237;&#x6240;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4E2A;&#x4EBA;&#x5728;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x80FD;&#x83B7;&#x5F97;&#x7684;&#x7ECF;&#x9A8C;&#x603B;&#x662F;&#x4E0D;&#x8DB3;&#x7684;&#x3002;&#x5E76;&#x975E;&#x6240;&#x6709;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x90FD;&#x80FD;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x5C40;&#x9650;&#xFF0C;&#x6216;&#x662F;&#x80FD;&#x901A;&#x8FC7;&#x8D28;&#x7591;&#x81EA;&#x8EAB;&#x7ECF;&#x9A8C;&#x7684;&#x63A8;&#x5E7F;&#x4EF7;&#x503C;&#x52A0;&#x4EE5;&#x5F25;&#x8865;&#x3002;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x67D0;&#x4E9B;&#x4E00;&#x822C;&#x6027;&#x6709;&#x9650;&#x7684;&#x63D0;&#x6848;&#x88AB;&#x8FC7;&#x5EA6;&#x63A8;&#x5E7F;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x4E9B;&#x59D4;&#x5458;&#x5F3A;&#x70C8;&#x53CD;&#x5BF9;&#x67D0;&#x4E9B;&#x63D0;&#x6848;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E0D;&#x8BA4;&#x4E3A;&#x6709;&#x5FC5;&#x8981;&#x89E3;&#x51B3;&#x8BE5;&#x63D0;&#x6848;&#x6240;&#x9488;&#x5BF9;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x667A;&#x529B;&#x4E0A;&#x7684;&#x8C26;&#x900A; [Stroustrup 2019b]&#x3002;&#x5148;&#x60F3;&#x51FA;&#x6765;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5F88;&#x5C11;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x800C;&#x672A;&#x7ECF;&#x8FDB;&#x4E00;&#x6B65;&#x8BA4;&#x771F;&#x601D;&#x8003;&#x5C31;&#x63D0;&#x51FA;&#x8F7B;&#x7387;&#x7684;&#x53CD;&#x5BF9;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#x5F88;&#x5C11;&#x4F1A;&#x5E26;&#x6765;&#x6539;&#x8FDB;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;&#x51FA;&#x4E8E;&#x5BF9;&#x72AF;&#x9519;&#x8005;&#x7684;&#x4FDD;&#x62A4;&#xFF0C;&#x5C31;&#x4E0D;&#x4E3E;&#x4F8B;&#x4E86;&#x3002;</p>
</li>
<li><p><strong>&#x5B9E;&#x73B0;&#x65F6;&#x673A;&#x4E0D;&#x5F53;</strong>&#xFF1A;&#x5728;&#x6807;&#x51C6;&#x6D41;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0;&#x63D0;&#x6848;&#x665A;&#x4E86;&#x6709;&#x98CE;&#x9669;&#xFF1A;&#x7279;&#x6027;&#x51FA;&#x73B0;&#x4E25;&#x91CD;&#x7F3A;&#x9677;&#x3001;&#x6709;&#x6F5C;&#x5728;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x90E8;&#x5206;&#x3001;&#x4EE5;&#x53CA;&#x7F3A;&#x4E4F;&#x4F7F;&#x7528;&#x53CD;&#x9988;&#xFF1B;&#x5B9E;&#x73B0;&#x65E9;&#x4E86;&#x4E5F;&#x6709;&#x98CE;&#x9669;&#xFF1A;&#x7279;&#x6027;&#x4EE5;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x3001;&#x6B21;&#x4F18;&#x7684;&#x4E14;&#x96BE;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x5F62;&#x5F0F;&#x51BB;&#x7ED3;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x4EBA;&#x4E0D;&#x4F1A;&#x6295;&#x7968;&#x8D5E;&#x6210;&#x5C1A;&#x672A;&#x5B9E;&#x73B0;&#x6216;&#x4EE5;&#x4ED6;&#x4EEC;&#x4E0D;&#x4FE1;&#x4EFB;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x7684;&#x63D0;&#x6848;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8BB8;&#x591A;&#x5B9E;&#x73B0;&#x8005;&#x4E0D;&#x613F;&#x610F;&#x4E3A;&#x59D4;&#x5458;&#x4F1A;&#x672A;&#x6279;&#x51C6;&#x7684;&#x63D0;&#x6848;&#x6295;&#x5165;&#x5B9E;&#x73B0;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x56F0;&#x96BE;&#x800C;&#x73B0;&#x5B9E;&#x7684;&#x4E24;&#x96BE;&#x56F0;&#x5883;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x7ECF;&#x5E38;&#x542C;&#x5230;&#x201C;&#x5B83;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x5417;&#xFF1F;&#x201D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x201C;&#x5B83;&#x662F;&#x7ECF;&#x8FC7;&#x8BBE;&#x8BA1;&#x7684;&#x5417;&#xFF1F;&#x201D; &#x548C;&#x201C;&#x8981;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#xFF1F;&#x201D; &#x662F;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4EBA;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5728;&#x7EC6;&#x8282;&#x4E2D;&#x8FF7;&#x5931;&#x3002;&#x6211;&#x63D0;&#x51FA;&#x7684;&#x8D70;&#x51FA;&#x8FD9;&#x4E00;&#x56F0;&#x5883;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5C31;&#x5EFA;&#x8BAE;&#x7684;&#x65B9;&#x5411;&#x3001;&#x63D0;&#x6848;&#x7684;&#x603B;&#x4F53;&#x8303;&#x56F4;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x5B50;&#x96C6;&#x7684;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x51FA;&#x53D1;&#xFF0C;&#x4EE5;&#x5173;&#x952E;&#x7528;&#x4F8B;&#x4E3A;&#x6307;&#x5BFC;&#x524D;&#x8FDB;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x8F83;&#x65E9;&#x5730;&#x83B7;&#x5F97;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5E76;&#x4E86;&#x89E3;&#x8BE5;&#x7279;&#x6027;&#x5982;&#x4F55;&#x4E0E;&#x5176;&#x4ED6;&#x7279;&#x6027;&#x4EA4;&#x4E92;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x6709;&#x4E00;&#x4E2A;&#x957F;&#x8FDC;&#x7684;&#x770B;&#x6CD5; [Stroustrup 1993, 1994, 2007]&#xFF08;<a href="01.html#1-&#x524D;&#x8A00;">&#xA7;1</a>&#xFF09;&#xFF0C;&#xFF08;<a href="11.html#112-&#x6280;&#x672F;&#x4E0A;&#x7684;&#x6210;&#x529F;">&#xA7;11.2</a>&#xFF09;&#xFF0C;&#x5426;&#x5219;&#x8BED;&#x8A00;&#x5C31;&#x4F1A;&#x6CA6;&#x4E3A;&#x673A;&#x4F1A;&#x4E3B;&#x4E49;&#x7684;&#x96F6;&#x6572;&#x788E;&#x6253;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x8BED;&#x8A00;&#x5C06;&#x4ECE;&#x53CD;&#x9988;&#x548C;&#x6709;&#x673A;&#x589E;&#x957F;&#x4E2D;&#x53D7;&#x76CA;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;&#x6A21;&#x5757;&#xFF08;<a href="09.html#931-&#x6A21;&#x5757;">&#xA7;9.3.1</a>&#xFF09;&#x3001;C++ 0x &#x6982;&#x5FF5;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x548C; <code>&lt;=&gt;</code>&#xFF08;<a href="08.html#884-&#x7F3A;&#x7701;&#x6BD4;&#x8F83;">&#xA7;8.8.4</a>&#xFF09;&#x3002;</p>
</li>
<li><p><strong>&#x7279;&#x6027;&#x4EA4;&#x4E92;</strong>&#xFF1A;&#x6700;&#x96BE;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x662F;&#x7279;&#x6027;&#x7684;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#x3002;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8FD9;&#x662F;&#x89C4;&#x8303;&#x548C;&#x5B9E;&#x73B0;&#x7684;&#x6280;&#x672F;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x59D4;&#x5458;&#x4F1A;&#x65F6;&#x95F4;&#x3002;&#x4ECE;&#x8BBE;&#x8BA1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x66F4;&#x96BE;&#x7684;&#x95EE;&#x9898;&#x662F;&#x8981;&#x9884;&#x8BA1;&#x65B0;&#x7279;&#x6027;&#x5728;&#x6574;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x5883;&#x4E2D;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BED;&#x5883;&#x5305;&#x62EC;&#x5176;&#x4ED6;&#x6B63;&#x5728;&#x8003;&#x8651;&#x4E2D;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x5E93;&#x7684;&#x65B0;&#x7279;&#x6027;&#x3002;&#x6BCF;&#x4E2A;&#x7279;&#x6027;&#x90FD;&#x5E94;&#x8BBE;&#x8BA1;&#x6210;&#x4FBF;&#x4E8E;&#x540C;&#x5176;&#x4ED6;&#x7279;&#x6027;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x3002;&#x6211;&#x62C5;&#x5FC3;&#x8FD9;&#x4E00;&#x70B9;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x91CD;&#x89C6;&#x3002;&#x5F88;&#x5C11;&#x6709;&#x63D0;&#x6848;&#x4E66;&#x63D0;&#x4F9B;&#x8BE6;&#x7EC6;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x800C;&#x59D4;&#x5458;&#x4F1A;&#x91CC;&#x5173;&#x4E8E;&#x7279;&#x6027;&#x4EA4;&#x4E92;&#x7684;&#x8BA8;&#x8BBA;&#x5F80;&#x5F80;&#x7B80;&#x77ED;&#x6216;&#x6DF7;&#x4E71;&#x3002;&#x5176;&#x7ED3;&#x679C;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x4E2A;&#x522B;&#x7279;&#x6027;&#x8D8B;&#x4E8E;&#x81A8;&#x80C0;&#x800C;&#x53EA;&#x597D;&#x628A;&#x5B83;&#x5B64;&#x7ACB;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x624D;&#x80FD;&#x7528;&#x8D77;&#x6765;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;<code>tuple</code>&#xFF08;<a href="04.html#434-tuple">&#xA7;4.3.4</a>&#xFF09;&#x548C; <code>&lt;=&gt;</code>&#xFF08;<a href="09.html#934-">&#xA7;9.3.4</a>&#xFF09;&#x3002;&#x4E3A; lambda &#x8868;&#x8FBE;&#x5F0F;&#xFF08;<a href="04.html#431-lambda-&#x8868;&#x8FBE;&#x5F0F;">&#xA7;4.3.1</a>&#xFF09;&#x4E2D;&#x7684;&#x52A8;&#x4F5C;&#x6307;&#x5B9A;&#x4E13;&#x7528;&#x8BED;&#x6CD5;&#x7684;&#xFF08;&#x5931;&#x8D25;&#xFF09;&#x63D0;&#x6848;&#x3002;</p>
</li>
<li><p><strong>&#x7BC7;&#x5E45;&#x548C;&#x5206;&#x5FC3;</strong>&#xFF1A;&#x5343;&#x5934;&#x4E07;&#x7EEA;&#x5F80;&#x5F80;&#x540C;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x5168;&#x8DDF;&#x5F97;&#x4E0A;&#x3002;&#x90A3;&#x4E9B;&#x5C1D;&#x8BD5;&#x5168;&#x90E8;&#x5173;&#x6CE8;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x5BB9;&#x6613;&#x5931;&#x53BB;&#x5BF9;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x8BFE;&#x9898;&#x7684;&#x5173;&#x6CE8;&#xFF0C;&#x800C;&#x628A;&#x6CE8;&#x610F;&#x529B;&#x5206;&#x6563;&#x5728;&#x4E00;&#x4E9B;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x5E76;&#x4E0D;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x7684;&#x8BFE;&#x9898;&#x4E0A;&#x3002;&#x5982;&#x4ECA;&#x6BCF;&#x5E74;&#x6709;&#x8D85;&#x8FC7; 500 &#x7BC7;&#x59D4;&#x5458;&#x4F1A;&#x8BBA;&#x6587;&#xFF0C;&#x6709;&#x4E9B;&#x957F;&#x8FBE;&#x6570;&#x5341;&#x751A;&#x81F3;&#x6570;&#x767E;&#x9875;&#x3002;&#x4E0E; 2010 &#x5E74;&#x4EE3;&#x521D;&#x76F8;&#x6BD4;&#xFF0C;&#x6587;&#x732E;&#x603B;&#x7BC7;&#x5E45;&#x7FFB;&#x4E86;&#x4E00;&#x756A;&#x3002;&#x6211;&#x6CE8;&#x610F;&#x5230;&#xFF0C;2018 &#x5E74;&#x79CB;&#x5929;&#x7684;&#x4F1A;&#x524D;&#x90AE;&#x4EF6;&#xFF08;&#x65B0;&#x8BBA;&#x6587;&#x6C47;&#x603B;&#xFF09;&#x7684;&#x5B57;&#x6570;&#x662F;&#x838E;&#x58EB;&#x6BD4;&#x4E9A;&#x5168;&#x96C6;&#x7684;&#x4E09;&#x500D;&#x3002;</p>
<p>  &#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684;&#x6CDB;&#x6EE5;&#x6700;&#x8BA9;&#x4EBA;&#x5206;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x8BB8;&#x591A;&#x59D4;&#x5458;&#x559C;&#x6B22;&#x901A;&#x8FC7;&#x4E00;&#x6CE2;&#x4E00;&#x6CE2;&#x5730;&#x7206;&#x53D1;&#x77ED;&#x90AE;&#x4EF6;&#x6765;&#x8FDB;&#x884C;&#x6280;&#x672F;&#x8BA8;&#x8BBA;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#x6389;&#x961F;&#x610F;&#x5473;&#x7740;&#x5931;&#x53BB;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x8DDF;&#x8E2A;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x5171;&#x8BC6;&#x53EA;&#x662F;&#x4ECE;&#x51E0;&#x4E2A;&#x4E00;&#x76F4;&#x80FD;&#x8DDF;&#x5F97;&#x4E0A;&#x8BA8;&#x8BBA;&#x7684;&#x4EBA;&#x4E2D;&#x95F4;&#x6D6E;&#x73B0;&#x3002;</p>
<p>  &#x8FD9;&#x79CD;&#x8BA8;&#x8BBA;&#x4E0D;&#x5229;&#x4E8E;&#x51B7;&#x9759;&#x800C;&#x7CFB;&#x7EDF;&#x5730;&#x6743;&#x8861;&#x5404;&#x79CD;&#x9009;&#x62E9;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x5E78;&#x7684;&#x7279;&#x6027;&#x6ED1;&#x5165;&#x6807;&#x51C6;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x4F53;&#x73B0;&#x4E8E;&#x8BED;&#x8A00;&#x548C;&#x6807;&#x51C6;&#x5E93;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#xFF0C;&#x8FDB;&#x800C;&#x635F;&#x5BB3;&#x4E86;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;<code>any</code>&#x3001;<code>optional</code> &#x548C; <code>variant</code> &#x7684;&#x4E0D;&#x540C;&#x63A5;&#x53E3;&#xFF08;<a href="08.html#83-variantoptional-&#x548C;-any">&#xA7;8.3</a>&#xFF09;&#x3002;&#x6982;&#x5FF5;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x3002;</p>
</li>
<li><p><strong>&#x7CBE;&#x786E;&#x89C4;&#x8303;</strong>&#xFF1A;&#x6807;&#x51C6;&#x662F;&#x89C4;&#x8303;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6807;&#x51C6;&#x662F;&#x7528;&#x82F1;&#x8BED;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x505A;&#x4E0D;&#x5230;&#x6570;&#x5B66;&#x822C;&#x7684;&#x7CBE;&#x5EA6;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x8BB8;&#x591A;&#x6210;&#x5458;&#x64C5;&#x957F;&#x6570;&#x5B66;&#xFF0C;&#x4F46;&#x4E0D;&#x64C5;&#x957F;&#x6570;&#x5B66;&#x7684;&#x4EBA;&#x66F4;&#x591A;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x89C4;&#x8303;&#x4E2D;&#x6CA1;&#x529E;&#x6CD5;&#x4F7F;&#x7528;&#x6570;&#x5B66;&#x5F0F;&#x7684;&#x5199;&#x6CD5;&#x3002;&#x8BD5;&#x56FE;&#x4F7F;&#x82F1;&#x6587;&#x6587;&#x672C;&#x7CBE;&#x786E;&#x800C;&#x8BE6;&#x5C3D;&#xFF0C;&#x5219;&#x4F1A;&#x8BA9;&#x6587;&#x672C;&#x53D8;&#x5F97;&#x751F;&#x786C;&#x53C8;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002;&#x6211;&#x5E38;&#x5E38;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x6807;&#x51C6;&#x4E2D;&#x5BF9;&#x6211;&#x81EA;&#x5DF1;&#x63D0;&#x6848;&#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
<p>  &#x5927;&#x591A;&#x6570;&#x59D4;&#x5458;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#xFF0C;&#x56E0;&#x6B64;&#x89C4;&#x8303;&#x6709;&#x65F6;&#x770B;&#x8D77;&#x6765;&#x4F1A;&#x50CF;&#x7A0B;&#x5E8F;&#x2014;&#x2014;&#x7528;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x6216;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#x5199;&#x6210;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x6709;&#x8BE6;&#x5C3D;&#x7684;&#x5982;&#x679C;&#x3001;&#x90A3;&#x4E48;&#x3001;&#x5426;&#x5219;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x5374;&#x5F88;&#x5C11;&#x5199;&#x51FA;&#x4E0D;&#x53D8;&#x91CF;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x5F88;&#x591A;&#x8BCD;&#x6C47;&#x7EE7;&#x627F;&#x81EA; C&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x57FA;&#x4E8E;&#x7A0B;&#x5E8F;&#x6E90;&#x4EE3;&#x7801;&#x6587;&#x672C;&#x4E2D;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x6982;&#x5FF5;&#x4EC5;&#x88AB;&#x95F4;&#x63A5;&#x63D0;&#x51FA;&#x3002;</p>
<p>  &#x5947;&#x602A;&#x7684;&#x662F;&#xFF0C;&#x6807;&#x51C6;&#x5E93;&#x89C4;&#x8303;&#x5728;&#x7ED3;&#x6784;&#x4E0A;&#x660E;&#x663E;&#x6BD4;&#x8BED;&#x8A00;&#x89C4;&#x8303;&#x66F4;&#x4E3A;&#x6B63;&#x5F0F;&#x3002;</p>
</li>
<li><p><strong>&#x7ECF;&#x9662;&#x4E3B;&#x4E49;</strong>&#xFF1A;&#x5F53;&#x7136;&#x6709;&#x5FC5;&#x8981;&#x5927;&#x529B;&#x5F3A;&#x8C03;&#x6807;&#x51C6;&#x6587;&#x672C;&#x7684;&#x6B63;&#x786E;&#x6027;&#x548C;&#x51C6;&#x786E;&#x6027;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4EBA;&#x4EEC;&#x6709;&#x65F6;&#x4F1A;&#x5FD8;&#x8BB0;&#x6807;&#x51C6;&#x672C;&#x8EAB;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF0C;&#x800C;&#x4EC5;&#x6839;&#x636E;&#x6807;&#x51C6;&#x6587;&#x672C;&#x7684;&#x8BBA;&#x8BC1;&#x6765;&#x8BA8;&#x8BBA;&#x6B63;&#x786E;&#x6027;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x6839;&#x636E;&#x6807;&#x51C6;&#x6587;&#x672C;&#x6240;&#x5E94;&#x53CD;&#x6620;&#x7684;&#x6A21;&#x578B;&#x548C;&#x4F7F;&#x7528;&#x4E0A;&#x7684;&#x8BBA;&#x8BC1;&#xFF0C;&#x53CD;&#x5012;&#x53EF;&#x80FD;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
</li>
<li><p><strong>&#x65B9;&#x5411;</strong>&#xFF1A;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x662F;&#x771F;&#x5B9E;&#x7684;&#xFF1F;&#x91CD;&#x8981;&#x5417;&#xFF1F;&#x5BF9;&#x4E8E;&#x8C01;&#xFF1F;&#x54EA;&#x4E9B;&#x7D27;&#x6025;&#xFF1F;&#x5341;&#x5E74;&#x540E;&#xFF0C;&#x54EA;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4ECD;&#x7136;&#x6709;&#x610F;&#x4E49;&#xFF1F;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x4E5F;&#x8BB8;&#x7B97;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B83;&#x5FC5;&#x987B;&#x5728;&#x8BED;&#x8A00;&#x91CC;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5C24;&#x5176;&#x662F;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x5F88;&#x96BE;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x4E0D;&#x53EF;&#x80FD;&#x5BF9;&#x6240;&#x6709;&#x4EBA;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x4E07;&#x80FD;&#x7684;&#x3002;&#x66F4;&#x96BE;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x5C45;&#x7136;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6BCF;&#x4E2A;&#x59D4;&#x5458;&#x6700;&#x7D27;&#x6025;&#x7684;&#x95EE;&#x9898; [Stroustrup 2018d]&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;C++17&#xFF08;<a href="08.html#8-c17&#x5927;&#x6D77;&#x8FF7;&#x822A;">&#xA7;8</a>&#xFF09;&#x548C; C++ 20&#xFF08;<a href="09.html#9-c20&#x65B9;&#x5411;&#x4E4B;&#x4E89;">&#xA7;9</a>&#xFF09;&#x3002;</p>
</li>
<li><p><strong>&#x4E13;&#x4E00;&#x5173;&#x6CE8;</strong>&#xFF1A;&#x4E00;&#x4E9B;&#x59D4;&#x5458;&#x4EC5;&#x5173;&#x6CE8;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x8BFE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x8BED;&#x8A00;&#x6280;&#x672F;&#x3001;&#x6613;&#x7528;&#x6027;&#x3001;&#x201C;&#x53EF;&#x6559;&#x5B66;&#x6027;&#x201D;&#x3001;&#x6548;&#x7387;&#x3001;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x3001;&#x5728;&#x5355;&#x4E2A;&#x884C;&#x4E1A;&#x4E2D;&#x4F7F;&#x7528;&#x3001;&#x5728;&#x5355;&#x4E2A;&#x516C;&#x53F8;&#x4E2D;&#x4F7F;&#x7528;&#x3001;&#x5355;&#x4E2A;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x7B49;&#x3002;&#x5BF9;&#x4E8E;&#x4E13;&#x4E00;&#x5173;&#x6CE8;&#x7684;&#x59D4;&#x5458;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x8BA9;&#x5E7F;&#x6CDB;&#x7684;&#x3001;&#x5E73;&#x8861;&#x7684;&#x8FDB;&#x5C55;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x3002;&#x8FC7;&#x5206;&#x76F8;&#x4FE1;&#x7406;&#x8BBA;&#x6216;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x5219;&#x662F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x53E6;&#x4E00;&#x7C7B;&#x4F8B;&#x5B50;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5EFA;&#x8BAE;&#x5728;&#x8BB8;&#x591A;&#x9886;&#x57DF;&#x90FD;&#x4F1A;&#x63A8;&#x52A8;&#x8FDB;&#x6B65;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4E0D;&#x80FD;&#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x90FD;&#x8FBE;&#x5230;&#x5B8C;&#x7F8E;&#x3002;</p>
</li>
<li><p><strong>&#x539F;&#x5219;&#x7684;&#x4E0D;&#x9002;&#x5F53;&#x5E94;&#x7528;</strong>&#xFF1A;&#x5C06;&#x4E00;&#x822C;&#x539F;&#x5219;&#x5E94;&#x7528;&#x4E8E;&#x5177;&#x4F53;&#x4E8B;&#x4F8B;&#x901A;&#x5E38;&#x5F88;&#x56F0;&#x96BE;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4E0D;&#x4E0E;&#x5176;&#x4ED6;&#x539F;&#x5219;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x6298;&#x4E2D;&#xFF0C;&#x5C31;&#x53BB;&#x4E25;&#x683C;&#x5E94;&#x7528;&#x67D0;&#x9879;&#x539F;&#x5219;&#x3002;&#x6298;&#x4E2D;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x662F;&#x300A;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x5316;&#x300B;&#x4E00;&#x4E66; [Stroustrup 1994] &#x5C06;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x79F0;&#x4E3A;&#x201C;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x201D;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x7ECF;&#x9A8C;&#x57FA;&#x7840;&#x5C31;&#x51ED;&#x7A7A;&#x5192;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x63D0;&#x6848;&#x4E25;&#x683C;&#x9075;&#x5FAA;&#x4E86;&#x67D0;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x63D0;&#x6848;&#x5219;&#x5FFD;&#x7565;&#x5B83;&#x3002;&#x6709;&#x539F;&#x5219;&#x7684;&#x8BBE;&#x8BA1;&#x5F88;&#x56F0;&#x96BE;&#xFF1B;&#x5B83;&#x9700;&#x8981;&#x54C1;&#x5473;&#x3001;&#x7ECF;&#x9A8C;&#x4EE5;&#x53CA;&#x539F;&#x5219;&#x3002;&#x5B9E;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x4E0D;&#x53EA;&#x662F;&#x4ECE;&#x7B2C;&#x4E00;&#x539F;&#x7406;&#x51FA;&#x53D1;&#x8FDB;&#x884C;&#x6F14;&#x7ECE;&#x7684;&#x7EC3;&#x4E60;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x591A;&#x79CD;&#x539F;&#x5219;&#x4E4B;&#x95F4;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x6743;&#x8861;&#x3002;</p>
</li>
<li><p><strong>&#x503E;&#x5411;&#x4E13;&#x5BB6;&#x7684;&#x504F;&#x89C1;</strong>&#xFF1A;&#x60F3;&#x8C61;&#x522B;&#x4EBA;&#x7684;&#x95EE;&#x9898;&#x603B;&#x662F;&#x56F0;&#x96BE;&#x7684;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x51E0;&#x4E4E;&#x90FD;&#x662F;&#x67D0;&#x65B9;&#x9762;&#x7684;&#x4E13;&#x5BB6;&#x3002;&#x5728;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x662F;&#x5904;&#x7406;&#x6700;&#x7EC6;&#x5FAE;&#x3001;&#x6700;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x5728;&#x201C;&#x5916;&#x9762;&#x201D;&#x7684;&#x6570;&#x5341;&#x4EBF;&#x884C;&#x5E38;&#x89C4; C++ &#x4EE3;&#x7801;&#x4E2D;&#x4E00;&#x822C;&#x4E0D;&#x5E38;&#x89C1;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x4E0D;&#x662F;&#x5927;&#x591A;&#x6570; C++ &#x7A0B;&#x5E8F;&#x5458;&#x6240;&#x82E6;&#x607C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x59D4;&#x5458;&#x4F1A;&#x6765;&#x8BF4;&#xFF0C;&#x4E13;&#x5BB6;&#x7EA7;&#x7684;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x5C31;&#x662F;&#x7D27;&#x6025;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x901A;&#x8FC7;&#x6D41;&#x7A0B;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;&#x652F;&#x6301; <code>enable_if</code> &#x548C;&#x7C7B;&#x578B;&#x7279;&#x5F81;&#xFF08;<a href="04.html#451-&#x5B9E;&#x73B0;&#x6280;&#x5DE7;">&#xA7;4.5.1</a>&#xFF09;&#x5728;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x7684;&#x4F7F;&#x7528;&#x7B80;&#x76F4;&#x6C34;&#x5230;&#x6E20;&#x6210;&#xFF0C;&#x4F46;&#x63A5;&#x53D7;&#x6982;&#x5FF5;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x5374;&#x5927;&#x8D39;&#x5468;&#x7AE0;&#x3002;</p>
</li>
<li><p><strong>&#x806A;&#x660E;&#x7684;&#x95EE;&#x9898;</strong>&#xFF1A;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x4E00;&#x822C;&#x662F;&#x806A;&#x660E;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E2D;&#x8BB8;&#x591A;&#x4EBA;&#x65E0;&#x6CD5;&#x62B5;&#x5FA1;&#x673A;&#x7075;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x5F88;&#x96BE;&#x65AD;&#x5B9A;&#xFF0C;&#x5E76;&#x975E;&#x6BCF;&#x4E2A;&#x95EE;&#x9898;&#x90FD;&#x503C;&#x5F97;&#x89E3;&#x51B3;&#xFF0C;&#x800C;&#x62E5;&#x6709;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E5F;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x7EB3;&#x5165;&#x6807;&#x51C6;&#x3002;&#x8FD9;&#x4F1A;&#x5E26;&#x6765;&#x8FC7;&#x4E8E;&#x7CBE;&#x5DE7;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5E26;&#x6765;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x7528;&#x4E0D;&#x7740;&#x7684;&#x7279;&#x6027;&#x3002;&#x516C;&#x5E73;&#x8D77;&#x89C1;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x6307;&#x51FA;&#xFF0C;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x5F88;&#x806A;&#x660E;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x4EE5;&#x4F7F;&#x7528;&#x8FC7;&#x5206;&#x673A;&#x7075;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x6807;&#x51C6;&#x5E93;&#x7279;&#x6027;&#x4E3A;&#x4E50;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;&#x5728;&#x6709;&#x4E9B;&#x63D0;&#x6848;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x7B80;&#x5355;&#x7528;&#x6CD5;&#x4E5F;&#x9700;&#x8981;&#x7528;&#x4E0A;&#x4E25;&#x8083;&#x7684;&#x6A21;&#x677F;&#x5143;&#x7F16;&#x7A0B;&#x3002;</p>
</li>
<li><p><strong>&#x4E0D;&#x613F;&#x59A5;&#x534F;</strong>&#xFF1A;&#x5927;&#x591A;&#x6570;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x90FD;&#x6709;&#x5F3A;&#x70C8;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x4F46;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x56E2;&#x4F53;&#x4E2D;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x9700;&#x8981;&#x59A5;&#x534F;&#x3002;&#x5206;&#x8FA8;&#x54EA;&#x4E9B;&#x59A5;&#x534F;&#x65E0;&#x5173;&#x7D27;&#x8981;&#xFF0C;&#x800C;&#x54EA;&#x4E9B;&#x59A5;&#x534F;&#x4E8B;&#x5173;&#x57FA;&#x672C;&#x539F;&#x5219;&#xFF0C;&#x6709;&#x65F6;&#x4F1A;&#x5F88;&#x56F0;&#x96BE;&#x3002;&#x540E;&#x4E00;&#x7C7B;&#x59A5;&#x534F;&#x53EF;&#x80FD;&#x5BF9;&#x8BED;&#x8A00;&#x9020;&#x6210;&#x7834;&#x574F;&#xFF0C;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x59D4;&#x5458;&#x4EEC;&#x575A;&#x4FE1;&#x81EA;&#x5DF1;&#x6240;&#x62C5;&#x5FE7;&#x7684;&#x624D;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x6BD4;&#x8D77;&#x5FC3;&#x6001;&#x5F00;&#x653E;&#x7684;&#x59D4;&#x5458;&#x5C31;&#x6709;&#x4E86;&#x6709;&#x5173;&#x952E;&#x7684;&#x6218;&#x672F;&#x4F18;&#x52BF;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x80FD;&#x505A;&#x5230;&#x4ECE;&#x6574;&#x4F53;&#x4E0A;&#x5173;&#x6CE8;&#x8BED;&#x8A00;&#x800C;&#x4E0D;&#x7EA0;&#x7ED3;&#x4E8E;&#x4E2A;&#x522B;&#x8BDD;&#x9898;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x5F80;&#x5F80;&#x5F97;&#x5411;&#x4E0D;&#x80FD;&#x5982;&#x6B64;&#x7684;&#x4EBA;&#x4EEC;&#x5C48;&#x670D;&#x3002;&#x800C;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x90A3;&#x4E9B;&#x4ECE;&#x4E0D;&#x8BA4;&#x771F;&#x8D28;&#x7591;&#x81EA;&#x5DF1;&#x7684;&#x539F;&#x5219;&#x6216;&#x9700;&#x6C42;&#x7684;&#x4EBA;&#xFF0C;&#x5012;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x5411;&#x522B;&#x4EBA;&#x89C6;&#x4E3A;&#x5FC5;&#x8981;&#x7684;&#x6280;&#x672F;&#x59A5;&#x534F;&#x53D1;&#x52A8;&#x731B;&#x653B;&#x3002;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x6574;&#x4E2A;&#x793E;&#x533A;&#xFF0C;&#x6709;&#x81EA;&#x77E5;&#x4E4B;&#x660E;&#xFF0C;&#x5E76;&#x61C2;&#x5F97;&#x9002;&#x5F53;&#x7684;&#x8C26;&#x900A; [Stroustrup 2019b]&#x3002;</p>
</li>
<li><p><strong>&#x7F3A;&#x4E4F;&#x4F18;&#x5148;&#x7EA7;</strong>&#xFF1A;&#x4ECE;&#x6280;&#x672F;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6240;&#x6709;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x5E73;&#x7B49;&#x7684;&#xFF1A;&#x4E0D;&#x7CBE;&#x786E;&#x7684;&#x89C4;&#x8303;&#x5C31;&#x662F;&#x4E0D;&#x7CBE;&#x786E;&#x7684;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E0E;&#x5B83;&#x672A;&#x80FD;&#x6B63;&#x786E;&#x89C4;&#x5B9A;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4EC0;&#x4E48;&#x4E0D;&#x76F8;&#x5E72;&#x3002;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x4ECE;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x6F0F;&#x6D1E;&#x4E2D;&#x6DF7;&#x8FDB;&#x4EE3;&#x7801;&#x7684;&#x9519;&#x8BEF;&#x539F;&#x5219;&#x4E0A;&#x90FD;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x6B7B;&#x4EA1;&#x548C;&#x6BC1;&#x706D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x4E0D;&#x540C;&#x9519;&#x8BEF;&#x7684;&#x5F71;&#x54CD;&#x53EF;&#x80FD;&#x5927;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6666;&#x6DA9;&#x7684;&#x7EC6;&#x8282;&#x57FA;&#x672C;&#x4E0A;&#x6CA1;&#x6709;&#x7834;&#x73AF;&#x6027;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x5728;&#x7814;&#x7A76;&#x8BBE;&#x8BA1;&#x7EC6;&#x8282;&#x65F6;&#x5F88;&#x96BE;&#x8BB0;&#x4F4F;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;&#x5728;&#x6570;&#x5B57;&#x5206;&#x9694;&#x7B26;&#xFF08;<a href="05.html#51-&#x6570;&#x5B57;&#x5206;&#x9694;&#x7B26;">&#xA7;5.1</a>&#xFF09;&#x4E0A;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x5728;&#x8303;&#x56F4; <code>for</code>&#xFF08;<a href="04.html#422-&#x8303;&#x56F4;-for">&#xA7;4.2.2</a>&#xFF09;&#x4E0A;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x66F4;&#x591A;&#x3002;</p>
</li>
<li><p><strong>&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x9884;&#x671F;&#x4F1A;&#x88AB;&#x51E0;&#x767E;&#x4E07;&#x4EBA;&#x7528;&#x5230;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x7A33;&#x5B9A;&#x6570;&#x5341;&#x5E74;&#x3002;&#x4EBA;&#x4EEC;&#x81EA;&#x7136;&#x5E0C;&#x671B;&#x5B83;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x3002;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x7279;&#x6027;&#x81A8;&#x80C0;&#xFF08;&#x7279;&#x6027;&#x8FC7;&#x591A;&#xFF09;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5BFC;&#x81F4;&#x5355;&#x4E2A;&#x7279;&#x6027;&#x7684;&#x81A8;&#x80C0;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x5584;&#x4E8E;&#x60F3;&#x8C61;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x7279;&#x6027;&#x5728;&#x59D4;&#x5458;&#x4F1A;&#x8D70;&#x6D41;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x59D4;&#x5458;&#x4EEC;&#x4F1A;&#x575A;&#x6301;&#x8981;&#x5B83;&#x89E3;&#x51B3;&#x6389;&#x6240;&#x6709;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x4E25;&#x91CD;&#x7684;&#x4F7F;&#x547D;&#x504F;&#x79BB;&#xFF0C;&#x5E76;&#x5BFC;&#x81F4;&#x53EA;&#x6709;&#x4E13;&#x5BB6;&#x624D;&#x4F1A;&#x559C;&#x7231;&#x7684;&#x7279;&#x6027;&#x3002;&#x8FD9;&#x4E5F;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7279;&#x6027;&#x4E00;&#x76F4;&#x65E0;&#x6CD5;&#x52A0;&#x5165;&#x6807;&#x51C6;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;<code>.</code> &#x8FD0;&#x7B97;&#x7B26;&#xFF08;<a href="08.html#882-&#x70B9;&#x8FD0;&#x7B97;&#x7B26;">&#xA7;8.8.2</a>&#xFF09;&#x3001;&#x7F51;&#x7EDC;&#x5E93;&#xFF08;<a href="08.html#881-&#x7F51;&#x7EDC;&#x5E93;">&#xA7;8.8.1</a>&#xFF09;&#x548C;&#x5F02;&#x5E38;&#x89C4;&#x7EA6;&#xFF08;<a href="04.html#453-noexcept-&#x89C4;&#x7EA6;">&#xA7;4.5.3</a>&#xFF09;&#x3002;</p>
</li>
<li><p><strong>&#x5C11;&#x6570;&#x4EBA;&#x7684;&#x963B;&#x6320;</strong>&#xFF1A;&#x5171;&#x8BC6;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x9632;&#x6B62;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x66B4;&#x653F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x5F88;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x4E2A;&#x4EBA;&#x548C;&#x5C0F;&#x56E2;&#x4F53;&#x7684;&#x963B;&#x6320;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x662F;&#x597D;&#x4E8B;&#xFF08;&#x907F;&#x514D;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x5B83;&#x5728;&#x63D0;&#x6848;&#x6D41;&#x7A0B;&#x7684;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x4E00;&#x518D;&#x53D1;&#x751F;&#xFF0C;&#x6216;&#x6B63;&#x597D;&#x5728;&#x6700;&#x540E;&#x4E00;&#x523B;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x5177;&#x6709;&#x7834;&#x574F;&#x6027;&#x4E86;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;<code>constexpr</code>&#xFF08;<a href="04.html#427-constexpr-&#x51FD;&#x6570;">&#xA7;4.2.7</a>&#xFF09;&#x3001;<code>.</code> &#x8FD0;&#x7B97;&#x7B26;&#xFF08;<a href="08.html#882-&#x70B9;&#x8FD0;&#x7B97;&#x7B26;">&#xA7;8.8.2</a>&#xFF09;&#x3001;&#x6A21;&#x5757;&#xFF08;<a href="09.html#931-&#x6A21;&#x5757;">&#xA7;9.3.1</a>&#xFF09;&#x548C;&#x534F;&#x7A0B;&#xFF08;<a href="09.html#932-&#x534F;&#x7A0B;">&#xA7;9.3.2</a>&#xFF09;&#x3002;</p>
</li>
<li><p><strong>&#x5185;&#x805A;&#x7684;&#x56E2;&#x4F53;</strong>&#xFF1A;&#x8BB8;&#x591A;&#x5DE5;&#x4F5C;&#x7EC4;&#x548C;&#x7814;&#x7A76;&#x7EC4;&#x90FD;&#x62E5;&#x6709;&#x7A33;&#x5B9A;&#x7684;&#x6838;&#x5FC3;&#x4EBA;&#x5458;&#x7FA4;&#x4F53;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#x4ED6;&#x4EEC;&#x5F62;&#x6210;&#x4E86;&#x5185;&#x805A;&#x7684;&#x6280;&#x672F;&#x89C2;&#x3001;&#x5171;&#x4EAB;&#x7684;&#x8BCD;&#x6C47;&#x8868;&#x548C;&#x7279;&#x5B9A;&#x7684;&#x8FD0;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4F1A;&#x4F7F;&#x201C;&#x5916;&#x90E8;&#x4EBA;&#x5458;&#x201D;&#x96BE;&#x4EE5;&#x4EA4;&#x6D41;&#x548C;&#x8D21;&#x732E;&#x3002;&#x8FD9;&#x4E5F;&#x53EF;&#x80FD;&#x4F7F;&#x8BBE;&#x8BA1;&#x8DE8;&#x8D8A; WG &#x8FB9;&#x754C;&#x7684;&#x7279;&#x6027;&#xFF08;&#x4F8B;&#x5982;&#x540C;&#x65F6;&#x5177;&#x6709;&#x5E93;&#x548C;&#x8BED;&#x8A00;&#x90E8;&#x5206;&#x7684;&#x7279;&#x6027;&#xFF09;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x3002;&#x6BCF;&#x4E2A;&#x5C0F;&#x7EC4;&#x90FD;&#x5F80;&#x5F80;&#x4F1A;&#x8BBE;&#x8BA1;&#x51FA;&#x9002;&#x5408;&#x5176;&#x81EA;&#x8EAB;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x9886;&#x57DF;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x518D;&#x6B21;&#x5370;&#x8BC1;&#x4E86;&#x8001;&#x683C;&#x8A00;&#xFF0C;&#x5373;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x603B;&#x662F;&#x957F;&#x5F97;&#x50CF;&#x521B;&#x9020;&#x5B83;&#x7684;&#x7EC4;&#x7EC7;&#x7684;&#x7ED3;&#x6784;&#x3002;</p>
<p>  &#x4F8B;&#x5B50;&#xFF1A;&#x8303;&#x56F4; <code>for</code>&#xFF08;<a href="04.html#422-&#x8303;&#x56F4;-for">&#xA7;4.2.2</a>&#xFF09;&#x548C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x6539;&#x8BED;&#x8A00;&#x7684;&#x5E76;&#x53D1;&#x673A;&#x5236;&#xFF08;<a href="04.html#413-&#x671F;&#x503C;future">&#xA7;4.1.3</a>&#xFF09;&#x3002;<code>any</code>&#x3001;<code>optional</code> &#x548C; <code>variant</code>&#xFF08;<a href="08.html#83-variantoptional-&#x548C;-any">&#xA7;8.3</a>&#xFF09;&#x7684;&#x63A5;&#x53E3;&#x5DEE;&#x5F02;&#x3002;</p>
</li>
</ul>
<p>&#x4ECE;&#x79EF;&#x6781;&#x7684;&#x4E00;&#x9762;&#x6765;&#x770B;&#xFF0C;&#x57FA;&#x4E8E;&#x4E2A;&#x4EBA;&#x654C;&#x610F;&#x6216;&#x9488;&#x950B;&#x76F8;&#x5BF9;&#x7684;&#x884C;&#x4E3A;&#x975E;&#x5E38;&#x7F55;&#x89C1;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x662F;&#x975E;&#x5E38;&#x4E13;&#x4E1A;&#x7684;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5E76;&#x975E;&#x6BCF;&#x4E2A;&#x63D0;&#x6848;&#x90FD;&#x53D7;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x73B0;&#x8C61;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5E76;&#x4E14;&#x5927;&#x591A;&#x6570;&#x5176;&#x4ED6;&#x5927;&#x578B;&#x9879;&#x76EE;&#x4E5F;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4EE5;&#x5176; ISO &#x6807;&#x51C6;&#x6240;&#x4EE3;&#x8868;&#x7684; C++ &#x8BED;&#x8A00;&#xFF0C;&#x6574;&#x4F53;&#x4E0A;&#x53CD;&#x6620;&#x51FA;&#x4E86;&#x8FD9;&#x4E9B;&#x73B0;&#x8C61;&#x3002;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x65B0;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x81EA; C++11 &#x8D77;&#x51FA;&#x73B0;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x6211;&#x6000;&#x7591;&#x5B83;&#x4EEC;&#x662F;&#x7531;&#x4EE5;&#x4E0B;&#x56E0;&#x7D20;&#x5171;&#x540C;&#x9020;&#x6210;&#x7684;</p>
<ul>
<li>&#x59D4;&#x5458;&#x4F1A;&#x4EBA;&#x6570;&#x589E;&#x52A0;</li>
<li>&#x65B0;&#x4EBA;&#x7684;&#x6D8C;&#x5165;</li>
<li>&#x6210;&#x5458;&#x7684;&#x4E13;&#x4E1A;&#x5316;&#xFF08;&#x5206;&#x6563;&#x5316;&#xFF09;</li>
<li>&#x6210;&#x5458;&#x5BF9; C++ &#x5386;&#x53F2;&#x7684;&#x4E86;&#x89E3;&#x6709;&#x6240;&#x51CF;&#x5C11;</li>
</ul>
<p>&#x5C3D;&#x7BA1;&#x5B58;&#x5728;&#x8FD9;&#x4E9B;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x6807;&#x51C6;&#x5236;&#x5B9A;&#x6D41;&#x7A0B;&#x4ECD;&#x5C61;&#x5C61;&#x6210;&#x529F;&#xFF0C;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x65AD;&#x52AA;&#x529B;&#x5C06;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x964D;&#x5230;&#x6700;&#x4F4E;&#x3002;&#x65B9;&#x5411;&#x7EC4;&#xFF08;Direction Group&#xFF09;&#x7684;&#x5EFA;&#x7ACB;&#x5C31;&#x662F;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x52AA;&#x529B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;<a href="#32-&#x7EC4;&#x7EC7;">&#xA7;3.2</a>&#xFF09;[Dawes et al. 2018; Stroustrup 2018d]&#x3002;&#x53E6;&#x89C1;&#xFF08;<a href="11.html#114-&#x6559;&#x8BAD;">&#xA7;11.4</a>&#xFF09;&#x3002;&#x5DE5;&#x4F5C;&#x7EC4;&#x4E3B;&#x5E2D;&#x3001;&#x7B14;&#x8BB0;&#x8BB0;&#x5F55;&#x5458;&#x3001;&#x4F1A;&#x8BAE;&#x7EC4;&#x7EC7;&#x8005;&#x548C;&#x7F16;&#x8F91;&#x7EC4;&#x7684;&#x4E0D;&#x61C8;&#x52AA;&#x529B;&#x662F;&#x65E0;&#x5F62;&#x7684;&#xFF0C;&#x4F46;&#x5374;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Jens Maurer &#x6570;&#x5341;&#x5E74;&#x6765;&#x4E00;&#x76F4;&#x5728; CWG &#x4E2D;&#x505A;&#x7B14;&#x8BB0;&#xFF0C;&#x5E2E;&#x52A9;&#x63D0;&#x6848;&#x8005;&#x7F16;&#x5199;&#x6807;&#x51C6;&#x6587;&#x672C;&#xFF0C;&#x5B89;&#x6392;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#xFF0C;&#x4E3A;&#x65E0;&#x6CD5;&#x51FA;&#x5E2D;&#x7684;&#x6210;&#x5458;&#x5B89;&#x6392;&#x7535;&#x8BDD;&#x63A5;&#x5165;&#xFF0C;&#x5B89;&#x6392;&#x4F1A;&#x8BAE;&#x5BA4;&#xFF0C;&#x544A;&#x77E5;&#x6210;&#x5458;&#x5F53;&#x5730;&#x65C5;&#x884C;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6709;&#x5176;&#x4ED6;&#x65B9;&#x6848;&#x5417;&#xFF1F;&#x5728;&#x7406;&#x60F3;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x6211;&#x4F1A;&#x5EFA;&#x8BAE;&#x9650;&#x5B9A;&#x7531;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF08;&#x5927;&#x7EA6; 5 &#x4EBA;&#xFF09;&#x7684;&#x5168;&#x804C;&#x53D7;&#x4FE1;&#x4EFB;&#x4E13;&#x5BB6;&#x59D4;&#x5458;&#x505A;&#x51B3;&#x5B9A;&#xFF0C;&#x800C;&#x7531;&#x5927;&#x56E2;&#x961F;&#x5B8C;&#x6210;&#xFF08;&#x4F8B;&#x5982;&#x8D85;&#x8FC7; 350 &#x4EBA;&#x7684;&#x59D4;&#x5458;&#x4F1A;&#xFF09;&#x5B8C;&#x6210;&#x8BA8;&#x8BBA;&#x3001;&#x63D0;&#x6848;&#x3001;&#x4EE5;&#x53CA;&#x5927;&#x90E8;&#x5206;&#x6D41;&#x7A0B;&#x3002;&#x4F46;&#x6211;&#x4E0D;&#x8BA4;&#x4E3A; C++ &#x4F1A;&#x53D1;&#x5C55;&#x6210;&#x8FD9;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#xFF1A;</p>
<ul>
<li>&#x6CA1;&#x6709;&#x4EBA;&#x559C;&#x6B22;&#x653E;&#x5F03;&#x6743;&#x529B;&#xFF08;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x6295;&#x7968;&#x6743;&#xFF09;&#x3002;</li>
<li>&#x8981;&#x4E3A;&#x56FA;&#x5B9A;&#x7684;&#x5168;&#x804C;&#x4E13;&#x5BB6;&#x56E2;&#x961F;&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#x7684;&#x8D44;&#x91D1;&#x6295;&#x5165;&#x9700;&#x8981;&#x975E;&#x540C;&#x5C0F;&#x53EF;&#x7684;&#x6280;&#x80FD;&#xFF08;&#x800C;&#x8FD9;&#x79CD;&#x6280;&#x80FD;&#x5728; C++ &#x793E;&#x533A;&#x8FD8;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#xFF09;&#x3002;</li>
<li>&#x6FC0;&#x8FDB;&#x7684;&#x53D8;&#x5316;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x5728;&#x6210;&#x529F;&#x7684;&#x65F6;&#x5019;&#xFF1B;&#x53EA;&#x6709; C++ &#x4F7F;&#x7528;&#x91CF;&#x7684;&#x663E;&#x8457;&#x4E0B;&#x964D;&#x624D;&#x80FD;&#x4FC3;&#x4F7F;&#x59D4;&#x5458;&#x4F1A;&#x8FDB;&#x884C;&#x5267;&#x70C8;&#x7684;&#x7EC4;&#x7EC7;&#x521B;&#x65B0;&#xFF08;&#x5230;&#x90A3;&#x65F6;&#x591A;&#x534A;&#x4E3A;&#x65F6;&#x5DF2;&#x665A;&#xFF09;&#x3002;</li>
</ul>
<p>&#x6211;&#x4E0D;&#x8BA4;&#x4E3A;&#x516C;&#x53F8;&#x63A7;&#x5236;&#x662F;&#x53EF;&#x884C;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#xFF0C;&#x56E0;&#x4E3A;&#xFF1A;</p>
<ul>
<li>&#x516C;&#x53F8;&#x671F;&#x671B;&#x6295;&#x8D44;&#x56DE;&#x62A5;&#x3002;</li>
<li>&#x516C;&#x53F8;&#x7684;&#x652F;&#x6301;&#x5F80;&#x5F80;&#x51E0;&#x5E74;&#x540E;&#x5C31;&#x4F1A;&#x6D88;&#x5931;&#x3002;</li>
<li>&#x516C;&#x53F8;&#x5F80;&#x5F80;&#x9009;&#x62E9;&#x5DEE;&#x5F02;&#x5316;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x60E0;&#x53CA;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x8FDB;&#x6B65;&#x3002;</li>
</ul>
<p>&#x6211;&#x4E5F;&#x4E0D;&#x8BA4;&#x4E3A;&#x5B8C;&#x5168;&#x5F00;&#x653E;&#x7684;&#x5BA1;&#x8BAE;&#x6D41;&#x7A0B;&#xFF08;&#x7531;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4EBA;&#x6295;&#x7968;&#xFF09;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x8D85;&#x8FC7;&#x5343;&#x4EBA;&#x7684;&#x6295;&#x7968;&#x5C31;&#x4F1A;&#x5931;&#x53BB;&#x54C1;&#x5473;&#x3002;</li>
<li>&#x5927;&#x7FA4;&#x4F53;&#x7684;&#x6210;&#x5458;&#x548C;&#x610F;&#x89C1;&#x6CA1;&#x6CD5;&#x5728;&#x51E0;&#x5341;&#x5E74;&#x91CC;&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#x3002;</li>
</ul>
<p>&#x5BF9;&#x8BB8;&#x591A;&#x5927;&#x578B;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#x5206;&#x7EA7;&#x5BA1;&#x6279;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x81F3;&#x5C11;&#x63D0;&#x4F9B;&#x4E86;&#x90E8;&#x5206;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x5728; C &#x548C; C++ &#x7684;&#x6807;&#x51C6;&#x5316;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x7ECF;&#x9A8C;&#x5F88;&#x5C11;&#x3002;&#x5F53;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x826F;&#x597D;&#x65F6;&#xFF0C;&#x4F60;&#x5728;&#x5BA1;&#x6279;&#x5C42;&#x7EA7;&#x4E2D;&#x7684;&#x5730;&#x4F4D;&#x8D8A;&#x9AD8;&#xFF0C;&#x5BA1;&#x6279;&#x8005;&#x7684;&#x77E5;&#x8BC6;&#x57FA;&#x7840;&#x5C31;&#x8D8A;&#x5E7F;&#x9614;&#xFF0C;&#x4ED6;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x9886;&#x57DF;&#x4E5F;&#x5C31;&#x8D8A;&#x5E7F;&#x6CDB;&#x3002;&#x5728;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x9876;&#x90E8;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x627E;&#x5230;&#x4E00;&#x4EBA;&#x6216;&#x591A;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x6240;&#x6709;&#x77E5;&#x8BC6;&#x90FD;&#x6709;&#x6240;&#x4E86;&#x89E3;&#x3001;&#x5BF9;&#x6240;&#x6709;&#x7528;&#x6237;&#x90FD;&#x6709;&#x6240;&#x5173;&#x5FC3;&#x3002;&#x800C;&#x4E0E;&#x6B64;&#x76F8;&#x5BF9;&#x7684;&#x662F;&#xFF0C;&#x63D0;&#x6848;&#x8D8A;&#x63A5;&#x8FD1;&#x6700;&#x7EC8;&#x6279;&#x51C6;&#xFF0C;ISO &#x6D41;&#x7A0B;&#x5C31;&#x8D8A;&#x4F1A;&#x7A00;&#x91CA;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x548C;&#x5173;&#x6CE8;&#x9886;&#x57DF;&#xFF1A;&#x5168;&#x4F53;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF0C;&#x8BB8;&#x591A;&#x59D4;&#x5458;&#x6295;&#x7968;&#x7684;&#x63D0;&#x6848;&#x662F;&#x4ED6;&#x4EEC;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x3001;&#x9886;&#x57DF;&#x7ECF;&#x9A8C;&#x6709;&#x9650;&#x4E14;&#x6CA1;&#x6709;&#x5BC6;&#x5207;&#x5173;&#x6CE8;&#x7684;&#x3002;&#x4EBA;&#x4EEC;&#x52AA;&#x529B;&#x60F3;&#x8D1F;&#x8D77;&#x8D23;&#x4EFB;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x771F;&#x7684;&#x5F88;&#x96BE;&#x3002;&#x8FD8;&#x8981;&#x4ECE;&#x5927;&#x5C40;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x5F85;&#x6BCF;&#x4E2A;&#x63D0;&#x6848;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x4F5C;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x5C31;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x770B;&#x6765;&#xFF0C;WG21 &#x7684;&#x5DE5;&#x4F5C;&#x8FD8;&#x4E0D;&#x7B97;&#x7CDF;&#x7CD5;&#x3002;&#x6211;&#x786E;&#x5B9E;&#x62C5;&#x5FC3;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#x80FD;&#x5426;&#x4F7F; C++ &#x957F;&#x4E45;&#x4FDD;&#x6301;&#x8FDE;&#x8D2F;&#x5E76;&#x4E0E;&#x65F6;&#x4FF1;&#x8FDB;&#x3002;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x51FA;&#x5E2D; C++ &#x6807;&#x51C6;&#x4F1A;&#x8BAE;&#x7684;&#x6709; 200 &#x591A;&#x4EBA;&#xFF0C;&#x6BD4;&#x5176;&#x4ED6;&#x6807;&#x51C6;&#x7684;&#x56E2;&#x4F53;&#x8981;&#x5927;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x800C; ISO &#x7684;&#x6D41;&#x7A0B;&#x672C;&#x6765;&#x5C31;&#x662F;&#x4E3A;&#x90A3;&#x79CD;&#x8F83;&#x5C0F;&#x7684;&#x56E2;&#x4F53;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x59D4;&#x5458;&#x7684;&#x591A;&#x6837;&#x6027;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x4E86;&#x8FC7;&#x53BB;&#x7684;&#x8001;&#x4E09;&#x6837;&#xFF1A;&#x5934;&#x53D1;&#x6591;&#x767D;&#x7684;&#x4E13;&#x5BB6;&#x3001;&#x516C;&#x53F8;&#x4EE3;&#x8868;&#x3001;&#x4EE5;&#x53CA;&#x56FD;&#x5BB6;&#x673A;&#x6784;&#x4EE3;&#x8868;&#x3002;&#x6DF7;&#x4E71;&#x6709;&#x53EF;&#x80FD;&#x7206;&#x53D1;&#x3002;</p>
<p>&#x6211;&#x4ECE;&#x6E29;&#x65AF;&#x987F;&#xB7;&#x4E18;&#x5409;&#x5C14;&#x7684;&#x683C;&#x8A00;&#x4E2D;&#x5F97;&#x5230;&#x4E9B;&#x8BB8;&#x5B89;&#x6170;&#xFF0C;&#x201C;&#x6C11;&#x4E3B;&#x662F;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x653F;&#x5E9C;&#x5F62;&#x5F0F;&#xFF0C;&#x9664;&#x4E86;&#x6240;&#x6709;&#x90A3;&#x4E9B;&#x4EBA;&#x7C7B;&#x4E00;&#x518D;&#x5C1D;&#x8BD5;&#x8FC7;&#x7684;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x201D;&#x3002;</p>
<p>&#x7279;&#x522B;&#x8981;&#x6307;&#x51FA;&#xFF0C;&#x6211;&#x4E0D;&#x8BA4;&#x4E3A;&#x7ECF;&#x5E38;&#x88AB;&#x5EFA;&#x8BAE;&#x7684;&#x201C;&#x4EC1;&#x6148;&#x7684;&#x7EC8;&#x8EAB;&#x72EC;&#x88C1;&#x8005;&#x201D;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x89C4;&#x6A21;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x8BF4;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x4ECE;&#x6765;&#x5C31;&#x6CA1;&#x5BF9; C++ &#x9002;&#x7528;&#x8FC7;&#x3002;</p>
<p>&#x5728;&#x6211;&#x5FC3;&#x76EE;&#x4E2D;&#xFF0C;&#x542F;&#x52A8;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x9879;&#x76EE;&#x7684;&#x7406;&#x60F3;&#x6A21;&#x5F0F;&#x662F;&#x5355;&#x4E2A;&#x4EBA;&#x6216;&#x4E00;&#x5C0F;&#x7FA4;&#x5BC6;&#x5207;&#x914D;&#x5408;&#x7684;&#x670B;&#x53CB;&#x3002;&#x4F46;&#x6211;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x89C4;&#x6A21;&#x5316;&#x3002;&#x4E00;&#x95E8;&#x6210;&#x719F;&#x7684;&#x8BED;&#x8A00;&#x9700;&#x8981;&#x6570;&#x5341;&#x751A;&#x81F3;&#x6570;&#x767E;&#x4E2A;&#x4EBA;&#x6765;&#x89E3;&#x51B3;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x9762;&#x5BF9;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x3002;&#x5373;&#x4F7F;&#x53EA;&#x662F;&#x4E0E;&#x76F8;&#x5173;&#x7684;&#x6807;&#x51C6;&#x3001;&#x884C;&#x4E1A;&#x7EC4;&#x7EC7;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#xFF0C;&#x4E5F;&#x4F1A;&#x8BA9;&#x4E00;&#x4E2A;&#x5C0F;&#x89C4;&#x6A21;&#x3001;&#x7D27;&#x5BC6;&#x914D;&#x5408;&#x7684;&#x56E2;&#x4F53;&#x5F7B;&#x5E95;&#x5E94;&#x63A5;&#x4E0D;&#x6687;&#x3002;</p>
<h2 id="34-&#x63D0;&#x6848;&#x68C0;&#x67E5;&#x6E05;&#x5355;">3.4 &#x63D0;&#x6848;&#x68C0;&#x67E5;&#x6E05;&#x5355;</h2>
<p>C++98 &#x6709;&#x4E2A;&#x201C;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x63D0;&#x6848;&#x201D;&#x7684;&#x6307;&#x5357; [Stroustrup et al. 1992]&#xFF0C;&#x4F46;&#x5947;&#x602A;&#x7684;&#x662F;&#xFF0C;&#x6F14;&#x5316;&#x7EC4;&#x5E76;&#x6CA1;&#x6709;&#x4E3A;&#x63D0;&#x7ED9; C++14&#x3001;C++17 &#x6216; C++20 &#x7684;&#x63D0;&#x6848;&#x51C6;&#x5907;&#x4E00;&#x4EFD;&#x68C0;&#x67E5;&#x6E05;&#x5355;&#x3002;&#x6709;&#x4E00;&#x4EFD;&#x9488;&#x5BF9;&#x6807;&#x51C6;&#x5E93;&#x63D0;&#x6848;&#x7684;&#x68C0;&#x67E5;&#x6E05;&#x5355; [Meredith 2012]&#x3002;&#x5BF9;&#x4E8E; C++20&#xFF0C;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x673A;&#x6784;&#x8D1F;&#x8D23;&#x4EBA;&#x7684;&#x4E00;&#x4EFD;&#x8BF4;&#x660E; [van Winkel et al. 2017] &#x548C; Direction Group &#x7684;&#x4E00;&#x4EFD;&#x6587;&#x4EF6; [Hinnant et al. 2019] &#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6307;&#x5BFC;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x77ED;&#x800C;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x95EE;&#x9898;&#x6E05;&#x5355;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x51E0;&#x4E4E;&#x603B;&#x4F1A;&#x88AB;&#x63D0;&#x7ED9;&#x4E00;&#x9879;&#x63D0;&#x6848;&#xFF1A;</p>
<ul>
<li>&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5C06;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF1F;&#x65B0;&#x624B;&#xFF1F;&#x4E13;&#x5BB6;&#xFF1F;</li>
<li>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x9610;&#x660E;&#x5B83;&#x6240;&#x57FA;&#x4E8E;&#x7684;&#x539F;&#x5219;&#x3002;&#x7ED9;&#x51FA;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528;&#x6848;&#x4F8B;&#x548C;&#x4E13;&#x5BB6;&#x7EA7;&#x7684;&#x4F7F;&#x7528;&#x6848;&#x4F8B;&#x3002;</li>
<li>&#x6709;&#x54EA;&#x4E9B;&#x66FF;&#x4EE3;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1F;&#x5E93;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5426;&#x8DB3;&#x591F;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x73B0;&#x6709;&#x529F;&#x80FD;&#x4E0D;&#x591F;&#x597D;&#xFF1F;</li>
<li>&#x4E3A;&#x4EC0;&#x4E48;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x9700;&#x8981;&#x5728;&#x6807;&#x51C6;&#x4E2D;&#xFF1F;</li>
<li>&#x91C7;&#x7528;&#x8BE5;&#x6280;&#x672F;&#x5B58;&#x5728;&#x54EA;&#x4E9B;&#x969C;&#x788D;&#xFF1F;&#x4ECE;&#x73B0;&#x6709;&#x7684;&#x6280;&#x672F;&#x8FC7;&#x6E21;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x591A;&#x4E45;&#xFF1F;</li>
<li>&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x5417;&#xFF1F;&#x5728;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x6216;&#x9884;&#x671F;&#x4F1A;&#x9047;&#x5230;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF1F;&#x6709;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x5417;&#xFF1F;</li>
<li>&#x4F1A;&#x4E0D;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x7F16;&#x8BD1;&#x671F;&#x5F00;&#x9500;&#xFF1F;</li>
<li>&#x8BE5;&#x7279;&#x6027;&#x662F;&#x5426;&#x80FD;&#x878D;&#x5165;&#x5230;&#x73B0;&#x6709;&#x5DE5;&#x5177;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x6846;&#x67B6;&#x4E2D;&#xFF1F;</li>
<li>&#x4E0E;&#x53D8;&#x901A;&#x65B9;&#x6848;&#x76F8;&#x6BD4;&#xFF0C;&#x4F1A;&#x6709;&#x8FD0;&#x884C;&#x671F;&#x5F00;&#x9500;&#x5417;&#xFF1F;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#xFF1F;&#x5728;&#x7A7A;&#x95F4;&#x4E0A;&#xFF1F;</li>
<li>&#x4F1A;&#x6709;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x5417;&#xFF1F;&#x4F1A;&#x7834;&#x574F;&#x73B0;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x5417;&#xFF1F;ABI &#x4F1A;&#x88AB;&#x7834;&#x574F;&#x5417;&#xFF1F;</li>
<li>&#x65B0;&#x529F;&#x80FD;&#x5C06;&#x5982;&#x4F55;&#x4E0E;&#x73B0;&#x6709;&#x529F;&#x80FD;&#x548C;&#x5176;&#x4ED6;&#x65B0;&#x529F;&#x80FD;&#x4EA4;&#x4E92;&#xFF1F;</li>
<li>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5426;&#x5BB9;&#x6613;&#x6559;&#x6388;&#xFF1F;&#x6559;&#x7ED9;&#x8C01;&#xFF1F;&#x8C01;&#x6765;&#x6559;&#xFF1F;</li>
<li>&#x6807;&#x51C6;&#x5E93;&#x4F1A;&#x53D7;&#x5230;&#x600E;&#x6837;&#x7684;&#x5F71;&#x54CD;&#xFF1F;</li>
<li>&#x8BE5;&#x63D0;&#x6848;&#x662F;&#x5426;&#x4F1A;&#x5BFC;&#x81F4;&#x5BF9;&#x672A;&#x6765;&#x6807;&#x51C6;&#x8FDB;&#x4E00;&#x6B65;&#x6269;&#x5C55;&#x7684;&#x8981;&#x6C42;&#xFF1F;</li>
<li>&#x8BE5;&#x7279;&#x6027;&#x5728;&#x6807;&#x51C6;&#x91CC;&#x5982;&#x4F55;&#x63AA;&#x8F9E;&#x8868;&#x8FBE;&#xFF1F;</li>
<li>&#x7528;&#x6237;&#x5728;&#x4F7F;&#x7528;&#x65B0;&#x529F;&#x80FD;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x72AF;&#x54EA;&#x4E9B;&#x9519;&#x8BEF;&#xFF1F;</li>
<li>&#x5C31;&#x6574;&#x4E2A; C++ &#x793E;&#x533A;&#x7684;&#x5229;&#x76CA;&#x800C;&#x8A00;&#xFF0C;&#x8BE5;&#x63D0;&#x6848;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x524D; 20 &#x540D;&#xFF1F;&#x524D; 10&#xFF1F;</li>
<li>&#x8BE5;&#x63D0;&#x6848;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x7279;&#x5B9A;&#x5B50;&#x793E;&#x533A;&#x7684;&#x524D;&#x4E09;&#x540D;&#xFF1F;&#x54EA;&#x4E2A;&#x5B50;&#x793E;&#x533A;&#xFF1F;</li>
<li>&#x8BE5;&#x63D0;&#x6848;&#x662F;&#x89E3;&#x51B3;&#x67D0;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x901A;&#x7528;&#x673A;&#x5236;&#x8FD8;&#x662F;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x7684;&#x7279;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x9488;&#x5BF9;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x54EA;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#xFF1F;</li>
<li>&#x8BE5;&#x63D0;&#x6848;&#x5728;&#x8BED;&#x4E49;&#x3001;&#x8BED;&#x6CD5;&#x548C;&#x547D;&#x540D;&#x65B9;&#x9762;&#x662F;&#x5426;&#x4E0E;&#x8BED;&#x8A00;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E00;&#x81F4;&#xFF1F;</li>
</ul>
<p>&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x4E00;&#x9879;&#x63D0;&#x6848;&#x80FD;&#x591F;&#x56DE;&#x7B54;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x591A;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5728;&#x6700;&#x521D;&#x7684;&#x63D0;&#x6848;&#x4E2D;&#xFF0C;&#x7406;&#x7531;&#x5F80;&#x5F80;&#x975E;&#x5E38;&#x8584;&#x5F31;&#xFF0C;&#x56E0;&#x4E3A;&#x63D0;&#x6848;&#x8005;&#x8BA4;&#x4E3A;&#x6240;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#x7684;&#x91CD;&#x8981;&#x6027;&#x548C;&#x4ED6;&#x4EEC;&#x5EFA;&#x8BAE;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x975E;&#x5E38;&#x660E;&#x663E;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x8BBA;&#x6587;&#x3001;&#x4FEE;&#x6539;&#x3001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x8BA8;&#x8BBA;&#x548C;&#x6F14;&#x5316;&#x7EC4;&#x7684;&#x9762;&#x5BF9;&#x9762;&#x8BA8;&#x8BBA;&#x901A;&#x5E38;&#x90FD;&#x4F1A;&#x6D89;&#x53CA;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5F88;&#x5C11;&#x5BF9;&#x5404;&#x4E2A;&#x63D0;&#x6848;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x7684;&#x6216;&#x4E00;&#x81F4;&#x7684;&#x68C0;&#x67E5;&#x3002;&#x6210;&#x5458;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x5173;&#x6CE8;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BED;&#x6CD5;&#x3001;&#x6B67;&#x4E49;&#x3001;&#x4F18;&#x5316;&#x673A;&#x4F1A;&#x548C;&#x547D;&#x540D;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x91CD;&#x65B0;&#x63A2;&#x8BA8;&#x6839;&#x672C;&#x95EE;&#x9898;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x6211;&#x6240;&#x8BA4;&#x4E3A;&#x7684;&#x7CDF;&#x7CD5;&#x7684;&#x63D0;&#x6848;&#x4F1A;&#x6DF7;&#x8FDB;&#x53BB;&#x3002;&#x539F;&#x56E0;&#x901A;&#x5E38;&#x662F;&#x63D0;&#x6848;&#x8005;&#x7684;&#x6781;&#x5927;&#x70ED;&#x60C5;&#x52A0;&#x4E0A;&#x53CD;&#x5BF9;&#x8005;&#x7684;&#x5206;&#x5FC3;&#x3001;&#x793C;&#x8C8C;&#x548C;&#x75B2;&#x60EB; [Stroustrup 2019b]&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="02.html" class="navigation navigation-prev " aria-label="Previous page: 2. 背景：C++ 的 1979–2006">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="04.html" class="navigation navigation-next " aria-label="Next page: 4. C++11：感觉像是门新语言">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3. C++ 标准委员会","level":"1.4","depth":1,"next":{"title":"4. C++11：感觉像是门新语言","level":"1.5","depth":1,"path":"04.md","ref":"04.md","articles":[]},"previous":{"title":"2. 背景：C++ 的 1979–2006","level":"1.3","depth":1,"path":"02.md","ref":"02.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"03.md","mtime":"2023-07-06T11:17:01.971Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-07-06T11:29:00.567Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

