
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>9. C++20：方向之争 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="10.html" />
    
    
    <link rel="prev" href="08.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    1. 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    2. 背景：C++ 的 1979–2006
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    3. C++ 标准委员会
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    4. C++11：感觉像是门新语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    5. C++14：完成 C++11
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    6. 概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    7. 错误处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08.html">
            
                <a href="08.html">
            
                    
                    8. C++17：大海迷航
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="09.html">
            
                <a href="09.html">
            
                    
                    9. C++20：方向之争
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10. 2020 年的 C++
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11. 回顾
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >9. C++20：方向之争</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="9-c20&#xFF1A;&#x65B9;&#x5411;&#x4E4B;&#x4E89;">9. C++20&#xFF1A;&#x65B9;&#x5411;&#x4E4B;&#x4E89;</h1>
<p>&#x7531;&#x8D85;&#x8FC7; 350 &#x540D;&#x6210;&#x5458;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x59D4;&#x5458;&#x4F1A;&#x6765;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x8FDE;&#x8D2F;&#x4E00;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x80CC;&#x666F;&#xFF08;&#x5305;&#x62EC;&#x4E0D;&#x540C;&#x7684;&#x6559;&#x80B2;&#x80CC;&#x666F;&#xFF09;&#xFF0C;&#x4E5F;&#x90FD;&#x5728;&#x5404;&#x81EA;&#x7684;&#x201C;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x201D;&#x4E2D;&#x627F;&#x53D7;&#x4E0D;&#x540C;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x81EA;&#x7136;&#x4F1A;&#x5728;&#x65B9;&#x5411;&#x4E0A;&#x3001;&#x4F18;&#x5148;&#x7EA7;&#x4E0A;&#x548C;&#x59D4;&#x5458;&#x4F1A;&#x7A0B;&#x5E8F;&#x4E0A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x89C1;&#x89E3;&#x3002;&#x7C97;&#x7565;&#x4F30;&#x7B97;&#x4E00;&#x4E0B;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x63D0;&#x6848;&#xFF0C;&#x5927;&#x6982;&#x90FD;&#x6709;&#x5341;&#x591A;&#x4F4D;&#x6210;&#x5458;&#x4F1A;&#x5F3A;&#x70C8;&#x53CD;&#x5BF9;&#x5176;&#x4E2D;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;&#x8003;&#x8651;&#x5230; WG21 &#x5E0C;&#x671B;&#x540C;&#x610F;&#x4EBA;&#x6570;&#x8FBE;&#x5230; 80% &#x6216; 90% &#x624D;&#x5BA3;&#x544A;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#xFF0C;C++ &#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;&#x6210;&#x529F;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x3002;</p>
<h2 id="91-&#x8BBE;&#x8BA1;&#x539F;&#x5219;">9.1 &#x8BBE;&#x8BA1;&#x539F;&#x5219;</h2>
<p>C++ &#x60F3;&#x53D1;&#x5C55;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#xFF1F;&#x6216;&#x8005;&#x8BF4;&#xFF0C;WG21 &#x5BF9;&#x4E8E;&#x5B83;&#x5728;&#x52AA;&#x529B;&#x505A;&#x4EC0;&#x4E48;&#x6709;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x89C2;&#x70B9;&#x4E48;&#xFF1F;&#x6211;&#x8BA4;&#x4E3A;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#x3002;&#x6BCF;&#x4F4D;&#x6210;&#x5458;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x90FD;&#x6709;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x65E2;&#x88AB;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x8DB3;&#x591F;&#x5177;&#x4F53;&#x5230;&#x53EF;&#x4EE5;&#x6307;&#x5BFC;&#x5B9E;&#x9645;&#x7684;&#x8BA8;&#x8BBA;&#x548C;&#x51B3;&#x7B56;&#x3002;</p>
<p>ISO C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x65E2;&#x6CA1;&#x6709;&#x4E00;&#x7EC4;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x8BA4;&#x53EF;&#x7684;&#x8BBE;&#x8BA1;&#x6807;&#x51C6;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4E00;&#x7EC4;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x8BA4;&#x53EF;&#x7684;&#x91C7;&#x7EB3;&#x67D0;&#x4E2A;&#x7279;&#x6027;&#x7684;&#x6807;&#x51C6;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x7F3A;&#x5C11;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x5C1D;&#x8BD5;&#x3002;&#x6211;&#x66FE;&#x7ECF;&#x53CD;&#x590D;&#x4E0D;&#x65AD;&#x5730;&#x660E;&#x786E;&#x5F3A;&#x8C03;&#x4EE5;&#x4E0B;&#x8BBE;&#x8BA1;&#x6807;&#x51C6;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x300A;C++ &#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x5316;&#x300B;[Stroustrup 1994]&#xFF08;<a href="02.html#21-&#x7B2C;&#x4E00;&#x4E2A;&#x5341;&#x5E74;">&#xA7;2.1</a>&#xFF09;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x201C;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x201D;&#x5305;&#x62EC; RAII&#xFF08;<a href="02.html#221-&#x8BED;&#x8A00;&#x7279;&#x6027;">&#xA7;2.2.1</a>&#xFF09;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x3001;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x548C;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x3002;</li>
<li>&#x201C;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x7B80;&#x5355;&#x505A;&#xFF01;&#x201D;&#xFF08;<a href="04.html#42-c11&#x7B80;&#x5316;&#x4F7F;&#x7528;">&#xA7;4.2</a>&#xFF09;&#x5219;&#x5F15;&#x51FA;&#x6D0B;&#x8471;&#x539F;&#x5219;&#xFF08;<a href="04.html#42-c11&#x7B80;&#x5316;&#x4F7F;&#x7528;">&#xA7;4.2</a>&#xFF09;&#x3002;</li>
<li>&#x4ECE;&#x4EE3;&#x7801;&#x5230;&#x786C;&#x4EF6;&#x7684;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x548C;&#x96F6;&#x5F00;&#x9500;&#x62BD;&#x8C61;&#xFF08;<a href="01.html#1-&#x524D;&#x8A00;">&#xA7;1</a>&#xFF09;&#xFF08;<a href="11.html#112-&#x6280;&#x672F;&#x4E0A;&#x7684;&#x6210;&#x529F;">&#xA7;11.2</a>&#xFF09;&#x3002;</li>
<li>&#x57FA;&#x4E8E;&#x610F;&#x89C1;&#x53CD;&#x9988;&#x6765;&#x53D1;&#x5C55; C++&#xFF0C;&#x4EE5;&#x89E3;&#x51B3;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF08;<a href="11.html#112-&#x6280;&#x672F;&#x4E0A;&#x7684;&#x6210;&#x529F;">&#xA7;11.2</a>&#xFF09;&#x3002;</li>
<li>&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x517C;&#x5BB9;&#x6027; [Koenig and Stroustrup 1991b; Stroustrup 1994]&#x3002;</li>
<li>&#x76F4;&#x63A5;&#x548C;&#x786C;&#x4EF6;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x53EF;&#x7EC4;&#x5408;&#x7684;&#x62BD;&#x8C61;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x53CA;&#x6700;&#x5C0F;&#x5316;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#xFF08;&#x53C2;&#x89C1;&#x6211;&#x5728; HOPL3 &#x7684;&#x8BBA;&#x6587; [Stroustrup 2007] &#x4E2D;&#x7684;&#x56DE;&#x987E;&#xFF09;&#x3002;</li>
</ul>
<p>&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x4EBA;&#x4EEC;&#x53D1;&#x73B0;&#x8981;&#x5728;&#x89E3;&#x91CA;&#x4E0A;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x592A;&#x96BE;&#xFF0C;&#x800C;&#x8981;&#x5FFD;&#x89C6;&#x4ED6;&#x4EEC;&#x6240;&#x4E0D;&#x559C;&#x6B22;&#x7684;&#x53C8;&#x592A;&#x5BB9;&#x6613;&#x3002;&#x8FD9;&#x79CD;&#x503E;&#x5411;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x201C;&#x4EC0;&#x4E48;&#x624D;&#x662F;&#x91CD;&#x8981;&#x7684;&#x201D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#x7684;&#x6839;&#x672C;&#x5206;&#x6B67;&#x5F97;&#x4EE5;&#x53D1;&#x9175;&#x3002;&#x5927;&#x5BB6;&#x57FA;&#x4E8E;&#x4ED6;&#x4EEC;&#x6240;&#x53D7;&#x7684;&#x6559;&#x80B2;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6765;&#x505A;&#x51FA;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;&#x8FD9;&#x79CD;&#x80CC;&#x666F;&#x4E0A;&#x7684;&#x591A;&#x6837;&#x6027;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x5185;&#x90E8;&#x5BF9;&#x4E8E; C++ &#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x7684;&#x4E0D;&#x5747;&#x8861;&#x8986;&#x76D6;&#xFF08;<a href="03.html#33-&#x5BF9;&#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;">&#xA7;3.3</a>&#xFF09;&#xFF0C;&#x5C31;&#x6784;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x8BB8;&#x591A;&#x4EBA;&#x53EA;&#x662F;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#x8FC7;&#x4E8E;&#x786E;&#x5B9A;&#x65E0;&#x7591; [Stroustrup 2019b]&#x3002;&#x800C;&#x8981;&#x5206;&#x8FA8;&#x6E05;&#x695A;&#x5230;&#x5E95;&#x4EC0;&#x4E48;&#x53EA;&#x662F;&#x4E00;&#x65F6;&#x7684;&#x6D41;&#x884C;&#xFF0C;&#x4EC0;&#x4E48;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#x624D;&#x5BF9; C++ &#x793E;&#x533A;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x786E;&#x5B9E;&#x5F88;&#x56F0;&#x96BE;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x63D0;&#x51FA;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5F80;&#x5F80;&#x4E0D;&#x662F;&#x6700;&#x597D;&#x7684;&#x90A3;&#x4E2A;&#x3002;</p>
<p>&#x4EBA;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5728;&#x7EC6;&#x8282;&#x4E2D;&#x8FF7;&#x5931;&#x800C;&#x5FFD;&#x7565;&#x4E86;&#x5927;&#x5C40;&#x3002;&#x4EBA;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5173;&#x6CE8;&#x5F53;&#x524D;&#x7684;&#x95EE;&#x9898;&#x800C;&#x5FD8;&#x8BB0;&#x957F;&#x671F;&#x76EE;&#x6807;&#xFF08;&#x4EE5;&#x5341;&#x5E74;&#x8BA1;&#xFF09;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x662F;&#x5982;&#x6B64;&#x4E13;&#x6CE8;&#x4E8E;&#x901A;&#x7528;&#x7684;&#x539F;&#x5219;&#x548C;&#x9065;&#x8FDC;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5BF9;&#x8FEB;&#x5728;&#x7709;&#x776B;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x89C6;&#x800C;&#x4E0D;&#x89C1;&#x3002;</p>
<p>&#x5728; 2017 &#x5E74;&#xFF0C;&#x4E00;&#x7FA4;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x673A;&#x6784;&#x4EE3;&#x8868;&#x56E2;&#x7684;&#x9886;&#x5BFC;&#x4EBA; [van Winkel et al. 2017] &#x8981;&#x6C42;&#x5BF9; C++ &#x7684;&#x65B9;&#x5411;&#x6027;&#x95EE;&#x9898;&#x4E88;&#x4EE5;&#x6B63;&#x5F0F;&#x4E25;&#x8083;&#x7684;&#x8003;&#x91CF;&#xFF0C;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x6566;&#x4FC3;&#x4E4B;&#x4E0B;&#xFF0C;WG21 &#x5EFA;&#x7ACB;&#x4E86;<strong>&#x65B9;&#x5411;&#x7EC4;</strong>&#xFF08;Direction Group&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E4B;&#x4E3A; DG&#xFF09;&#x4EE5;&#x8BD5;&#x56FE;&#x89E3;&#x51B3;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x548C;&#x65B9;&#x5411;&#x7684;&#x95EE;&#x9898;&#xFF08;<a href="03.html#32-&#x7EC4;&#x7EC7;">&#xA7;3.2</a>&#xFF09;&#x3002;DG &#x5728; 2018 &#x5E74; &#x53D1;&#x5E03;&#x4E86;&#x5B83;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5E7F;&#x6CDB;&#x800C;&#x8BE6;&#x5C3D;&#x7684;&#x58F0;&#x660E; [Dawes et al. 2018]&#xFF0C;&#x5F3A;&#x8C03;&#x4E86;&#x8981;&#x9075;&#x5B88;&#x660E;&#x786E;&#x6E05;&#x6670;&#x7684;&#x539F;&#x5219;&#x3001;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x9F13;&#x52B1;&#x7528;&#x6D41;&#x7A0B;&#x6765;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x9700;&#x8981;&#xFF1A;</p>
<ul>
<li>&#x7A33;&#x5B9A;&#x6027;&#xFF1A;&#x6709;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x201C;&#x5B58;&#x6D3B;&#x201D;&#x8FBE;&#x6570;&#x5341;&#x5E74;&#x3002;</li>
<li>&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF1A;&#x4E16;&#x754C;&#x5728;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#xFF0C;&#x800C; C++ &#x4E5F;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x6539;&#x53D8;&#x4EE5;&#x9762;&#x5BF9;&#x65B0;&#x7684;&#x6311;&#x6218;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x79CD;&#x5185;&#x5728;&#x7684;&#x5F20;&#x529B;&#x3002;</p>
</blockquote>
<p>DG &#x5F3A;&#x8C03;&#x4E00;&#x81F4;&#x6027;&#x6709;&#x5FC5;&#x8981;&#x8D2F;&#x7A7F;&#x6574;&#x4E2A;&#x6807;&#x51C6;&#xFF1A;</p>
<blockquote>
<p>&#x73B0;&#x5982;&#x4ECA;&#xFF0C;&#x67D0;&#x4E9B;&#x6700;&#x4E3A;&#x5F3A;&#x5927;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x878D;&#x5408;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x65B9;&#x9762;&#x3001;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x65B9;&#x9762;&#x3001;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x65B9;&#x9762;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x4F20;&#x7EDF;&#x7684;&#x547D;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x3002;&#x8FD9;&#x79CD;&#x7EC4;&#x5408;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7406;&#x8BBA;&#x4E0A;&#x7684;&#x7EAF;&#x7CB9;&#xFF0C;&#x624D;&#x662F;&#x7406;&#x60F3;&#x7684;&#x3002;</p>
<ul>
<li>&#x63D0;&#x4F9B;&#x5728;&#x98CE;&#x683C;&#xFF08;&#x8BED;&#x6CD5;&#x548C;&#x8BED;&#x4E49;&#xFF09;&#x548C;&#x4F7F;&#x7528;&#x98CE;&#x683C;&#x4E0A;&#x4E00;&#x81F4;&#x7684;&#x7279;&#x6027;&#x3002;</li>
</ul>
<p>&#x8BE5;&#x8981;&#x6C42;&#x9002;&#x7528;&#x4E8E;&#x5E93;&#x3001;&#x8BED;&#x8A00;&#x7279;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x7EC4;&#x5408;</p>
</blockquote>
<p>&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x9759;&#x6001;&#x7C7B;&#x578B;&#xFF1A;</p>
<blockquote>
<p>C++ &#x6781;&#x5176;&#x4F9D;&#x8D56;&#x4E8E;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#xFF0C;&#x4EE5;&#x8FBE;&#x6210;&#x5176;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x3001;&#x6027;&#x80FD;&#x548C;&#x5B89;&#x5168;&#x6027;&#x3002;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5E94;&#x6709;</p>
<ul>
<li>&#x5B8C;&#x5168;&#x7684;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x548C;&#x8D44;&#x6E90;&#x5B89;&#x5168;&#xFF08;&#x6CA1;&#x6709;&#x5185;&#x5B58;&#x635F;&#x574F;&#x548C;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF09;</li>
</ul>
<p>&#x8BE5;&#x8981;&#x6C42;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x589E;&#x52A0;&#x989D;&#x5916;&#x5F00;&#x9500;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FBE;&#x6210;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x9650;&#x5236;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x3002;</p>
</blockquote>
<p>&#x56FD;&#x5BB6;&#x673A;&#x6784;&#x9886;&#x5BFC;&#x7684;&#x8981;&#x6C42; [van Winkel et al. 2017] &#x548C; DG &#x7684;&#x6587;&#x6863; [Dawes et al. 2018] &#x90FD;&#x5F3A;&#x8C03;&#x4E86;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x9700;&#x8981;&#x4E86;&#x89E3; C++ &#x7684;&#x5386;&#x53F2;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x8FDE;&#x7EED;&#x6027;&#x3002;&#x4E00;&#x4E2A;&#x7F3A;&#x4E4F;&#x5386;&#x53F2;&#x7684;&#x7EC4;&#x7EC7;&#x65E0;&#x6CD5;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x5185;&#x5BB9;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;HOPL &#x8BBA;&#x6587; [Stroustrup 1993, 2007] &#x548C;&#x300A;C++ &#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x5316;&#x300B;[Stroustrup 1994] &#x626E;&#x6F14;&#x4E86;&#x57FA;&#x77F3;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;&#x4E3A;&#x7B26;&#x5408; WG21 &#x5728; ISO &#x7684;&#x7AE0;&#x7A0B;&#xFF0C;C++ &#x6F14;&#x5316;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x4E3B;&#x8981;&#x90FD;&#x805A;&#x7126;&#x4E8E;&#x8BED;&#x8A00;&#x548C;&#x5E93;&#x7684;&#x8BFE;&#x9898;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x8003;&#x8651;&#x8BED;&#x8A00;&#xFF1A;&#x7A0B;&#x5E8F;&#x662F;&#x5DE5;&#x5177;&#x94FE;&#xFF08;<a href="01.html#1-&#x524D;&#x8A00;">&#xA7;1</a>&#xFF09;&#x7684;&#x4EA7;&#x7269;&#x3002;&#x4EE4;&#x4EBA;&#x9707;&#x60CA;&#x7684;&#x662F;&#xFF0C;C++ &#x5E76;&#x6CA1;&#x6709;&#x5173;&#x4E8E;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5E93;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6807;&#x51C6;&#x5316;&#x7684;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x3002;&#x5DE5;&#x5177;&#x7814;&#x7A76;&#x5C0F;&#x7EC4; SG15 &#x5728; 2018 &#x5E74;&#x6210;&#x7ACB;&#xFF0C;&#x4EE5;&#x5C1D;&#x8BD5;&#x5E94;&#x5BF9;&#x5DE5;&#x5177;&#x65B9;&#x9762;&#x7684;&#x5F62;&#x5F62;&#x8272;&#x8272;&#x7684;&#x95EE;&#x9898;&#xFF08;<a href="03.html#32-&#x7EC4;&#x7EC7;">&#xA7;3.2</a>&#xFF09;&#x3002;</p>
<h2 id="92-&#x6211;&#x7684;-c17-&#x6E05;&#x5355;">9.2 &#x6211;&#x7684; C++17 &#x6E05;&#x5355;</h2>
<p>&#x6211;&#x4E00;&#x76F4;&#x52AA;&#x529B;&#x9F13;&#x52B1;&#x59D4;&#x5458;&#x4F1A;&#x5173;&#x6CE8;&#x91CD;&#x8981;&#x7684;&#x6539;&#x8FDB;&#x2014;&#x2014;&#x800C;&#x4E0D;&#x53EA;&#x53BB;&#x505A;&#x90A3;&#x4E9B;&#x5BB9;&#x6613;&#x5B8C;&#x6210;&#x548C;&#x5BB9;&#x6613;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x4E8B;&#x60C5;&#x2014;&#x2014;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x52AA;&#x529B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x5236;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x6E05;&#x5355;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x6211;&#x8BA4;&#x4E3A;&#x91CD;&#x8981;&#x4E14;&#x9002;&#x5408;&#x5F15;&#x5165; C++17 &#x7684;&#x5185;&#x5BB9;&#x53CA;&#x5176;&#x7406;&#x7531;&#xFF1A;</p>
<ul>
<li>&#x6982;&#x5FF5;&#x2014;&#x2014;&#x5B83;&#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7CBE;&#x786E;&#x63CF;&#x8FF0;&#x6CDB;&#x578B;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x89E3;&#x51B3;&#x5BF9;&#x4E8E;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x8D28;&#x91CF;&#x7684;&#x5E7F;&#x6CDB;&#x62B1;&#x6028;&#x3002;</li>
<li>&#x6A21;&#x5757;&#x2014;&#x2014;&#x53EA;&#x8981;&#x5B83;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x5730;&#x63D0;&#x9AD8;&#x4E0E;&#x5B8F;&#x7684;&#x9694;&#x79BB;&#x5E76;&#x5927;&#x5927;&#x4F18;&#x5316;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x8303;&#x56F4;&#x5E93;&#x548C;&#x5176;&#x4ED6;&#x5173;&#x952E; STL &#x7EC4;&#x4EF6;&#x5BF9;&#x6982;&#x5FF5;&#x7684;&#x4F7F;&#x7528;&#x2014;&#x2014;&#x4E3A;&#x4E3B;&#x6D41;&#x7528;&#x6237;&#x6539;&#x8FDB;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x8D28;&#x91CF;&#x548C;&#x63D0;&#x9AD8;&#x5E93;&#x89C4;&#x8303;&#x7684;&#x7CBE;&#x786E;&#x6027;&#xFF08;&#x201C;STL2&#x201D;&#xFF09;&#x3002;</li>
<li>&#x7EDF;&#x4E00;&#x8C03;&#x7528;&#x8BED;&#x6CD5;&#x2014;&#x2014;&#x7B80;&#x5316;&#x6A21;&#x677F;&#x5E93;&#x7684;&#x89C4;&#x8303;&#x548C;&#x4F7F;&#x7528;&#x3002;</li>
<li>&#x534F;&#x7A0B;&#x2014;&#x2014;&#x5E94;&#x8BE5;&#x975E;&#x5E38;&#x5FEB;&#x901F;&#x800C;&#x7B80;&#x5355;&#x3002;</li>
<li>&#x7F51;&#x7EDC;&#x5E93;&#x652F;&#x6301;&#x2014;&#x2014;&#x57FA;&#x4E8E; asio &#x5E93;&#xFF0C;&#x5982;&#x76F8;&#x5E94; TS &#x6240;&#x63CF;&#x8FF0;&#x3002;</li>
<li>&#x5951;&#x7EA6;&#x2014;&#x2014;&#x4E0D;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x5728; C++17 &#x7684;&#x5E93;&#x89C4;&#x8303;&#x4E2D;&#x4F7F;&#x7528;&#x3002;</li>
<li>SIMD &#x5411;&#x91CF;&#x548C;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x3002;</li>
<li>&#x6807;&#x51C6;&#x5E93;&#x8BCD;&#x6C47;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982; <code>optional</code>&#x3001;<code>variant</code>&#x3001;<code>string_view</code> &#x548C; <code>array_view</code>&#x3002;</li>
<li>&#x4E00;&#x79CD;&#x5728;&#x6808;&#x4E0A;&#x63D0;&#x4F9B;&#x6570;&#x7EC4;&#xFF08;<code>stack_array</code>&#xFF09;&#x7684;&#x201C;&#x9B54;&#x6CD5;&#x7C7B;&#x578B;&#x201D;&#xFF0C;&#x5408;&#x7406;&#x652F;&#x6301;&#x5B89;&#x5168;&#x3001;&#x4FBF;&#x6377;&#x7684;&#x4F7F;&#x7528;&#x3002;</li>
</ul>
<p>&#x5728; 2015 &#x5E74; 4 &#x6708;&#x4EFD;&#xFF0C;&#x5728; Kansas &#x5DDE; Lenexa &#x7684; WG21 &#x4F1A;&#x8BAE;&#x4E2D;&#xFF0C;&#x6211;&#x5728;&#x665A;&#x95F4;&#x4F1A;&#x8BAE;&#x4E0A;&#x5411;&#x4E00;&#x4E9B;&#x6709;&#x5171;&#x9E23;&#x7684;&#x89C2;&#x4F17;&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x4E2A;&#x6E05;&#x5355;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EBA;&#x611F;&#x53D7;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x52A8;&#x529B;&#x53BB;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x6E05;&#x5355;&#x8C03;&#x6574;&#x5DE5;&#x4F5C;&#x7126;&#x70B9;&#x3002;&#x8FD9;&#x4E2A;&#x6E05;&#x5355;&#x540E;&#x6765;&#x201C;&#x6CC4;&#x9732;&#x201D;&#x4E86;&#x51FA;&#x53BB;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x7F51;&#x4E0A;&#x5F15;&#x8D77;&#x4E86;&#x6DF7;&#x4E71;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x628A;&#x5B83;&#x6B63;&#x5F0F;&#x5199;&#x51FA;&#x6765; [Stroustrup 2015a]&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x56E2;&#x7ED3;&#x7684;&#x59D4;&#x5458;&#x4F1A;&#x4E2D;&#xFF0C;&#x8BE5;&#x6E05;&#x5355;&#x4E0A;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x8FDB;&#x5165; C++17 &#x4E86;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E13;&#x6CE8;&#x4E8E;&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#xFF0C;&#x5B8C;&#x6210;&#x5176;&#x4E2D;&#x7684;&#x5927;&#x7EA6;&#x4E00;&#x534A;&#x63D0;&#x6848;&#x8FD8;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;&#x7136;&#x800C;&#x6211;&#x8FD8;&#x662F;&#x8FC7;&#x4E8E;&#x4E50;&#x89C2;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x552F;&#x4E00;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x7684;&#x4E5F;&#x5C31;&#x53EA;&#x6709;&#x5173;&#x4E8E;&#x6807;&#x51C6;&#x5E93;&#x8BCD;&#x6C47;&#x7C7B;&#x578B;&#x7684;&#x90A3;&#x4E00;&#x9879;&#x3002;&#x5176;&#x4E2D; <code>array_view</code> &#x88AB;&#x91CD;&#x547D;&#x540D;&#x4E3A; <code>span</code>&#xFF0C;&#x6210;&#x4E86; C++20&#xFF08;<a href="#938-&#x8DE8;&#x5EA6;">&#xA7;9.3.8</a>&#xFF09;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5217;&#x8868;&#x4E0A;&#x7684;&#x5927;&#x90E8;&#x5206;&#x6761;&#x76EE;&#x8FDB;&#x5165;&#x4E86; C++20&#x3002;&#x9664;&#x4E86;</p>
<ul>
<li>&#x7F51;&#x7EDC;&#x5E93;&#xFF08;<a href="08.html#881-&#x7F51;&#x7EDC;&#x5E93;">&#xA7;8.8.1</a>&#xFF09;&#x2014;&#x2014;&#x73B0;&#x5728;&#x662F;&#x4E2A; TS [Wakely 2018]</li>
<li>&#x5951;&#x7EA6;&#xFF08;<a href="#961-&#x5951;&#x7EA6;">&#xA7;9.6.1</a>&#xFF09;&#x2014;&#x2014;&#x5DEE;&#x4E00;&#x70B9;&#x8FDB;&#x5165; C++20</li>
<li>&#x7EDF;&#x4E00;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF08;<a href="08.html#883-&#x7EDF;&#x4E00;&#x8C03;&#x7528;&#x8BED;&#x6CD5;">&#xA7;8.8.3</a>&#xFF09;</li>
<li>SIMD &#x5411;&#x91CF;&#x2014;&#x2014;&#x76EE;&#x524D;&#x5728;&#x4E00;&#x4E2A; TS &#x4E2D; [Hoberock 2019]</li>
<li><code>stack_array</code></li>
</ul>
<p>&#x8FD9;&#x4EFD;&#x5217;&#x8868;&#x5E26;&#x6765;&#x4E86;&#x65E5;&#x7A0B;&#x5B89;&#x6392;&#x4E0A;&#x7684;&#x4E89;&#x8BBA;&#x3002;&#x9274;&#x4E8E;&#x6982;&#x5FF5;&#x7684;&#x63D0;&#x6848;&#xFF08;<a href="06.html#638-&#x4E3A;&#x4EC0;&#x4E48;&#x5728;-c17-&#x4E2D;&#x6CA1;&#x6709;&#x6982;&#x5FF5;">&#xA7;6.3.8</a>&#xFF09;&#x5728; 2016 &#x5E74;&#x7684;&#x5931;&#x8D25;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x4E86;&#xFF0C;&#x6211;&#x88AB;&#x8BE2;&#x95EE;&#x2014;&#x2014;&#x7531;&#x6574;&#x4E2A;&#x59D4;&#x5458;&#x4F1A;&#x2014;&#x2014;&#x662F;&#x5426;&#x6211;&#x6253;&#x7B97;&#x63D0;&#x8BAE;&#x63A8;&#x8FDF;&#x6807;&#x51C6;&#x7684;&#x53D1;&#x5E03;&#x4E00;&#x5230;&#x4E24;&#x5E74;&#xFF0C;&#x6765;&#x628A;&#x6982;&#x5FF5;&#x52A0;&#x5165;&#x5230;&#x6807;&#x51C6;&#x4E2D;&#xFF0C;&#x8BA9;&#x6807;&#x51C6;&#x53D8;&#x6210; C++18 &#x6216;&#x8005; C++19&#x3002;&#x6211;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x8BA4;&#x4E3A;&#x53EF;&#x9884;&#x89C1;&#x7684;&#x53D1;&#x5E03;&#x5468;&#x671F;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x793E;&#x533A;&#x800C;&#x8A00;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x5176;&#x91CD;&#x8981;&#x6027;&#x8981;&#x8D85;&#x8FC7;&#x67D0;&#x4E2A;&#x5355;&#x9879;&#x7684;&#x6539;&#x8FDB;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5F53;&#x65F6;&#x4E5F;&#x65E0;&#x6CD5;&#x786E;&#x4FDD;&#x4E00;&#x5B9A;&#x4F1A;&#x5C31;&#x8BE5;&#x63D0;&#x6848;&#x5F62;&#x6210;&#x5171;&#x8BC6;&#xFF0C;&#x518D;&#x8BF4;&#x4E00;&#x6B21;&#x65E5;&#x7A0B;&#x5EF6;&#x8BEF;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x66F4;&#x591A;&#x7684;&#x5EF6;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4EFD;&#x63D0;&#x6848;&#x88AB;&#x8BA4;&#x4E3A;&#x503C;&#x5F97;&#x63A8;&#x8FDF;&#x6807;&#x51C6;&#x53D1;&#x5E03;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x6709;&#x4EBA;&#x4E3B;&#x5F20;&#x4E5F;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x63D0;&#x6848;&#x540C;&#x6837;&#x503C;&#x5F97;&#x6807;&#x51C6;&#x53D1;&#x5E03;&#x7684;&#x63A8;&#x8FDF;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x903B;&#x8F91;&#x4F7F;&#x5F97; C++0x &#x53D8;&#x6210;&#x4E86; C++11&#xFF0C;&#x54EA;&#x6015;&#x5F53;&#x65F6;&#x66FE;&#x6709;&#x4EBA;&#x5E0C;&#x671B;&#x662F; C++06&#x3002;</p>
<h2 id="93-c20-&#x7279;&#x6027;">9.3 C++20 &#x7279;&#x6027;</h2>
<p>WG21 &#x5C06;&#x9488;&#x5BF9; C++20 &#x7684;&#x65B0;&#x63D0;&#x6848;&#x7684;&#x622A;&#x6B62;&#x65E5;&#x671F;&#x5B9A;&#x4E3A; 2018 &#x5E74; 11 &#x6708;&#xFF0C;&#x5E76;&#x5728; 2019 &#x5E74; 2 &#x6708;&#x4F1A;&#x8BAE;&#x4E4B;&#x540E;&#x5BA3;&#x5E03;&#x201C;&#x7279;&#x6027;&#x51BB;&#x7ED3;&#x201D;&#x3002;2020 &#x5E74; 2 &#x6708;&#xFF0C;&#x5728;&#x6377;&#x514B;&#x5171;&#x548C;&#x56FD;&#x5E03;&#x62C9;&#x683C;&#x4E3E;&#x884C;&#x7684;&#x4E00;&#x6B21;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF0C;&#x6280;&#x672F;&#x6295;&#x7968;&#x7ED3;&#x679C;&#x4E3A; 79 &#x6BD4; 0&#xFF0C;&#x4E00;&#x7968;&#x5F03;&#x6743; [Smith 2020]&#x3002;&#x6240;&#x6709; 15 &#x4E2A;&#x56FD;&#x5BB6;&#x6210;&#x5458;&#x4F53;&#x7684;&#x4EE3;&#x8868;&#x56E2;&#x56E2;&#x957F;&#x5747;&#x6295;&#x4E86;&#x8D5E;&#x6210;&#x7968;&#x3002;&#x5B98;&#x65B9;&#x6807;&#x51C6;&#x5C06;&#x7531; ISO &#x5728; 2020 &#x5E74;&#x672B;&#x53D1;&#x5E03;&#x3002;C++20 &#x7279;&#x6027;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><a href="06.html#64-c20-&#x6982;&#x5FF5;">&#xA7;6.4</a>&#xFF1A;<strong>&#x6982;&#x5FF5;</strong>&#x2014;&#x2014;&#x5BF9;&#x6CDB;&#x578B;&#x4EE3;&#x7801;&#x7684;&#x8981;&#x6C42;&#x8FDB;&#x884C;&#x660E;&#x786E;&#x89C4;&#x5B9A;</li>
<li><a href="#931-&#x6A21;&#x5757;">&#xA7;9.3.1</a>&#xFF1A;<strong>&#x6A21;&#x5757;</strong>&#x2014;&#x2014;&#x652F;&#x6301;&#x4EE3;&#x7801;&#x7684;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x536B;&#x751F;&#x5E76;&#x6539;&#x5584;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;</li>
<li><a href="#932-&#x534F;&#x7A0B;">&#xA7;9.3.2</a>&#xFF1A;<strong>&#x534F;&#x7A0B;</strong>&#x2014;&#x2014;&#x65E0;&#x6808;&#x534F;&#x7A0B;</li>
<li><a href="#933-&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x652F;&#x6301;">&#xA7;9.3.3</a>&#xFF1A;<strong>&#x7F16;&#x8BD1;&#x671F;</strong>&#x8BA1;&#x7B97;&#x652F;&#x6301;</li>
<li><a href="#934-">&#xA7;9.3.4</a>&#xFF1A;<strong>&lt;=&gt;</strong>&#x2014;&#x2014;&#x4E09;&#x5411;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26;</li>
<li><a href="#935-&#x8303;&#x56F4;">&#xA7;9.3.5</a>&#xFF1A;<strong>&#x8303;&#x56F4;</strong>&#x2014;&#x2014;&#x63D0;&#x4F9B;&#x7075;&#x6D3B;&#x7684;&#x8303;&#x56F4;&#x62BD;&#x8C61;&#x7684;&#x5E93;</li>
<li><a href="#936-&#x65E5;&#x671F;&#x548C;&#x65F6;&#x533A;">&#xA7;9.3.6</a>&#xFF1A;<strong>&#x65E5;&#x671F;</strong>&#x2014;&#x2014;&#x63D0;&#x4F9B;&#x65E5;&#x671F;&#x7C7B;&#x578B;&#x3001;&#x65E5;&#x5386;&#x548C;&#x65F6;&#x533A;&#x7684;&#x5E93;</li>
<li><a href="#938-&#x8DE8;&#x5EA6;">&#xA7;9.3.8</a>&#xFF1A;<strong>&#x8DE8;&#x5EA6;</strong>&#x2014;&#x2014;&#x63D0;&#x4F9B;&#x5BF9;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x9AD8;&#x6548;&#x548C;&#x5B89;&#x5168;&#x8BBF;&#x95EE;&#x7684;&#x5E93;</li>
<li><a href="#937-&#x683C;&#x5F0F;&#x5316;">&#xA7;9.3.7</a>&#xFF1A;<strong>&#x683C;&#x5F0F;&#x5316;</strong>&#x2014;&#x2014;&#x63D0;&#x4F9B;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#x4F3C;&#x4E8E; printf &#x7684;&#x8F93;&#x51FA;&#x7684;&#x5E93;</li>
<li><a href="#94-&#x5E76;&#x53D1;">&#xA7;9.4</a>&#xFF1A;<strong>&#x5E76;&#x53D1;&#x6539;&#x8FDB;</strong>&#x2014;&#x2014;&#x4F8B;&#x5982;&#x4F5C;&#x7528;&#x57DF;&#x7EBF;&#x7A0B;&#x548C;&#x505C;&#x6B62;&#x4EE4;&#x724C;</li>
<li><a href="#95-&#x6B21;&#x8981;&#x7279;&#x6027;">&#xA7;9.5</a>&#xFF1A;<strong>&#x5F88;&#x591A;&#x6B21;&#x8981;&#x7279;&#x6027;</strong>&#x2014;&#x2014;&#x4F8B;&#x5982; C99 &#x98CE;&#x683C;&#x7684;&#x6307;&#x6D3E;&#x521D;&#x59CB;&#x5316;&#x5668;&#x548C;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x5B57;&#x9762;&#x91CF;&#x4F5C;&#x4E3A;&#x6A21;&#x677F;&#x53C2;&#x6570;</li>
</ul>
<p>&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x5728; C++20 &#x65F6;&#x5C1A;&#x672A;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x4E3A; C++23 &#x7684;&#x4E3B;&#x8981;&#x7279;&#x6027;&#xFF1A;</p>
<ul>
<li><a href="08.html#881-&#x7F51;&#x7EDC;&#x5E93;">&#xA7;8.8.1</a>&#xFF1A;<strong>&#x7F51;&#x7EDC;</strong>&#x2014;&#x2014;&#x7F51;&#x7EDC;&#x5E93;&#xFF08;sockets &#x7B49;&#xFF09;</li>
<li><a href="#962-&#x9759;&#x6001;&#x53CD;&#x5C04;">&#xA7;9.6.2</a>&#xFF1A;<strong>&#x9759;&#x6001;&#x53CD;&#x5C04;</strong>&#x2014;&#x2014;&#x6839;&#x636E;&#x5468;&#x56F4;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x529F;&#x80FD;</li>
<li><strong>&#x6A21;&#x5F0F;&#x5339;&#x914D;</strong>&#x2014;&#x2014;&#x6839;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x5BF9;&#x8C61;&#x503C;&#x9009;&#x62E9;&#x8981;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801; [Murzin et al. 2019]</li>
</ul>
<p>C++20 &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4;&#x53CD;&#x6620; C++ &#x957F;&#x671F;&#x76EE;&#x6807;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5E76;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x4E9B;&#x6839;&#x672C;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728; 1994 &#x5E74;&#x7684;&#x300A;C++ &#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x5316;&#x300B;[Stroustrup 1994] &#x4E00;&#x4E66;&#x4E2D;&#x5C31;&#x63D0;&#x5230;&#x4E86;&#x6A21;&#x5757;&#x548C;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x534F;&#x7A0B;&#x5728;&#x6574;&#x4E2A; 1980 &#x5E74;&#x4EE3;&#x90FD;&#x662F;&#x201C;&#x5E26;&#x7C7B;&#x7684; C&#x201D;&#x548C; C++ &#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;C++20 &#x5BF9; C++ &#x7684;&#x5F71;&#x54CD;&#x5C06;&#x4E0E; C++11 &#x4E00;&#x6837;&#x5927;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;C++20 &#x6CA1;&#x6709;&#x5BF9;&#x6A21;&#x5757;&#x548C;&#x534F;&#x7A0B;&#x63D0;&#x4F9B;&#x6807;&#x51C6;&#x5E93;&#x652F;&#x6301;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5F53;&#x65F6;&#x5B9E;&#x5728;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x6765;&#x51C6;&#x5907;&#x5E76;&#x8D76;&#x4E0A; C++20 &#x7684;&#x65F6;&#x95F4;&#x8981;&#x6C42;&#x3002;C++23 &#x5E94;&#x8BE5;&#x4F1A;&#x63D0;&#x4F9B;&#x6240;&#x9700;&#x7684;&#x652F;&#x6301;&#xFF08;<a href="04.html#413-&#x671F;&#x503C;future">&#xA7;4.1.3</a>&#xFF09;&#x3002;</p>
<h3 id="931-&#x6A21;&#x5757;">9.3.1 &#x6A21;&#x5757;</h3>
<p>&#x5728; C++ &#x7A0B;&#x5E8F;&#x4E2D;&#x6539;&#x8FDB;&#x6A21;&#x5757;&#x5316;&#x662F;&#x4E00;&#x4E2A;&#x663E;&#x7136;&#x7684;&#x9700;&#x6C42;&#x3002;C++ &#x4ECE; C &#x8BED;&#x8A00;&#x4E2D;&#x7EE7;&#x627F;&#x4E86; <code>#include</code> &#x673A;&#x5236;&#xFF0C;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x4ECE;&#x5934;&#x6587;&#x4EF6;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x5305;&#x542B; C++ &#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4E9B;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x63A5;&#x53E3;&#x7684;&#x6587;&#x672C;&#x5B9A;&#x4E49;&#x3002;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x5934;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#x7684;&#x5404;&#x4E2A;&#x5355;&#x72EC;&#x7F16;&#x8BD1;&#x7684;&#x90E8;&#x5206;&#x4E2D;&#x88AB; <code>#include</code> &#x6570;&#x767E;&#x6B21;&#x3002;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x662F;&#xFF1A;</p>
<ul>
<li><strong>&#x4E0D;&#x591F;&#x536B;&#x751F;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x540C;&#x4E00;&#x7FFB;&#x8BD1;&#x5355;&#x5143;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x53E6;&#x4E00;&#x4E2A; <code>#include</code> &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x56E0;&#x6B64; <code>#include</code> &#x5E76;&#x975E;&#x987A;&#x5E8F;&#x65E0;&#x5173;&#x3002;&#x5B8F;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li><strong>&#x5206;&#x79BB;&#x7F16;&#x8BD1;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x6027;</strong>&#xFF1A;&#x4E24;&#x4E2A;&#x7FFB;&#x8BD1;&#x5355;&#x5143;&#x4E2D;&#x540C;&#x4E00;&#x5B9E;&#x4F53;&#x7684;&#x58F0;&#x660E;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x6240;&#x6709;&#x6B64;&#x7C7B;&#x9519;&#x8BEF;&#x90FD;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x6216;&#x94FE;&#x63A5;&#x5668;&#x6355;&#x83B7;&#x3002;</li>
<li><strong>&#x7F16;&#x8BD1;&#x6B21;&#x6570;&#x8FC7;&#x591A;</strong>&#xFF1A;&#x4ECE;&#x6E90;&#x4EE3;&#x7801;&#x6587;&#x672C;&#x7F16;&#x8BD1;&#x63A5;&#x53E3;&#x6BD4;&#x8F83;&#x6162;&#x3002;&#x4ECE;&#x6E90;&#x4EE3;&#x7801;&#x6587;&#x672C;&#x53CD;&#x590D;&#x5730;&#x7F16;&#x8BD1;&#x540C;&#x4E00;&#x4EFD;&#x63A5;&#x53E3;&#x975E;&#x5E38;&#x6162;&#x3002;</li>
</ul>
<p>&#x81EA;&#x201C;&#x5F00;&#x8F9F;&#x9E3F;&#x8499;&#x201D;&#x800C;&#x59CB;&#xFF0C;&#x8FD9;&#x5DF2;&#x7ECF;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x53C2;&#x89C1;&#x300A;C++ &#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x5316;&#x300B;[Stroustrup 1994] &#x7B2C; 18 &#x7AE0;&#xFF09;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x88AB;&#x653E;&#x5165;&#x5934;&#x6587;&#x4EF6;&#xFF08;<code>inline</code> &#x51FD;&#x6570;&#x3001;<code>constexpr</code> &#x51FD;&#x6570;&#xFF0C;&#x8FD8;&#x6709;&#x5C24;&#x5176;&#x662F;&#x6A21;&#x677F;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5728;&#x8FD9;&#x4E9B;&#x5E74;&#x91CC;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x4E25;&#x91CD;&#x3002;&#x5728; C++ &#x7684;&#x65E9;&#x671F;&#xFF0C;&#x901A;&#x5E38; 10% &#x7684;&#x6587;&#x672C;&#x6765;&#x81EA;&#x5934;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x5B83;&#x66F4;&#x53EF;&#x80FD;&#x662F; 90% &#x751A;&#x81F3; 99%&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span><span class="hljs-meta-string">&lt;iostream&gt;</span></span>

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span>
</span>{
    <span class="hljs-built_in">std</span>::<span class="hljs-built_in">cout</span> &lt;&lt; <span class="hljs-string">&quot;Hello, World\n&quot;</span>;
}
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x5178;&#x578B;&#x7684;&#x4EE3;&#x7801;&#x6709; 70 &#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x4F46;&#x662F;&#x5728; <code>#include</code> &#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x4F1A;&#x4EA7;&#x751F; 419909 &#x4E2A;&#x5B57;&#x7B26;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x5668;&#x6765;&#x6D88;&#x5316;&#x3002;&#x5C3D;&#x7BA1;&#x73B0;&#x4EE3; C++ &#x7F16;&#x8BD1;&#x5668;&#x5DF2;&#x6709;&#x9A84;&#x4EBA;&#x7684;&#x5904;&#x7406;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x6A21;&#x5757;&#x5316;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x8FEB;&#x5728;&#x7709;&#x776B;&#x3002;</p>
<p>&#x5728;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x9F13;&#x52B1;&#x4E0B;&#xFF08;&#x5E76;&#x5F97;&#x5230;&#x4E86;&#x6211;&#x7684;&#x652F;&#x6301;&#xFF09;&#xFF0C;David Vandevoorde &#x5728;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x4EA7;&#x51FA;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x6A21;&#x5757;&#x8BBE;&#x8BA1; [Vandevoorde 2007&#xFF0C;2012]&#xFF0C;&#x4F46;&#x8FDB;&#x5C55;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x7684;&#x9996;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x5B8C;&#x6210; C++0x&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6A21;&#x5757;&#x4E0A;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x3002;David &#x4E3B;&#x8981;&#x9760;&#x81EA;&#x5DF1;&#x594B;&#x6597;&#xFF0C;&#x6B64;&#x5916;&#x57FA;&#x672C;&#x5C31;&#x53EA;&#x5F97;&#x5230;&#x4E00;&#x4E9B;&#x7CBE;&#x795E;&#x652F;&#x6301;&#x4E86;&#x3002;&#x5728; 2012 &#x5E74;&#xFF0C;Doug Gregor &#x4ECE;&#x82F9;&#x679C;&#x63D0;&#x4EA4;&#x4E86;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1; [Gregor 2012]&#x3002;&#x5728; Clang &#x7F16;&#x8BD1;&#x5668;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E00;&#x8BBE;&#x8BA1;&#x5DF2;&#x7ECF;&#x9488;&#x5BF9; C &#x548C; Objective C &#x5B9E;&#x73B0; [Clang 2014]&#x3002;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x8BED;&#x8A00;&#x4E4B;&#x5916;&#x7684;&#x6587;&#x4EF6;&#x6620;&#x5C04;&#x6307;&#x4EE4;&#xFF0C;&#x800C;&#x4E0D;&#x662F; C++ &#x8BED;&#x8A00;&#x91CC;&#x7684;&#x6784;&#x4EF6;&#x3002;&#x8BE5;&#x8BBE;&#x8BA1;&#x8FD8;&#x5F3A;&#x8C03;&#x4E86;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x5934;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x5728; 2014 &#x5E74;&#xFF0C;&#x7531; Gabriel Dos Reis &#x9886;&#x5BFC;&#x7684;&#x5FAE;&#x8F6F;&#x56E2;&#x961F;&#x6210;&#x5458;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x9879;&#x63D0;&#x6848; [Dos Reis et al. 2014]&#x3002;&#x4ECE;&#x7CBE;&#x795E;&#x5C42;&#x9762;&#x4E0A;&#x8BB2;&#xFF0C;&#x5B83;&#x66F4;&#x63A5;&#x8FD1;&#x4E8E; David Vandevoorde &#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x4E0D;&#x662F; Clang/&#x82F9;&#x679C;&#x7684;&#x63D0;&#x8BAE;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x57FA;&#x4E8E; Gabriel Dos Reis &#x548C; Bjarne Stroustrup &#x5728;&#x5F97;&#x5DDE;&#x519C;&#x5DE5;&#x5927;&#x5B66;&#x6240;&#x505A;&#x7684;&#x5173;&#x4E8E; C++ &#x6E90;&#x4EE3;&#x7801;&#x7684;&#x6700;&#x4F18;&#x56FE;&#x8868;&#x793A;&#x7684;&#x7814;&#x7A76;&#xFF08;&#x4E8E; 2007 &#x5E74;&#x53D1;&#x5E03;&#x5E76;&#x5F00;&#x6E90; [Dos Reis 2009; Dos Reis and Stroustrup 2009, 2011]&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x4E3A;&#x5728;&#x6A21;&#x5757;&#x65B9;&#x9762;&#x53D6;&#x5F97;&#x91CD;&#x5927;&#x8FDB;&#x5C55;&#x5960;&#x5B9A;&#x4E86;&#x57FA;&#x7840;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x4E3A;&#x82F9;&#x679C;/&#x8C37;&#x6B4C;/Clang &#x65B9;&#x5F0F;&#xFF08;&#x548C;&#x5B9E;&#x73B0;&#xFF09;&#x53CA;&#x5FAE;&#x8F6F;&#x65B9;&#x5F0F;&#xFF08;&#x548C;&#x5B9E;&#x73B0;&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x51B2;&#x7A81;&#x57CB;&#x4E0B;&#x4E86;&#x4F0F;&#x7B14;&#x3002;</p>
<p>&#x4E3A;&#x6B64;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x7814;&#x7A76;&#x5C0F;&#x7EC4;&#x88AB;&#x521B;&#x5EFA;&#x3002;3 &#x5E74;&#x540E;&#xFF0C;&#x8BE5;&#x5C0F;&#x7EC4;&#x4E3B;&#x8981;&#x57FA;&#x4E8E; Gabriel Dos Reis &#x7684;&#x8BBE;&#x8BA1; [Dos Reis 2018] &#x5236;&#x8BA2;&#x4E86; TS&#x3002;</p>
<p>&#x5728; 2017 &#x5E74;&#xFF0C;&#x7136;&#x540E;&#x5728; 2018 &#x5E74;&#x53C8;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x5C06; Modules TS &#x7EB3;&#x5165; C++20 &#x6807;&#x51C6;&#x7684;&#x5EFA;&#x8BAE;&#x53D7;&#x963B;&#xFF0C;&#x5C31;&#x56E0;&#x4E3A;&#x8C37;&#x6B4C;&#x63D0;&#x51FA;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1; [Smith 2018a,b]&#x3002;&#x4E89;&#x8BBA;&#x7684;&#x4E3B;&#x8981;&#x7126;&#x70B9;&#x662F;&#x5728; Gabriel Dos Reis &#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x5B8F;&#x65E0;&#x6CD5;&#x5BFC;&#x51FA;&#x3002;&#x8C37;&#x6B4C;&#x7684;&#x4EBA;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x81F4;&#x547D;&#x7F3A;&#x9677;&#xFF0C;&#x800C; Gabriel Dos Reis&#xFF08;&#x548C;&#x6211;&#xFF09;&#x8BA4;&#x4E3A;&#x8FD9;&#x5BF9;&#x4E8E;&#x6A21;&#x5757;&#x5316;&#x81F3;&#x5173;&#x91CD;&#x8981; [Stroustrup 2018c]&#xFF1A;</p>
<blockquote>
<p>&#x6A21;&#x5757;&#x5316;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x987A;&#x5E8F;&#x72EC;&#x7ACB;&#x6027;&#xFF1A;<code>import X; import Y;</code> &#x5E94;&#x8BE5;&#x4E0E; <code>import Y; import X;</code> &#x76F8;&#x540C;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x90FD;&#x4E0D;&#x80FD;&#x9690;&#x5F0F;&#x5730;&#x4ECE;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x201C;&#x6CC4;&#x6F0F;&#x201D;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x662F; <code>#include</code> &#x6587;&#x4EF6;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x95EE;&#x9898;&#x3002;<code>#include</code> &#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x6240;&#x6709;&#x540E;&#x7EED;&#x7684; <code>#include</code>&#x3002;</p>
</blockquote>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x987A;&#x5E8F;&#x72EC;&#x7ACB;&#x6027;&#x662F;&#x201C;&#x4EE3;&#x7801;&#x536B;&#x751F;&#x201D;&#x548C;&#x6027;&#x80FD;&#x7684;&#x5173;&#x952E;&#x3002;&#x901A;&#x8FC7;&#x575A;&#x6301;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#xFF0C;Gabriel Dos Reis &#x7684;&#x6A21;&#x5757;&#x5B9E;&#x73B0;&#x4E5F;&#x6BD4;&#x4F7F;&#x7528;&#x5934;&#x6587;&#x4EF6;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#x4E0A;&#x5F97;&#x5230;&#x4E86; 10 &#x500D;&#x91CF;&#x7EA7;&#x7684;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x2014;&#x2014;&#x5373;&#x4F7F;&#x5728;&#x65E7;&#x5F0F;&#x7F16;&#x8BD1;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x9884;&#x7F16;&#x8BD1;&#x5934;&#x6587;&#x4EF6;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x8FCE;&#x5408;&#x4F20;&#x7EDF;&#x5934;&#x6587;&#x4EF6;&#x548C;&#x5B8F;&#x7684;&#x5E38;&#x89C4;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x5C06;&#x6A21;&#x5757;&#x5355;&#x5143;&#x4FDD;&#x6301;&#x4E3A;&#x5141;&#x8BB8;&#x5B8F;&#x66FF;&#x6362;&#xFF08;&#x201C;&#x6807;&#x8BB0;&#x6C64;&#x201D;&#xFF09;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x800C;&#x4E0D;&#x662F; C++ &#x903B;&#x8F91;&#x5B9E;&#x4F53;&#x7684;&#x56FE;&#x3002;</p>
<p>&#x7ECF;&#x8FC7;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6298;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x8FBE;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x88AB;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x4E00;&#x591A;&#x5E74;&#x52AA;&#x529B;&#x7684;&#x5173;&#x952E;&#x4EBA;&#x7269;&#x6709; Richard Smith&#xFF08;&#x8C37;&#x6B4C;&#xFF09;&#x548C; Gabriel Dos Reis&#xFF08;&#x5FAE;&#x8F6F;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA; GCC &#x7684;&#x6A21;&#x5757;&#x5B9E;&#x73B0;&#x8005; Nathan Sidwell&#xFF08;Facebook&#xFF09;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x8D21;&#x732E;&#x8005; [Dos Reis and Smith 2018a,b; Smith and Dos Reis 2018]&#x3002;&#x4ECE; 2018 &#x5E74;&#x5E74;&#x4E2D;&#x5F00;&#x59CB;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x8BA8;&#x8BBA;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x9700;&#x8981;&#x7CBE;&#x786E;&#x89C4;&#x8303;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x4E0A;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5B9E;&#x73B0;&#x4E4B;&#x95F4;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027; [Sidwell 2018; Sidwell and Herring 2019]&#x3002;</p>
<p>&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#x6240;&#x793A;&#x7684; C++20 &#x6A21;&#x5757;&#x7684;&#x7B80;&#x5355;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">export</span> module map_printer;  <span class="hljs-comment">// &#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6A21;&#x5757;</span>

import iostream;       <span class="hljs-comment">// &#x4F7F;&#x7528; iostream</span>
import containers;     <span class="hljs-comment">// &#x4F7F;&#x7528;&#x6211;&#x81EA;&#x5DF1;&#x7684; containers</span>
<span class="hljs-keyword">using</span> <span class="hljs-keyword">namespace</span> <span class="hljs-built_in">std</span>;

<span class="hljs-keyword">export</span>                 <span class="hljs-comment">// &#x8BA9; print_map() &#x5BF9; map_printer &#x7684;&#x7528;&#x6237;&#x53EF;&#x7528;</span>
<span class="hljs-keyword">template</span>&lt;Sequence S&gt;
    requires Printable&lt;Key_type&lt;S&gt;&gt; &amp;&amp; Printable&lt;Value_type&lt;S&gt;&gt;
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">print_map</span><span class="hljs-params">(<span class="hljs-keyword">const</span> S&amp; m)</span> </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">const</span> <span class="hljs-keyword">auto</span>&amp; [key,val] : m)  <span class="hljs-comment">// &#x5206;&#x79BB;&#x952E;&#x548C;&#x503C;</span>
        <span class="hljs-built_in">cout</span> &lt;&lt; key &lt;&lt; <span class="hljs-string">&quot; -&gt; &quot;</span> &lt;&lt; val &lt;&lt; <span class="hljs-string">&apos;\n&apos;</span>;
}
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6A21;&#x5757; <code>map_printer</code>&#xFF0C;&#x8BE5;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x51FD;&#x6570; <code>print_map</code> &#x4F5C;&#x4E3A;&#x5176;&#x7528;&#x6237;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E86;&#x4ECE;&#x6A21;&#x5757; <code>iostream</code> &#x548C; <code>containers</code> &#x5BFC;&#x5165;&#x7684;&#x529F;&#x80FD;&#x6765;&#x5B9E;&#x73B0;&#x8BE5;&#x51FD;&#x6570;&#x3002;&#x4E3A;&#x4E86;&#x5F3A;&#x8C03;&#x4E0E;&#x65E7;&#x7684; C++ &#x98CE;&#x683C;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x4E86;&#x6982;&#x5FF5;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x548C;&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;&#xFF08;<a href="08.html#82-&#x7ED3;&#x6784;&#x5316;&#x7ED1;&#x5B9A;">&#xA7;8.2</a>&#xFF09;&#x3002;</p>
<p>&#x5173;&#x952E;&#x601D;&#x60F3;&#xFF1A;</p>
<ul>
<li><code>export</code> &#x6307;&#x4EE4;&#x4F7F;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x88AB; <code>import</code> &#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x4E2D;&#x3002;</li>
<li><code>import</code> &#x6307;&#x4EE4;&#x4F7F;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757; <code>export</code> &#x51FA;&#x6765;&#x7684;&#x5B9E;&#x4F53;&#x80FD;&#x591F;&#x88AB;&#x4F7F;&#x7528;&#x3002;</li>
<li><code>import</code> &#x7684;&#x5B9E;&#x4F53;&#x4E0D;&#x4F1A;&#x88AB;&#x9690;&#x5F0F;&#x5730;&#x518D; <code>export</code> &#x51FA;&#x53BB;&#x3002;</li>
<li><code>import</code> &#x4E0D;&#x4F1A;&#x5C06;&#x5B9E;&#x4F53;&#x6DFB;&#x52A0;&#x5230;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF1B;&#x5B83;&#x53EA;&#x4F1A;&#x4F7F;&#x5B9E;&#x4F53;&#x80FD;&#x88AB;&#x4F7F;&#x7528;&#xFF08;&#x56E0;&#x6B64;&#xFF0C;&#x672A;&#x4F7F;&#x7528;&#x7684; <code>import</code> &#x57FA;&#x672C;&#x4E0A;&#x662F;&#x65E0;&#x5F00;&#x9500;&#x7684;&#xFF09;&#x3002;</li>
</ul>
<p>&#x6700;&#x540E;&#x4E24;&#x70B9;&#x4E0D;&#x540C;&#x4E8E; <code>#include</code>&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x5BF9;&#x4E8E;&#x6A21;&#x5757;&#x5316;&#x548C;&#x7F16;&#x8BD1;&#x671F;&#x6027;&#x80FD;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x7EAF;&#x7CB9;&#x662F;&#x57FA;&#x4E8E;&#x6A21;&#x5757;&#x7684;&#xFF1B;&#x8FD9;&#x662F;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5DF2;&#x7ECF;&#x90E8;&#x7F72;&#x7684; C++ &#x4EE3;&#x7801;&#x4E5F;&#x8BB8;&#x6709;&#x4E94;&#x5343;&#x4EBF;&#x884C;&#xFF0C;&#x800C;&#x5934;&#x6587;&#x4EF6;&#x548C; <code>#include</code> &#x5E76;&#x4E0D;&#x4F1A;&#x5728;&#x4E00;&#x591C;&#x4E4B;&#x95F4;&#x88AB;&#x6DD8;&#x6C70;&#xFF0C;&#x53EF;&#x80FD;&#x518D;&#x8FC7;&#x51E0;&#x5341;&#x5E74;&#x90FD;&#x4E0D;&#x4F1A;&#x3002;&#x597D;&#x51E0;&#x4E2A;&#x4EBA;&#x548C;&#x7EC4;&#x7EC7;&#x6307;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x8FC7;&#x6E21;&#x673A;&#x5236;&#xFF0C;&#x4F7F;&#x5F97;&#x5934;&#x6587;&#x4EF6;&#x548C;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5171;&#x5B58;&#xFF0C;&#x5E76;&#x8BA9;&#x5E93;&#x4E3A;&#x4E0D;&#x540C;&#x4EE3;&#x7801;&#x6210;&#x719F;&#x5EA6;&#x7684;&#x7528;&#x6237;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x5934;&#x6587;&#x4EF6;&#x548C;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x65F6;&#x523B;&#xFF0C;&#x90FD;&#x6709;&#x7528;&#x6237;&#x4F9D;&#x8D56; 10 &#x5E74;&#x524D;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5728;&#x65E0;&#x6CD5;&#x4FEE;&#x6539; <code>iostream</code> &#x548C; <code>container</code> &#x5934;&#x6587;&#x4EF6;&#x7684;&#x7EA6;&#x675F;&#x4E0B;&#x5B9E;&#x73B0; <code>map_printer</code>&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">export</span> module map_printer;  <span class="hljs-comment">// &#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6A21;&#x5757;</span>

import &lt;iostream&gt;      <span class="hljs-comment">// &#x4F7F;&#x7528; iostream &#x5934;&#x6587;&#x4EF6;</span>
import <span class="hljs-string">&quot;containers&quot;</span>    <span class="hljs-comment">// &#x4F7F;&#x7528;&#x6211;&#x81EA;&#x5DF1;&#x7684; containers &#x5934;&#x6587;&#x4EF6;</span>
<span class="hljs-keyword">using</span> <span class="hljs-keyword">namespace</span> <span class="hljs-built_in">std</span>;

<span class="hljs-keyword">export</span>                 <span class="hljs-comment">// &#x8BA9; print_map() &#x5BF9; map_printer &#x7684;&#x7528;&#x6237;&#x53EF;&#x7528;</span>
<span class="hljs-keyword">template</span>&lt;Sequence S&gt;
    requires Printable&lt;Key_type&lt;S&gt;&gt; &amp;&amp; Printable&lt;Value_type&lt;S&gt;&gt;
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">print_map</span><span class="hljs-params">(<span class="hljs-keyword">const</span> S&amp; m)</span> </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">const</span> <span class="hljs-keyword">auto</span>&amp; [key,val] : m)  <span class="hljs-comment">// &#x5206;&#x79BB;&#x952E;&#x548C;&#x503C;</span>
        <span class="hljs-built_in">cout</span> &lt;&lt; key &lt;&lt; <span class="hljs-string">&quot; -&gt; &quot;</span> &lt;&lt; val &lt;&lt; <span class="hljs-string">&apos;\n&apos;</span>;
}
</code></pre>
<p>&#x6307;&#x540D;&#x67D0;&#x4E2A;&#x5934;&#x6587;&#x4EF6;&#x7684; <code>import</code> &#x6307;&#x4EE4;&#x5DE5;&#x4F5C;&#x8D77;&#x6765;&#x51E0;&#x4E4E;&#x4E0E; <code>#include</code> &#x5B8C;&#x5168;&#x4E00;&#x6837;&#x2014;&#x2014;&#x5B8F;&#x3001;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x4EE5;&#x53CA;&#x9012;&#x5F52;&#x5730; <code>#include</code> &#x5230;&#x7684;&#x5934;&#x6587;&#x4EF6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x786E;&#x4FDD; <code>import</code> &#x5BFC;&#x5165;&#x7684;&#x201C;&#x65E7;&#x5934;&#x6587;&#x4EF6;&#x201D;&#x4E0D;&#x4F1A;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5934;&#x6587;&#x4EF6;&#x7684; <code>import</code> &#x662F;&#x987A;&#x5E8F;&#x65E0;&#x5173;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x63D0;&#x4F9B;&#x4E86;&#x90E8;&#x5206;&#x3001;&#x4F46;&#x5E76;&#x975E;&#x5168;&#x90E8;&#x7684;&#x6A21;&#x5757;&#x5316;&#x7684;&#x597D;&#x5904;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x50CF; <code>import &lt;iostream&gt;</code> &#x8FD9;&#x6837;&#x5BFC;&#x5165;&#x5355;&#x4E2A;&#x5934;&#x6587;&#x4EF6;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5C31;&#x9700;&#x8981;&#x53BB;&#x51B3;&#x5B9A;&#x8BE5;&#x5BFC;&#x5165;&#x54EA;&#x4E9B;&#x5934;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x56E0;&#x4E3A;&#x4E0E;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x591A;&#x6B21;&#x4EA4;&#x4E92;&#x800C;&#x964D;&#x4F4E;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#xFF0C;&#x8FD8;&#x9650;&#x5236;&#x4E86;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x5934;&#x6587;&#x4EF6;&#x7684;&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;&#x7684;&#x9884;&#x7F16;&#x8BD1;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x9897;&#x7C92;&#x5EA6;&#x66F4;&#x7C97;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x6807;&#x51C6;&#x7684; <code>import std</code> &#x8868;&#x793A;&#x8BA9;&#x6574;&#x4E2A;&#x6807;&#x51C6;&#x5E93;&#x90FD;&#x53EF;&#x7528;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x66F4;&#x6709;&#x96C4;&#x5FC3;&#x7684;&#x6807;&#x51C6;&#x5E93;&#x91CD;&#x6784; [Clow et al. 2018] &#x5FC5;&#x987B;&#x8981;&#x63A8;&#x8FDF;&#x5230; C++23&#xFF08;<a href="11.html#115-&#x672A;&#x6765;">&#xA7;11.5</a>&#xFF09;&#x4E86;&#x3002;</p>
<p>&#x50CF; <code>import</code> &#x5934;&#x6587;&#x4EF6;&#x8FD9;&#x6837;&#x7684;&#x529F;&#x80FD;&#x662F;&#x8C37;&#x6B4C;/Clang &#x63D0;&#x6848;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x6709;&#x4E9B;&#x5E93;&#x7684;&#x4E3B;&#x8981;&#x63A5;&#x53E3;&#x5C31;&#x662F;&#x4E00;&#x5806;&#x5B8F;&#x3002;</p>
<p>&#x5728;&#x8BBE;&#x8BA1;/&#x5B9E;&#x73B0;/&#x6807;&#x51C6;&#x5316;&#x5DE5;&#x4F5C;&#x7684;&#x540E;&#x671F;&#xFF0C;&#x53CD;&#x5BF9;&#x610F;&#x89C1;&#x96C6;&#x4E2D;&#x5728;&#x6A21;&#x5757;&#x5BF9;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x4E0A;&#x3002;&#x5F53;&#x524D; C &#x548C; C++ &#x7684;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x5BF9;&#x5904;&#x7406;&#x5934;&#x6587;&#x4EF6;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x5927;&#x91CF;&#x4F18;&#x5316;&#x3002;&#x6570;&#x5341;&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#x5DF2;&#x7ECF;&#x82B1;&#x8D39;&#x5728;&#x4F18;&#x5316;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x4E00;&#x4E9B;&#x4E0E;&#x4F20;&#x7EDF;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x4EBA;&#x8868;&#x793A;&#x6000;&#x7591;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4E0D;&#x7ECF;&#xFF08;&#x8D1F;&#x62C5;&#x4E0D;&#x8D77;&#x7684;&#xFF09;&#x91CD;&#x5927;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x5C31;&#x987A;&#x5229;&#x5F15;&#x5165;&#x6A21;&#x5757;&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#x7684;&#x6784;&#x5EFA;&#x4F1A;&#x4E0D;&#x5141;&#x8BB8;&#x5E76;&#x884C;&#x7F16;&#x8BD1;&#xFF08;&#x56E0;&#x4E3A;&#x5F53;&#x524D;&#x8981;&#x5BFC;&#x5165;&#x7684;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#x4E8E;&#x67D0;&#x4E2A;&#x5148;&#x524D;&#x5DF2;&#x5BFC;&#x5165;&#x6A21;&#x5757;&#x7684;&#x7F16;&#x8BD1;&#x7ED3;&#x679C;&#xFF09;[Bindels et al. 2018; Lopes et al. 2019; Rivera 2019a]&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x65E9;&#x671F;&#x5370;&#x8C61;&#x8FC7;&#x4E8E;&#x60B2;&#x89C2;&#x4E86; [Rivera 2019b]&#xFF0C;build2 &#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x4E3A;&#x5904;&#x7406;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x6539;&#xFF0C;&#x5FAE;&#x8F6F;&#x548C;&#x8C37;&#x6B4C;&#x62A5;&#x544A;&#x8BF4;&#x4ED6;&#x4EEC;&#x7684;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x5728;&#x5904;&#x7406;&#x6A21;&#x5757;&#x65B9;&#x9762;&#x663E;&#x793A;&#x51FA;&#x826F;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6700;&#x540E; Nathan Sidwell &#x62A5;&#x544A;&#x8BF4;&#x4ED6;&#x5728;&#x4EC5;&#x4E24;&#x5468;&#x7684;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x91CC;&#x4FEE;&#x6539;&#x4E86; GNU &#x7684;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x6765;&#x5904;&#x7406;&#x6A21;&#x5757; [Sidwell 2019]&#x3002;&#x8FD9;&#x4E9B;&#x7ECF;&#x9A8C;&#x7684;&#x6700;&#x7EC8;&#x6F14;&#x793A;&#x53CA;&#x5173;&#x952E;&#x6A21;&#x5757;&#x5B9E;&#x73B0;&#x8005;&#xFF08;Gabriel Dos Reis&#x3001;Nathan Sidwell&#x3001;Richard Smith &#x548C; David Vandevoorde&#xFF09;&#x7684;&#x8054;&#x7F72;&#x8BBA;&#x6587;&#x6253;&#x52A8;&#x4E86;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x53CD;&#x5BF9;&#x8005; [Dos Reis et al. 2019]&#x3002;</p>
<p>&#x5728; 2019 &#x5E74; 2 &#x6708;&#xFF0C;&#x6A21;&#x5757;&#x5F97;&#x5230;&#x4E86; 46 &#x6BD4; 6 &#x7684;&#x591A;&#x6570;&#x7968;&#xFF0C;&#x8FDB;&#x5165;&#x4E86; C++20&#xFF1B;&#x6295;&#x7968;&#x8005;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x7684;&#x5B9E;&#x73B0;&#x8005; [Smith 2019]&#x3002;&#x5728;&#x90A3;&#x65F6;&#xFF0C;&#x4E3B;&#x8981;&#x7684; C++ &#x5B9E;&#x73B0;&#x5DF2;&#x7ECF;&#x63A5;&#x8FD1; C++20 &#x6807;&#x51C6;&#x3002;&#x6A21;&#x5757;&#x6709;&#x671B;&#x6210;&#x4E3A; C++20 &#x63D0;&#x4F9B;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5355;&#x9879;&#x6539;&#x8FDB;&#x3002;</p>
<h3 id="932-&#x534F;&#x7A0B;">9.3.2 &#x534F;&#x7A0B;</h3>
<p>&#x534F;&#x7A0B;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x534F;&#x4F5C;&#x5F0F;&#x591A;&#x4EFB;&#x52A1;&#x6A21;&#x578B;&#xFF0C;&#x6BD4;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x6216;&#x8FDB;&#x7A0B;&#x8981;&#x9AD8;&#x6548;&#x5F97;&#x591A;&#x3002;&#x534F;&#x7A0B;&#x66FE;&#x662F;&#x65E9;&#x671F; C++ &#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x534F;&#x7A0B;&#x7684;&#x4EFB;&#x52A1;&#x5E93;&#xFF0C;C++ &#x5C06;&#x80CE;&#x6B7B;&#x8179;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x591A;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x534F;&#x7A0B;&#x5E76;&#x6CA1;&#x6709;&#x8FDB;&#x5165; C++98 &#x6807;&#x51C6;&#xFF08;<a href="01.html#11-&#x5E74;&#x8868;">&#xA7;1.1</a>&#xFF09;&#x3002;</p>
<p>C++20 &#x534F;&#x7A0B;&#x7684;&#x5386;&#x53F2;&#x59CB;&#x4E8E; Niklas Gustafsson&#xFF08;&#x5FAE;&#x8F6F;&#xFF09;&#x5173;&#x4E8E;&#x201C;&#x53EF;&#x6062;&#x590D;&#x51FD;&#x6570;&#x201D;&#x7684;&#x63D0;&#x6848; [Gustafsson 2012]&#x3002;&#x5176;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x652F;&#x6301;&#x5F02;&#x6B65; I/O&#xFF1B;&#x201C;&#x80FD;&#x591F;&#x5904;&#x7406;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x6216;&#x4EE5;&#x767E;&#x4E07;&#x8BA1;&#x5BA2;&#x6237;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x201D;[Kohlhoff 2013]&#x3002;&#x5B83;&#x76F8;&#x5F53;&#x4E8E;&#x5F53;&#x65F6;&#x5F15;&#x5165;&#x5230; C#&#xFF08;2015 &#x5E74;&#x7684; 6.0 &#x7248;&#xFF09;&#x7684; async/await &#x529F;&#x80FD;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E8E; Python&#x3001;JavaScript &#x548C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x91CC;&#x3002;Niklas &#x7684;&#x63D0;&#x6848;&#x5F15;&#x53D1;&#x4E86;&#x6765;&#x81EA; Oliver Kowalke &#x548C; Nat Goodspeed [Kowalke and Goodspeed 2013] &#x7684;&#x57FA;&#x4E8E; Boost.Coroutine &#x7684;&#x7ADE;&#x4E89;&#x63D0;&#x6848;&#xFF0C;&#x5E76;&#x5F15;&#x8D77;&#x4E86;&#x4EBA;&#x4EEC;&#x7684;&#x6D53;&#x539A;&#x5174;&#x8DA3;&#x3002;<code>await</code> &#x8BBE;&#x8BA1;&#x65E0;&#x6808;&#x3001;&#x4E0D;&#x5BF9;&#x79F0;&#x4E14;&#x9700;&#x8981;&#x8BED;&#x8A00;&#x652F;&#x6301;&#xFF0C;&#x800C;&#x6E90;&#x81EA; Boost &#x7684;&#x8BBE;&#x8BA1;&#x5219;&#x4F7F;&#x7528;&#x6808;&#x3001;&#x5177;&#x6709;&#x5BF9;&#x79F0;&#x63A7;&#x5236;&#x539F;&#x8BED;&#x4E14;&#x57FA;&#x4E8E;&#x5E93;&#x3002;&#x65E0;&#x6808;&#x534F;&#x7A0B;&#x53EA;&#x80FD;&#x5728;&#x5176;&#x81EA;&#x8EAB;&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#x6302;&#x8D77;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x4ECE;&#x5176;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#x6302;&#x8D77;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6302;&#x8D77;&#x4EC5;&#x6D89;&#x53CA;&#x4FDD;&#x5B58;&#x5355;&#x4E2A;&#x6808;&#x5E27;&#xFF08;&#x201C;&#x534F;&#x7A0B;&#x72B6;&#x6001;&#x201D;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4FDD;&#x5B58;&#x6574;&#x4E2A;&#x6808;&#x3002;&#x5BF9;&#x4E8E;&#x6027;&#x80FD;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x534F;&#x7A0B;&#x7684;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#x5F88;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x96BE;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x4EBA;&#xFF08;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#xFF09;&#x90FD;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x7FA4;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x6210;&#x5458;&#x5BF9;&#x53EF;&#x9009;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x6790; [Goodspeed 2014]&#x3002;&#x7ED3;&#x8BBA;&#x662F;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5229;&#x7528;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x4F46;&#x8FD9;&#x9700;&#x8981;&#x8BA4;&#x771F;&#x7814;&#x7A76;&#x3002;&#x8FD9;&#x9879;&#x7814;&#x7A76;&#x82B1;&#x4E86;&#x6570;&#x5E74;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x5F97;&#x51FA;&#x660E;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x63D0;&#x6848;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x7684;&#x5E76;&#x53D1;&#x4E3B;&#x9898;&#xFF08;<a href="08.html#84-&#x5E76;&#x53D1;">&#xA7;8.4</a>&#xFF09;&#xFF0C;&#x5BF9;&#x6240;&#x7F16;&#x5199;&#x3001;&#x6F14;&#x793A;&#x548C;&#x8BA8;&#x8BBA;&#x7684;&#x63D0;&#x6848;&#x7684;&#x5B8C;&#x6574;&#x89E3;&#x91CA;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x6587;&#x7684;&#x8303;&#x56F4;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x53EA;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x6982;&#x51B5;&#x3002;&#x56E0;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x7EC6;&#x8282;&#x7B80;&#x76F4;&#x592A;&#x591A;&#xFF0C;&#x5728;&#x6B64;&#x4E5F;&#x53EA;&#x80FD;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF1B;&#x4EC5;&#x8BBA;&#x6587;&#x5C31;&#x6709;&#x6570;&#x767E;&#x9875;&#xFF0C;&#x8BB8;&#x591A;&#x8BA8;&#x8BBA;&#x90FD;&#x53D6;&#x51B3;&#x4E8E;&#x9AD8;&#x7EA7;&#x7528;&#x4F8B;&#x7684;&#xFF08;&#x6709;&#x65F6;&#x662F;&#x5047;&#x8BBE;&#x7684;&#xFF09;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x5B9E;&#x73B0;&#x7684;&#x6027;&#x80FD;&#x3002;&#x8BA8;&#x8BBA;&#x53D1;&#x751F;&#x5728; SG1&#xFF08;&#x5E76;&#x53D1;&#xFF09;&#x3001;EWG&#xFF08;&#x6F14;&#x5316;&#xFF09;&#x3001;LEWG&#xFF08;&#x5E93;&#x6F14;&#x5316;&#xFF09;&#x3001;CWG&#xFF08;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#xFF09;&#x3001;LWG&#xFF08;&#x5E93;&#xFF09;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x665A;&#x95F4;&#x4F1A;&#x8BAE;&#x548C;&#x5168;&#x4F53;&#x4F1A;&#x8BAE;&#x4E0A;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x8BA8;&#x8BBA;&#x548C;&#x63D0;&#x6848;&#x4E2D;&#xFF0C;&#x4E09;&#x79CD;&#x60F3;&#x6CD5;&#x53CD;&#x590D;&#x51FA;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x5C06;&#x534F;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x53CA;&#x5176;&#x64CD;&#x4F5C;&#x8868;&#x793A;&#x4E3A; lambda &#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x534F;&#x7A0B;&#x4F18;&#x96C5;&#x5730;&#x9002;&#x914D; C++ &#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981; <code>await</code> &#x5F0F;&#x534F;&#x7A0B; [Kohlhoff 2013] &#x6240;&#x4F7F;&#x7528;&#x7684;&#x67D0;&#x4E9B;&#x201C;&#x7F16;&#x8BD1;&#x5668;&#x9B54;&#x6CD5;&#x201D;&#x3002;</li>
<li>&#x4E3A;&#x65E0;&#x6808;&#x548C;&#x6709;&#x6808;&#x534F;&#x7A0B;&#x63D0;&#x4F9B;&#x901A;&#x7528;&#x63A5;&#x53E3;&#x2014;&#x2014;&#x4E5F;&#x53EF;&#x80FD;&#x4E3A;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x5E76;&#x53D1;&#x673A;&#x5236;&#xFF0C;&#x4F8B;&#x5982;&#x7EBF;&#x7A0B;&#x548C;&#x7EA4;&#x7A0B;&#xFF0C;&#x63D0;&#x4F9B;&#x901A;&#x7528;&#x63A5;&#x53E3;&#x3002;[Kowalke 2015; Riegel 2015]&#x3002;</li>
<li>&#x4E3A;&#x4E86;&#x5728;&#x6700;&#x7B80;&#x5355;&#x548C;&#x6700;&#x5173;&#x952E;&#x7684;&#x7528;&#x9014;&#xFF08;&#x751F;&#x6210;&#x5668;&#x548C;&#x7BA1;&#x9053;&#xFF09;&#x4E0A;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x6027;&#x80FD;&#xFF08;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#xFF09;&#xFF0C;&#x65E0;&#x6808;&#x534F;&#x7A0B;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x5668;&#x652F;&#x6301;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x7528;&#x4F8B;&#x800C;&#x5728;&#x63A5;&#x53E3;&#x4E0A;&#x4F5C;&#x59A5;&#x534F; [Nishanov 2018&#xFF0C;2019b]&#x3002;</li>
</ul>
<p>&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E09;&#x8005;&#x3002;&#x6211;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x901A;&#x7528;&#x63A5;&#x53E3;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x5B66;&#x4E60;&#x9700;&#x8981;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x5E76;&#x4F7F;&#x5F97;&#x5B9E;&#x9A8C;&#x5927;&#x4E3A;&#x4FBF;&#x6377;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x666E;&#x901A;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x8868;&#x793A;&#x534F;&#x7A0B;&#x5C06;&#x5F00;&#x653E;&#x6574;&#x4E2A;&#x8BED;&#x8A00;&#x6765;&#x652F;&#x6301;&#x534F;&#x7A0B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6700;&#x7EC8;&#x6027;&#x80FD;&#x8BBA;&#x80DC;&#x51FA;&#x3002;</p>
<p>&#x5728; 2017 &#x5E74;&#xFF0C;Gor Nishanov &#x57FA;&#x4E8E; <code>await</code> &#x65E0;&#x6808;&#x65B9;&#x5F0F;&#x7684;&#x63D0;&#x6848;&#x88AB;&#x63A5;&#x53D7;&#x4E3A; TS [Nishanov 2017]&#x3002;&#x8FD9;&#x4E00;&#x63D0;&#x6848;&#xFF08;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x88AB;&#x620F;&#x79F0;&#x4E3A;&#x201C;Gor-routines&#x201D;&#xFF09;&#x83B7;&#x5F97;&#x6279;&#x51C6;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5B83;&#x7684;&#x5B9E;&#x73B0;&#x5728;&#x5176;&#x5173;&#x952E;&#x7528;&#x4F8B;&#xFF08;&#x7BA1;&#x9053;&#x548C;&#x751F;&#x6210;&#x5668;&#xFF09;&#x4E2D;&#x8868;&#x73B0;&#x51FA;&#x4E86;&#x5353;&#x8D8A;&#x7684;&#x6027;&#x80FD; [Jonathan et al. 2018; Psaropoulos et al. 2017]&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x628A;&#x5B83;&#x5199;&#x6210; TS&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x653E;&#x5230;&#x6807;&#x51C6;&#x4E2D;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x8BB8;&#x591A;&#x4EBA;&#x559C;&#x6B22;&#x66F4;&#x901A;&#x7528;&#xFF08;&#x4F46;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#xFF09;&#x7684;&#x6709;&#x6808;&#x534F;&#x7A0B;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x4ECD;&#x7136;&#x5E0C;&#x671B;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x96F6;&#x5F00;&#x9500;&#x7EDF;&#x4E00;&#x3002;&#x6211;&#x5F53;&#x65F6;&#xFF08;&#x4ECA;&#x5929;&#x4ECD;&#x6CA1;&#x6709;&#x53D8;&#xFF09;&#x7684;&#x89C2;&#x70B9;&#x662F;&#xFF0C;&#x5728;&#x5408;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x6BB5;&#x91CC;&#xFF0C;&#x7EDF;&#x4E00;&#x5E76;&#x4E0D;&#x53EF;&#x80FD;&#x3002;&#x6211;&#x5DF2;&#x7ECF;&#x7B49;&#x4E86;&#x8FD1; 30 &#x5E74;&#x7684;&#x65F6;&#x95F4;&#x8BA9;&#x534F;&#x7A0B;&#x91CD;&#x65B0;&#x56DE;&#x5230; C++ &#x4E2D;&#xFF0C;&#x6211;&#x53EF;&#x4E0D;&#x60F3;&#x7B49;&#x5F85;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5230;&#x6765;&#x7684;&#x7A81;&#x7834;&#xFF1A;&#x201C;&#x6700;&#x597D;&#x662F;&#x597D;&#x7684;&#x654C;&#x4EBA;&#x3002;&#x201D;</p>
<p>&#x548C;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x547D;&#x540D;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;TS &#x8349;&#x6848;&#x4F7F;&#x7528;&#x4E86;&#x5173;&#x952E;&#x5B57; <code>yield</code>&#xFF0C;&#x8FD9;&#x5F88;&#x5FEB;&#x88AB;&#x5224;&#x5B9A;&#x4E3A;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x91D1;&#x878D;&#x548C;&#x519C;&#x4E1A;&#x9886;&#x57DF;&#xFF09;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x534F;&#x7A0B;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#x9700;&#x8981;&#x88AB;&#x5305;&#x5230;&#x4E00;&#x4E2A;&#x8C03;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x7B49;&#x5F85;&#x7684;&#x7ED3;&#x6784;&#x4E2D;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;<code>future</code>&#xFF08;<a href="04.html#413-&#x671F;&#x503C;future">&#xA7;4.1.3</a>&#xFF09;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x534F;&#x7A0B; <code>return</code> &#x8BED;&#x53E5;&#x7684;&#x8BED;&#x4E49;&#x4E0E;&#x666E;&#x901A; <code>return</code> &#x8BED;&#x53E5;&#x7684;&#x8BED;&#x4E49;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x5C31;&#x53CD;&#x5BF9; <code>return</code> &#x7684;&#x201C;&#x590D;&#x7528;&#x201D;&#x3002;&#x4F5C;&#x4E3A;&#x56DE;&#x5E94;&#xFF0C;&#x6F14;&#x5316;&#x5DE5;&#x4F5C;&#x7EC4;&#x5F15;&#x5165;&#x4E86;&#x5173;&#x952E;&#x5B57; <code>co_return</code>&#x3001;<code>co_yield</code> &#x548C; <code>co_await</code>&#xFF0C;&#x7528;&#x4E8E;&#x534F;&#x7A0B;&#x4E2D;&#x7684;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x64CD;&#x4F5C;&#x3002;&#x4F7F;&#x7528;&#x4E0B;&#x5212;&#x7EBF;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x6BCD;&#x8BED;&#x4E3A;&#x82F1;&#x8BED;&#x7684;&#x4EBA;&#x5C06; <code>coreturn</code>&#x3001;<code>coyield</code> &#x548C; <code>coawait</code> &#x8BEF;&#x8BFB;&#x4E3A; <code>core-turn</code>&#x3001;<code>coy-ield</code> &#x548C; <code>coa-wait</code>&#x3002;&#x4EBA;&#x4EEC;&#x4E5F;&#x63A2;&#x7D22;&#x4E86;&#x4F7F; <code>yield</code> &#x548C; <code>await</code> &#x6210;&#x4E3A;&#x4E0A;&#x4E0B;&#x6587;&#x654F;&#x611F;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x3002;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x5E76;&#x4E0D;&#x6F02;&#x4EAE;&#xFF0C;&#x5B83;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x90A3;&#x4E9B;&#x51FA;&#x4E8E;&#x4EFB;&#x4F55;&#x539F;&#x56E0;&#x4E0D;&#x559C;&#x6B22; TS &#x534F;&#x7A0B;&#x7684;&#x4EBA;&#x4EEC;&#x7684;&#x9776;&#x5B50;&#x3002;</p>
<p>&#x5728; 2018 &#x5E74;&#xFF0C;TS &#x534F;&#x7A0B;&#x88AB;&#x63D0;&#x8BAE;&#x7EB3;&#x5165; C++20 &#x6807;&#x51C6;&#xFF0C;&#x4F46;&#x5728;&#x6700;&#x540E;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x6765;&#x81EA;&#x8C37;&#x6B4C;&#x7684; Geoff Romer&#x3001;James Dennett &#x548C; Chandler Carruth &#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x65B0;&#x624B;&#x9887;&#x4E0D;&#x53CB;&#x597D;&#x7684;&#x63D0;&#x6848; [Romer et al. 2018]&#x3002;&#x8C37;&#x6B4C;&#x7684;&#x63D0;&#x6848;&#x540D;&#x4E3A;&#x201C;&#x6838;&#x5FC3;&#x534F;&#x7A0B;&#x201D;&#xFF08;Core Coroutines&#xFF09;&#xFF0C;&#x5B83;&#x548C; Gor &#x7684;&#x63D0;&#x6848;&#x4E00;&#x6837;&#xFF0C;&#x9700;&#x8981;&#x5E93;&#x652F;&#x6301;&#x6765;&#x4F7F;&#x57FA;&#x672C;&#x673A;&#x5236;&#x5BF9;&#x975E;&#x4E13;&#x5BB6;&#x7528;&#x6237;&#x53D8;&#x5F97;&#x53CB;&#x597D;&#x3002;&#x6240;&#x9700;&#x8981;&#x7684;&#x5E93;&#x5F53;&#x65F6;&#x8FD8;&#x6CA1;&#x6709;&#x8BBE;&#x8BA1;&#x597D;&#x3002;&#x6838;&#x5FC3;&#x534F;&#x7A0B;&#x88AB;&#x5BA3;&#x79F0;&#x6BD4; TS &#x534F;&#x7A0B;&#x66F4;&#x9AD8;&#x6548;&#xFF0C;&#x5E76;&#x4E14;&#x89E3;&#x51B3;&#x4E86;&#x8C37;&#x6B4C;&#x7684;&#x4E00;&#x4E2A;&#x7528;&#x4F8B;&#xFF0C;&#x7528;&#x4E8E;&#x4E0D;&#x57FA;&#x4E8E;&#x5F02;&#x5E38;&#x7684;&#x9519;&#x8BEF;&#x4F20;&#x64AD;&#x3002;&#x5176;&#x601D;&#x60F3;&#x57FA;&#x4E8E;&#x5C06;&#x534F;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x8868;&#x793A;&#x4E3A; lambda &#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x9119;&#x89C6;&#x7684;&#x5173;&#x952E;&#x8BCD; <code>co_return</code>&#x3001;<code>co_yield</code> &#x548C; <code>co_await</code>&#xFF0C;&#x6838;&#x5FC3;&#x534F;&#x7A0B;&#x63D0;&#x4F9B;&#x4E86;&#x636E;&#x79F0;&#x66F4;&#x53CB;&#x597D;&#x7684;&#x8FD0;&#x7B97;&#x7B26; <code>[-&gt;]</code> &#x548C; <code>[&lt;-]</code>&#x3002;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;<code>[-&gt;]</code> &#x6709;&#x56DB;&#x4E2A;&#x5B57;&#x7B26;&#x957F;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x56DB;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x201C;<code>[</code>&#x201D;&#x548C;&#x201C;<code>]</code>&#x201D;&#x662F;&#x6807;&#x8BB0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6838;&#x5FC3;&#x534F;&#x7A0B;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x7528;&#x6027;&#x548C;&#x6548;&#x7387;&#x7684;&#x4E3B;&#x5F20;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#x3002;&#x8FD9;&#x63A8;&#x8FDF;&#x4E86;&#x5173;&#x4E8E;&#x534F;&#x7A0B;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x51B3;&#x5B9A;&#x3002;</p>
<p>TS &#x534F;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x4E14;&#x53EF;&#x80FD;&#x81F4;&#x547D;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x81EA;&#x7531;&#x5B58;&#x50A8;&#x533A;&#xFF08;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x3001;&#x5806;&#xFF09;&#x4E0A;&#x7684;&#x5206;&#x914D;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x5927;&#x7684;&#x5F00;&#x9500;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BB8;&#x591A;&#x5173;&#x952E;&#x7684;&#x5B9E;&#x65F6;&#x548C;&#x5D4C;&#x5165;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x81EA;&#x7531;&#x5B58;&#x50A8;&#x533A;&#x7684;&#x4F7F;&#x7528;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x548C;&#x5185;&#x5B58;&#x788E;&#x7247;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x6838;&#x5FC3;&#x534F;&#x7A0B;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7136;&#x800C;&#xFF0C;Gor Nishanov &#x548C; Richard Smith &#x8BBA;&#x8BC1;&#x4E86;&#xFF0C;TS &#x534F;&#x7A0B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x4FDD;&#x8BC1;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7528;&#x6CD5;&#x4E0B;&#x90FD;&#x4E0D;&#x4F7F;&#x7528;&#x81EA;&#x7531;&#x5B58;&#x50A8;&#x533A;&#xFF08;&#x5E76;&#x5BF9;&#x5176;&#x4ED6;&#x7528;&#x6CD5;&#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#x548C;&#x9884;&#x9632;&#xFF09;[Smith and Nishanov 2018]&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x5173;&#x952E;&#x7528;&#x4F8B;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5C06;&#x81EA;&#x7531;&#x5B58;&#x50A8;&#x533A;&#x4F7F;&#x7528;&#x4F18;&#x5316;&#x4E3A;&#x6808;&#x5206;&#x914D;&#xFF08;&#x6240;&#x8C13;&#x7684;&#x201C;Halo &#x4F18;&#x5316;&#x201D;<sup><a href="#fn_1" id="reffn_1">1</a></sup>&#xFF09;&#x3002;</p>
<p>&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6838;&#x5FC3;&#x534F;&#x7A0B;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#x548C;&#x5B8C;&#x5584; [Romer et al. 2019a]&#xFF0C;&#x4F46;&#x5B8C;&#x6574;&#x7684;&#x5B9E;&#x73B0;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x3002;&#x5728; 2018 &#x5E74;&#xFF0C;&#x4FDD;&#x52A0;&#x5229;&#x4E9A;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x673A;&#x6784;&#x53CD;&#x5BF9; TS &#x534F;&#x7A0B;&#x8BBE;&#x8BA1; [Mihaylov and Vassilev 2018]&#xFF0C;&#x5E76;&#x63D0;&#x51FA;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1; [Mihaylov and Vassilev 2019]&#x3002;&#x53C8;&#x4E00;&#x6B21;&#xFF0C;&#x63D0;&#x6848;&#x5BA3;&#x79F0;&#x5177;&#x6709;&#x4F18;&#x96C5;&#x3001;&#x901A;&#x7528;&#x6027;&#x548C;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x6F14;&#x5316;&#x5C0F;&#x7EC4;&#x7684;&#x8D1F;&#x8D23;&#x4EBA; Ville Voutilainen &#x8981;&#x6C42;&#x8FD9;&#x4E09;&#x4E2A;&#x4ECD;&#x7136;&#x6D3B;&#x8DC3;&#x7684;&#x63D0;&#x6848;&#x7684;&#x4F5C;&#x8005;&#x64B0;&#x5199;&#x4E24;&#x4EFD;&#x8BC4;&#x4F30;&#x548C;&#x6BD4;&#x8F83;&#x8BBA;&#x6587;&#xFF1A;</p>
<ul>
<li><em>Coroutines: Use-cases and Trade-offs</em>&#xFF08;&#x300A;&#x534F;&#x7A0B;&#xFF1A;&#x7528;&#x4F8B;&#x4E0E;&#x53D6;&#x820D;&#x300B;&#xFF09;[Romer et al. 2019b]</li>
<li><em>Coroutines: Language and Implementation Impact</em>&#xFF08;&#x300A;&#x534F;&#x7A0B;&#xFF1A;&#x8BED;&#x8A00;&#x4E0E;&#x5B9E;&#x73B0;&#x5F71;&#x54CD;&#x300B;&#xFF09;[Smith et al. 2019]</li>
</ul>
<p>&#x8FD9;&#x4E09;&#x4E2A;&#x63D0;&#x6848;&#xFF08;Gor&#x3001;&#x8C37;&#x6B4C;&#x548C;&#x4FDD;&#x52A0;&#x5229;&#x4E9A;&#xFF09;&#x90FD;&#x662F;&#x65E0;&#x6808;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x6808;&#x7684;&#x7528;&#x4F8B;&#x88AB;&#x7559;&#x7ED9;&#x672A;&#x6765;&#x7684;&#x63D0;&#x6848;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x63D0;&#x6848;&#x90FD;&#x6709;&#x6570;&#x91CF;&#x60CA;&#x4EBA;&#x7684;&#x5B9A;&#x5236;&#x70B9; [Nishanov 2018]&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x5B9E;&#x73B0;&#x8005;&#x548C;&#x4E13;&#x5BB6;&#x7528;&#x6237;&#x90FD;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E9B;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x3002;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x63D0;&#x6848;&#x4E2D;&#xFF0C;&#x5173;&#x952E;&#x7528;&#x4F8B;&#x7684;&#x8868;&#x8FBE;&#x5E76;&#x6CA1;&#x6709;&#x663E;&#x8457;&#x4E0D;&#x540C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EA;&#x662F;&#x8868;&#x9762;&#x6587;&#x7AE0;&#xFF0C;&#x4E0D;&#x7528;&#x591A;&#x7406;&#x4F1A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>co_await</code> &#x6BD4; <code>[&lt;-]</code> &#x66F4;&#x4E11;&#x5417;&#xFF1F;</p>
<p>&#x8FD9;&#x5C31;&#x53EA;&#x7559;&#x4E0B;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x6709;&#x5F85;&#x8BA8;&#x8BBA;&#x3002;Gor &#x7684;&#x63D0;&#x6848;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x7740;&#x56DB;&#x5E74;&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x5728;&#x5FAE;&#x8F6F;&#x548C; Clang &#x7F16;&#x8BD1;&#x5668;&#x4E2D;&#x90FD;&#x6709;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x5177;&#x6709;&#x660E;&#x663E;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x5728; C++20 &#x7684;&#x5173;&#x952E;&#x6295;&#x7968;&#x4E4B;&#x524D;&#x7684;&#x6700;&#x540E;&#x51E0;&#x6B21;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x542C;&#x53D6;&#x4E86;&#x6765;&#x81EA; Sandia [Hollman 2019]&#x3001;&#x5FAE;&#x8F6F; [Jonathan et al. 2018] &#x548C; Facebook [Howes et al. 2018] &#x7684;&#x4EBA;&#x7684;&#x4F53;&#x9A8C;&#x62A5;&#x544A;&#xFF0C;&#x5E76;&#x8003;&#x8651;&#x4E86;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x57FA;&#x4E8E;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#x7684;&#x6539;&#x8FDB;&#x548C;&#x7B80;&#x5316;&#x7684;&#x5EFA;&#x8BAE; [Baker 2019]&#x3002;&#x7136;&#x800C;&#xFF0C;&#xFF08;&#x636E;&#x6211;&#x5224;&#x65AD;&#xFF09;&#x6253;&#x52A8;&#x59D4;&#x5458;&#x4F1A;&#x3001;&#x4F7F;&#x5176;&#x4EE5; 48 &#x6BD4; 4 &#x7684;&#x7EDD;&#x5BF9;&#x4F18;&#x52BF;&#x6295;&#x7968;&#x652F;&#x6301; Gor-routine &#x7684;&#x8981;&#x70B9;&#x662F;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x201C;&#x666E;&#x901A;&#x7684; lambda &#x8868;&#x8FBE;&#x5F0F;&#x201D;&#x6765;&#x4EE3;&#x8868;&#x534F;&#x7A0B;&#x72B6;&#x6001;&#x7684;&#x7B56;&#x7565;&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x6839;&#x672C;&#x6027;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x8868;&#x793A;&#x534F;&#x7A0B;&#x72B6;&#x6001;&#x7684; lambda &#x8868;&#x8FBE;&#x5F0F;&#x4E0E;&#x5176;&#x4ED6; lambda &#x8868;&#x8FBE;&#x5F0F;&#x4E00;&#x6837;&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x5C31;&#x77E5;&#x9053;&#x5176;&#x5927;&#x5C0F;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x5728;&#x6808;&#x4E0A;&#x5206;&#x914D;&#x534F;&#x7A0B;&#x72B6;&#x6001;&#x3001;&#x590D;&#x5236;&#x5B83;&#x4EEC;&#x3001;&#x79FB;&#x52A8;&#x5B83;&#x4EEC;&#xFF0C;&#x5E76;&#x4EE5;&#x8BED;&#x8A00;&#x5141;&#x8BB8;&#x7684;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x4F18;&#x5316;&#x5668;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#xFF0C;&#x6808;&#x5E27;&#xFF08;&#x6839;&#x672C;&#x4E0A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x65E0;&#x6808;&#x534F;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#xFF09;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x672A;&#x77E5;&#x7684;&#x3002;&#x6CA1;&#x6709;&#x4ECE;&#x4F18;&#x5316;&#x5668;&#x8FD4;&#x56DE;&#x5230;&#x7F16;&#x8BD1;&#x5668;&#x65E9;&#x671F;&#x9636;&#x6BB5;&#x7684;&#x4FE1;&#x606F;&#x8DEF;&#x5F84;&#x3002;&#x4F18;&#x5316;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x901A;&#x8FC7;&#x6D88;&#x9664;&#x53D8;&#x91CF;&#x6765;&#x51CF;&#x5C0F;&#x5E27;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x6709;&#x7528;&#x7684;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x6765;&#x589E;&#x52A0;&#x5E27;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7528;&#x6765;&#x4EE3;&#x8868;&#x67D0;&#x4E2A;&#x534F;&#x7A0B;&#x72B6;&#x6001;&#x7684; lambda &#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x80FD;&#x662F;&#x201C;&#x666E;&#x901A;&#x7684;&#x201D;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E2A; C++20 &#x534F;&#x7A0B;&#x7684;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-cpp">generator&lt;<span class="hljs-keyword">int</span>&gt; fibonacci()  <span class="hljs-comment">// &#x751F;&#x6210; 0,1,1,2,3,5,8,13 ...</span>
{
    <span class="hljs-keyword">int</span> a = <span class="hljs-number">0</span>;    <span class="hljs-comment">// &#x521D;&#x503C;</span>
    <span class="hljs-keyword">int</span> b = <span class="hljs-number">1</span>;

    <span class="hljs-keyword">while</span> (<span class="hljs-literal">true</span>) {
        <span class="hljs-keyword">int</span> next = a+b;
        co_yield a;    <span class="hljs-comment">// &#x8FD4;&#x56DE;&#x4E0B;&#x4E00;&#x4E2A;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;</span>
        a = b;         <span class="hljs-comment">// &#x66F4;&#x65B0;&#x503C;</span>
        b = next;
    }
}

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span>
</span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">auto</span> v : fibonacci())
        <span class="hljs-built_in">cout</span> &lt;&lt; v &lt;&lt; <span class="hljs-string">&apos;\n&apos;</span>;
}
</code></pre>
<p>&#x4F7F;&#x7528; <code>co_yield</code> &#x4F7F; <code>fibonacci()</code> &#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x534F;&#x7A0B;&#x3002;<code>generator&lt;int&gt;</code> &#x8FD4;&#x56DE;&#x503C;&#x5C06;&#x4FDD;&#x5B58;&#x751F;&#x6210;&#x7684;&#x4E0B;&#x4E00;&#x4E2A; <code>int</code> &#x548C; <code>fibonacci()</code> &#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x4E2A;&#x8C03;&#x7528;&#x6240;&#x9700;&#x7684;&#x6700;&#x5C0F;&#x72B6;&#x6001;&#x3002;&#x5BF9;&#x4E8E;&#x5F02;&#x6B65;&#x4F7F;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7528; <code>future&lt;int&gt;</code> &#x800C;&#x4E0D;&#x662F; <code>generator&lt;int&gt;</code>&#x3002;&#x5BF9;&#x534F;&#x7A0B;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x7684;&#x6807;&#x51C6;&#x5E93;&#x652F;&#x6301;&#x4ECD;&#x7136;&#x4E0D;&#x5B8C;&#x6574;&#xFF0C;&#x4E0D;&#x8FC7;&#x5E93;&#x5C31;&#x5E94;&#x8BE5;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#x6210;&#x719F;&#x3002;</p>
<p>&#x59D4;&#x5458;&#x4F1A;&#x672C;&#x6765;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x5904;&#x7406;&#x534F;&#x7A0B;&#x63D0;&#x6848;&#x5417;&#xFF1F;&#x4E5F;&#x8BB8;&#x53EF;&#x4EE5;&#x5427;&#xFF1B;C++20 &#x534F;&#x7A0B;&#x4E0E; Niklas Gustafsson 2012 &#x5E74;&#x7684;&#x63D0;&#x6848;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;&#x6211;&#x4EEC;&#x63A2;&#x7D22;&#x4E86;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x56FA;&#x7136;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x9700;&#x8981; 7 &#x5E74;&#x65F6;&#x95F4;&#x5417;&#xFF1F;&#x8BB8;&#x591A;&#x6709;&#x80FD;&#x529B;&#x7684;&#x4EBA;&#x6240;&#x505A;&#x7684;&#x5927;&#x91CF;&#x52AA;&#x529B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x66F4;&#x591A;&#x534F;&#x4F5C;&#x3001;&#x66F4;&#x5C11;&#x7ADE;&#x4E89;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x5B66;&#x672F;&#x77E5;&#x8BC6;&#x5728;&#x65E9;&#x671F;&#x9636;&#x6BB5;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x534F;&#x7A0B;&#x6709;&#x7EA6; 60 &#x5E74;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x4F8B;&#x5982; [Conway 1963]&#x3002;&#x4EBA;&#x4EEC;&#x662F;&#x77E5;&#x9053; C++ &#x548C;&#x76F8;&#x5173;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x73B0;&#x4EE3;&#x65B9;&#x6CD5;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x7684;&#x7406;&#x89E3;&#x65E2;&#x672A;&#x5171;&#x4EAB;&#xFF0C;&#x4E5F;&#x4E0D;&#x7CFB;&#x7EDF;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5F53;&#x521D;&#x82B1;&#x4E0A;&#x51E0;&#x4E2A;&#x6708;&#x6216;&#x4E00;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x5BF9;&#x57FA;&#x672C;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x3001;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#x3001;&#x5173;&#x952E;&#x7528;&#x4F8B;&#x548C;&#x6587;&#x732E;&#x8FDB;&#x884C;&#x5F7B;&#x5E95;&#x5BA1;&#x6838;&#xFF0C;&#x6211;&#x6000;&#x7591;&#x6211;&#x4EEC;&#x65E9;&#x5728; 2014 &#x5E74;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x51FA; 2019 &#x5E74; 2 &#x6708;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x8BBA;&#x3002;&#x4E4B;&#x540E;&#x7684;&#x51E0;&#x5E74;&#x672C;&#x53EF;&#x4EE5;&#x82B1;&#x5728;&#x5BF9;&#x6211;&#x4EEC;&#x6240;&#x9009;&#x62E9;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x589E;&#x91CF;&#x6539;&#x8FDB;&#x548C;&#x529F;&#x80FD;&#x6DFB;&#x52A0;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53D6;&#x5F97;&#x7684;&#x8FDB;&#x5C55;&#x548C;&#x6700;&#x540E;&#x7684;&#x6210;&#x529F;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F52;&#x529F;&#x4E8E; Gor Nishanov&#x3002;&#x8981;&#x4E0D;&#x662F;&#x6709;&#x4ED6;&#x7684;&#x575A;&#x97E7;&#x4E0D;&#x62D4;&#x548C;&#x624E;&#x5B9E;&#x5B9E;&#x73B0;&#xFF08;&#x4ED6;&#x5B8C;&#x6210;&#x4E86;&#x5FAE;&#x8F6F;&#x548C; Clang &#x4E24;&#x79CD;&#x7F16;&#x8BD1;&#x5668;&#x91CC;&#x7684;&#x5B9E;&#x73B0;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5728; C++20 &#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x534F;&#x7A0B;&#x3002;&#x9532;&#x800C;&#x4E0D;&#x820D;&#x662F;&#x5728;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x529F;&#x7684;&#x5173;&#x952E;&#x8981;&#x7D20;&#x3002;</p>
<h3 id="933-&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x652F;&#x6301;">9.3.3 &#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x652F;&#x6301;</h3>
<p>&#x591A;&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x5728; C++ &#x4E2D;&#x7F16;&#x8BD1;&#x671F;&#x6C42;&#x503C;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E00;&#x76F4;&#x5728;&#x7A33;&#x6B65;&#x63D0;&#x9AD8;&#x3002;STL &#x4E25;&#x91CD;&#x4F9D;&#x8D56;&#x4E8E;&#x7F16;&#x8BD1;&#x671F;&#x5206;&#x53D1; [Stroustrup 2007]&#xFF0C;&#x800C;&#x6A21;&#x677F;&#x5143;&#x7F16;&#x7A0B;&#x4E3B;&#x8981;&#x65E8;&#x5728;&#x5C06;&#x8BA1;&#x7B97;&#x4ECE;&#x8FD0;&#x884C;&#x671F;&#x8F6C;&#x79FB;&#x5230;&#x7F16;&#x8BD1;&#x671F;&#xFF08;<a href="10.html#1052-&#x5143;&#x7F16;&#x7A0B;">&#xA7;10.5.2</a>&#xFF09;&#x3002;&#x751A;&#x81F3;&#x5728;&#x65E9;&#x671F;&#x7684; C++ &#x4E2D;&#xFF0C;&#x5BF9;&#x91CD;&#x8F7D;&#x7684;&#x4F9D;&#x8D56;&#x4EE5;&#x53CA;&#x865A;&#x51FD;&#x6570;&#x8868;&#x7684;&#x4F7F;&#x7528;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x8BA1;&#x7B97;&#x4ECE;&#x8FD0;&#x884C;&#x671F;&#x8F6C;&#x79FB;&#x5230;&#x7F16;&#x8BD1;&#x671F;&#x6765;&#x83B7;&#x5F97;&#x6027;&#x80FD;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x4E00;&#x76F4;&#x662F; C++ &#x7684;&#x5173;&#x952E;&#x90E8;&#x5206;&#x3002;</p>
<p>C++ &#x4ECE; C &#x7EE7;&#x627F;&#x4E86;&#x53EA;&#x9650;&#x4E8E;&#x6574;&#x578B;&#x4E14;&#x4E0D;&#x80FD;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x7684;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x66FE;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5B8F;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x70B9;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x3002;&#x4F46;&#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x597D;&#x89C4;&#x6A21;&#x5316;&#x3002;&#x4E00;&#x7ECF;&#x5F15;&#x5165;&#x6A21;&#x677F;&#x5E76;&#x53D1;&#x73B0;&#x4E86;&#x6A21;&#x677F;&#x5143;&#x7F16;&#x7A0B;&#xFF0C;&#x6A21;&#x677F;&#x5143;&#x7F16;&#x7A0B;&#x5C31;&#x88AB;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x503C;&#x548C;&#x7C7B;&#x578B;&#x4E0A;&#xFF08;<a href="10.html#1052-&#x5143;&#x7F16;&#x7A0B;">&#xA7;10.5.2</a>&#xFF09;&#x3002;&#x5728; 2010 &#x5E74;&#xFF0C;Gabriel Dos Reis &#x548C; Bjarne Stroustrup &#x53D1;&#x8868;&#x4E86;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x6307;&#x51FA;&#x7F16;&#x8BD1;&#x671F;&#x7684;&#x503C;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#xFF08;&#x4E5F;&#x5E94;&#x8BE5;&#xFF09;&#x50CF;&#x5176;&#x4ED6;&#x8BA1;&#x7B97;&#x4E00;&#x6837;&#x8868;&#x8FBE;&#xFF0C;&#x4E00;&#x6837;&#x5730;&#x4F9D;&#x8D56;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x51FD;&#x6570;&#x7684;&#x5E38;&#x89C4;&#x89C4;&#x5219;&#xFF0C;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B; [Dos Reis and Stroustrup 2010]&#x3002;&#x8FD9;&#x6210;&#x4E3A;&#x4E86; C++11 &#x91CC;&#x7684; <code>constexpr</code> &#x51FD;&#x6570;&#xFF08;<a href="04.html#427-constexpr-&#x51FD;&#x6570;">&#xA7;4.2.7</a>&#xFF09;&#xFF0C;&#x5B83;&#x662F;&#x73B0;&#x4EE3;&#x7F16;&#x8BD1;&#x671F;&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#x3002;C++14 &#x63A8;&#x5E7F;&#x4E86; <code>constexpr</code> &#x51FD;&#x6570;&#xFF08;<a href="05.html#55-constexpr-&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;">&#xA7;5.5</a>&#xFF09;&#xFF0C;&#x800C; C++20 &#x589E;&#x52A0;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x76F8;&#x5173;&#x7684;&#x7279;&#x6027;&#xFF1A;</p>
<ul>
<li><code>consteval</code>&#x2014;&#x2014;&#x4FDD;&#x8BC1;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x8FDB;&#x884C;&#x6C42;&#x503C;&#x7684; <code>constexpr</code> &#x51FD;&#x6570; [Smith et al. 2018a]</li>
<li><code>constinit</code>&#x2014;&#x2014;&#x4FDD;&#x8BC1;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x521D;&#x59CB;&#x5316;&#x7684;&#x58F0;&#x660E;&#x4FEE;&#x9970;&#x7B26; [Fiselier 2019]</li>
<li>&#x5141;&#x8BB8;&#x5728; <code>constexpr</code> &#x51FD;&#x6570;&#x4E2D;&#x4F7F;&#x7528;&#x6210;&#x5BF9;&#x7684; <code>new</code> &#x548C; <code>delete</code> [Dimov et al. 2019]</li>
<li><code>constexpr string</code> &#x548C; <code>constexpr vector</code> [Dionne 2018]</li>
<li>&#x4F7F;&#x7528; <code>virtual</code> &#x51FD;&#x6570; [Dimov and Vassilev 2018]</li>
<li>&#x4F7F;&#x7528; <code>unions</code>&#x3001;&#x5F02;&#x5E38;&#x3001;<code>dynamic_cast</code> &#x548C; <code>typeid</code> [Dionne and Vandevoorde 2018]</li>
<li>&#x4F7F;&#x7528;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x503C;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x2014;&#x2014;&#x6700;&#x7EC8;&#x5141;&#x8BB8;&#x5728;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x7528;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x7684;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7C7B;&#x578B; [Maurer 2012]</li>
<li><code>is_constant_evaluated()</code> &#x8C13;&#x8BCD;&#x2014;&#x2014;&#x4F7F;&#x5E93;&#x5B9E;&#x73B0;&#x8005;&#x80FD;&#x591F;&#x5728;&#x4F18;&#x5316;&#x4EE3;&#x7801;&#x65F6;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x5E73;&#x53F0;&#x76F8;&#x5173;&#x7684;&#x5185;&#x90E8;&#x51FD;&#x6570;&#x7684;&#x4F7F;&#x7528; [Smith et al. 2018b]</li>
</ul>
<p>&#x968F;&#x7740;&#x8FD9;&#x4E00;&#x52AA;&#x529B;&#xFF0C;&#x6807;&#x51C6;&#x5E93;&#x6B63;&#x5728;&#x53D8;&#x5F97;&#x5BF9;&#x7F16;&#x8BD1;&#x671F;&#x6C42;&#x503C;&#x66F4;&#x52A0;&#x53CB;&#x597D;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x52AA;&#x529B;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8BA9; C++23 &#x6216;&#x66F4;&#x9AD8;&#x7248;&#x672C;&#x652F;&#x6301;&#x9759;&#x6001;&#x53CD;&#x5C04;&#xFF08;<a href="#962-&#x9759;&#x6001;&#x53CD;&#x5C04;">&#xA7;9.6.2</a>&#xFF09;&#x3002;&#x5728;&#x6211;&#x6700;&#x521D;&#x8BBE;&#x8BA1;&#x6A21;&#x677F;&#x65F6;&#xFF0C;&#x66FE;&#x671F;&#x671B;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x6A21;&#x677F;&#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x4EE5;&#x6211;&#x5F53;&#x65F6;&#x7684;&#x80FD;&#x529B;&#x65E0;&#x6CD5;&#x6070;&#x5F53;&#x5730;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x51FA;&#x8FD9;&#x4E00;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x4EBA;&#x5E0C;&#x671B;<strong>&#x6BCF;&#x4E00;&#x4E2A;</strong> C++ &#x6784;&#x4EF6;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x90FD;&#x80FD;&#x53EF;&#x7528;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5728; <code>constexpr</code> &#x51FD;&#x6570;&#x4E2D;&#x4F7F;&#x7528;&#x5B8C;&#x6574;&#x7684;&#x6807;&#x51C6;&#x5E93;&#x3002;&#x90A3;&#x53EF;&#x80FD;&#x5C31;&#x597D;&#x8FC7;&#x5934;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x771F;&#x7684;&#x9700;&#x8981;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x5417;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x53EF;&#x884C;&#x3002;&#x6CA1;&#x6709;&#x4F7F;&#x6240;&#x6709;&#x51FD;&#x6570;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x90FD;&#x53EF;&#x7528;&#xFF0C;&#x8FD9;&#x5C31;&#x7ED9;&#x6211;&#x4EEC;&#x7559;&#x4E0B;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x54EA;&#x4E9B;&#x5E94;&#x8BE5;&#x53EF;&#x7528;&#xFF0C;&#x54EA;&#x4E9B;&#x4E0D;&#x5E94;&#x8BE5;&#x53EF;&#x7528;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x7B54;&#x6848;&#x6709;&#x70B9;&#x4E34;&#x573A;&#x53D1;&#x6325;&#x800C;&#x5E76;&#x4E0D;&#x8FDE;&#x8D2F;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x5B8C;&#x5584;&#x3002;</p>
<p>&#x8981;&#x8BA9;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x6784;&#x4EF6;&#x6216;&#x5E93;&#x7EC4;&#x4EF6;&#x6210;&#x4E3A; <code>constexpr</code>&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x7CBE;&#x786E;&#x5730;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF0C;&#x5E76;&#x6D88;&#x9664;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x63A8;&#x52A8;&#x7F16;&#x8BD1;&#x671F;&#x6C42;&#x503C;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x89C4;&#x8303;&#x8BF4;&#x660E;&#x3001;&#x5E73;&#x53F0;&#x4F9D;&#x8D56;&#x6027;&#x5206;&#x6790;&#x548C;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x6839;&#x6E90;&#x5206;&#x6790;&#x7684;&#x4E3B;&#x8981;&#x9A71;&#x52A8;&#x529B;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x5BF9;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x7684;&#x63A8;&#x52A8;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x5E26;&#x6765;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x63A5;&#x53E3;&#x91CC;&#x9700;&#x8981;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6765;&#x5141;&#x8BB8;&#x7F16;&#x8BD1;&#x5668;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6B63;&#x5728;&#x901A;&#x8FC7;&#x6A21;&#x5757;&#x6765;&#x89E3;&#x51B3;&#xFF08;<a href="#931-&#x6A21;&#x5757;">&#xA7;9.3.1</a>&#xFF09;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x8FD8;&#x901A;&#x8FC7;&#x7F13;&#x5B58;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x8865;&#x507F;&#xFF0C;&#x4F9D;&#x8D56;&#x5E76;&#x884C;&#x6784;&#x5EFA;&#x7684;&#x7CFB;&#x7EDF;&#x4E5F;&#x5F88;&#x5E38;&#x89C1;&#x3002;&#x7136;&#x800C;&#xFF0C;C++ &#x7A0B;&#x5E8F;&#x5458;&#x5FC5;&#x987B;&#x5B66;&#x4F1A;&#x9650;&#x5236;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x548C;&#x5143;&#x7F16;&#x7A0B;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x503C;&#x5F97;&#x4E3A;&#x4E86;&#x4EE3;&#x7801;&#x7D27;&#x51D1;&#x6027;&#x548C;&#x8FD0;&#x884C;&#x671F;&#x6027;&#x80FD;&#x800C;&#x5F15;&#x5165;&#x5B83;&#x4EEC;&#x7684;&#x5730;&#x65B9;&#x624D;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="934-">9.3.4 &lt;=&gt;</h3>
<p>&#x53C2;&#x89C1;&#xFF08;<a href="08.html#884-&#x7F3A;&#x7701;&#x6BD4;&#x8F83;">&#xA7;8.8.4</a>&#xFF09;&#x3002;&#x7D27;&#x63A5;&#x5728;&#x201C;&#x98DE;&#x8239;&#x8FD0;&#x7B97;&#x7B26;&#x201D;&#xFF08;<code>&lt;=&gt;</code>&#xFF09;&#x6295;&#x7968;&#x8FDB;&#x5165; C++20 &#x4E4B;&#x540E;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5728;&#x8BED;&#x8A00;&#x89C4;&#x5219;&#x53CA;&#x5176;&#x4E0E;&#x6807;&#x51C6;&#x5E93;&#x7684;&#x96C6;&#x6210;&#x65B9;&#x9762;&#x90FD;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x8BA4;&#x771F;&#x5DE5;&#x4F5C;&#x3002;&#x51FA;&#x4E8E;&#x5BF9;&#x89E3;&#x51B3;&#x8DDF;&#x6BD4;&#x8F83;&#x6709;&#x5173;&#x7684;&#x68D8;&#x624B;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x5EA6;&#x70ED;&#x60C5;&#x548C;&#x6E34;&#x671B;&#xFF0C;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x4E86;&#x610F;&#x5916;&#x540E;&#x679C;&#x5B9A;&#x5F8B;&#x7684;&#x53D7;&#x5BB3;&#x8005;&#x3002;&#x4E00;&#x4E9B;&#x59D4;&#x5458;&#xFF08;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#xFF09;&#x62C5;&#x5FC3;&#x5F15;&#x5165; <code>&lt;=&gt;</code> &#x8FC7;&#x4E8E;&#x4ED3;&#x4FC3;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x62C5;&#x5FE7;&#x5750;&#x5B9E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65E9;&#x5DF2;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x5728;&#x5047;&#x8BBE; <code>&lt;=&gt;</code> &#x53EF;&#x7528;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E09;&#x5411;&#x6BD4;&#x8F83;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x52BF;&#x8BA9;&#x8BB8;&#x591A;&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x548C;&#x5176;&#x4ED6;&#x66F4;&#x5E7F;&#x6CDB;&#x7684; C++ &#x793E;&#x533A;&#x6210;&#x5458;&#x611F;&#x5230;&#x5174;&#x594B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x53D1;&#x73B0; <code>&lt;=&gt;</code> &#x5728;&#x91CD;&#x8981;&#x7528;&#x4F8B;&#x4E2D;&#x5BFC;&#x81F4;&#x4E86;&#x663E;&#x8457;&#x7684;&#x4F4E;&#x6548;&#x65F6;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x4EE4;&#x4EBA;&#x4E0D;&#x5FEB;&#x7684;&#x610F;&#x5916;&#x4E86;&#x3002;&#x7C7B;&#x578B;&#x6709;&#x4E86; <code>&lt;=&gt;</code> &#x4E4B;&#x540E;&#xFF0C;<code>==</code> &#x662F;&#x4ECE; <code>&lt;=&gt;</code> &#x751F;&#x6210;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;<code>==</code> &#x901A;&#x5E38;&#x901A;&#x8FC7;&#x9996;&#x5148;&#x6BD4;&#x8F83;&#x5927;&#x5C0F;&#x6765;&#x4F18;&#x5316;&#xFF1A;&#x5982;&#x679C;&#x5B57;&#x7B26;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x5219;&#x5B57;&#x7B26;&#x4E32;&#x4E0D;&#x76F8;&#x7B49;&#x3002;&#x4ECE; <code>&lt;=&gt;</code> &#x751F;&#x6210;&#x7684; <code>==</code> &#x5219;&#x5FC5;&#x987B;&#x8BFB;&#x53D6;&#x8DB3;&#x591F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4EE5;&#x786E;&#x5B9A;&#x5B83;&#x4EEC;&#x7684;&#x8BCD;&#x5178;&#x987A;&#x5E8F;&#xFF0C;&#x90A3;&#x5F00;&#x9500;&#x5C31;&#x4F1A;&#x5927;&#x5F97;&#x591A;&#x4E86;&#x3002;&#x7ECF;&#x8FC7;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x4E0D;&#x4ECE; <code>&lt;=&gt;</code> &#x751F;&#x6210; <code>==</code>&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x548C;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x4FEE;&#x6B63; [Crowl 2018; Revzin 2018, 2019; Smith 2018c] &#x89E3;&#x51B3;&#x4E86;&#x624B;&#x5934;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x635F;&#x5BB3;&#x4E86; <code>&lt;=&gt;</code> &#x7684;&#x6839;&#x672C;&#x627F;&#x8BFA;&#xFF1A;&#x6240;&#x6709;&#x7684;&#x6BD4;&#x8F83;&#x8FD0;&#x7B97;&#x7B26;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x884C;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x751F;&#x6210;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7531;&#x4E8E; <code>&lt;=&gt;</code> &#x7684;&#x5F15;&#x5165;&#xFF0C;<code>==</code> &#x548C; <code>&lt;</code> &#x73B0;&#x5728;&#x6709;&#x4E86;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x4E8E;&#x5176;&#x4ED6;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x89C4;&#x5219;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;<code>==</code> &#x88AB;&#x5047;&#x5B9A;&#x4E3A;&#x5BF9;&#x79F0;&#x7684;&#xFF09;&#x3002;&#x65E0;&#x8BBA;&#x597D;&#x574F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4E0E;&#x8FD0;&#x7B97;&#x7B26;&#x91CD;&#x8F7D;&#x76F8;&#x5173;&#x7684;&#x89C4;&#x5219;&#x90FD;&#x5C06; <code>&lt;=&gt;</code> &#x4F5C;&#x4E3A;&#x7279;&#x4F8B;&#x6765;&#x5BF9;&#x5F85;&#x3002;</p>
<h3 id="935-&#x8303;&#x56F4;">9.3.5 &#x8303;&#x56F4;</h3>
<p><strong>&#x8303;&#x56F4;&#x5E93;</strong>&#x59CB;&#x4E8E; Eric Niebler &#x5BF9; STL &#x5E8F;&#x5217;&#x89C2;&#x5FF5;&#x7684;&#x63A8;&#x5E7F;&#x548C;&#x73B0;&#x4EE3;&#x5316;&#x7684;&#x5DE5;&#x4F5C; [Niebler et al. 2014]&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x3001;&#x66F4;&#x901A;&#x7528;&#x53CA;&#x6027;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x6807;&#x51C6;&#x5E93;&#x7B97;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;C++20 &#x6807;&#x51C6;&#x5E93;&#x4E3A;&#x6574;&#x4E2A;&#x5BB9;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#x63D0;&#x4F9B;&#x4E86;&#x671F;&#x5F85;&#x5DF2;&#x4E45;&#x7684;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5199;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">test</span><span class="hljs-params">(<span class="hljs-built_in">vector</span>&lt;<span class="hljs-built_in">string</span>&gt;&amp; vs)</span>
</span>{
    sort(vs);   <span class="hljs-comment">// &#x800C;&#x4E0D;&#x662F; sort(vs.begin(),vs.end())</span>
}
</code></pre>
<p>C++98 [Stroustrup 1993] &#x6240;&#x91C7;&#x7528;&#x7684;&#x539F;&#x59CB; STL &#x5C06;&#x5E8F;&#x5217;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x5BF9;&#x8FED;&#x4EE3;&#x5668;&#x3002;&#x8FD9;&#x9057;&#x6F0F;&#x4E86;&#x6307;&#x5B9A;&#x5E8F;&#x5217;&#x7684;&#x4E24;&#x79CD;&#x91CD;&#x8981;&#x65B9;&#x5F0F;&#x3002;&#x8303;&#x56F4;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x4E09;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#xFF08;&#x73B0;&#x5728;&#x79F0;&#x4E3A; <code>ranges</code>&#xFF09;&#xFF1A;</p>
<ul>
<li><code>(&#x9996;&#x9879;,&#x5C3E;&#x9879;&#x8FC7;&#x4E00;)</code> &#x7528;&#x4E8E;&#x5F53;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5E8F;&#x5217;&#x7684;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x65F6;&#xFF08;&#x4F8B;&#x5982;&#x201C;&#x5BF9; vector &#x7684;&#x5F00;&#x59CB;&#x5230;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x201D;&#xFF09;&#x3002;</li>
<li><code>(&#x9996;&#x9879;,&#x5143;&#x7D20;&#x4E2A;&#x6570;)</code> &#x7528;&#x4E8E;&#x5F53;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x5E8F;&#x5217;&#x7684;&#x7ED3;&#x5C3E;&#x65F6;&#xFF08;&#x4F8B;&#x5982;&#x201C;&#x67E5;&#x770B;&#x5217;&#x8868;&#x7684;&#x524D; 10 &#x4E2A;&#x5143;&#x7D20;&#x201D;&#xFF09;&#x3002;</li>
<li><code>(&#x9996;&#x9879;,&#x7ED3;&#x675F;&#x5224;&#x636E;)</code> &#x7528;&#x4E8E;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8C13;&#x8BCD;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x54E8;&#x4F4D;&#xFF09;&#x6765;&#x5B9A;&#x4E49;&#x5E8F;&#x5217;&#x7684;&#x7ED3;&#x5C3E;&#x65F6;&#xFF08;&#x4F8B;&#x5982;&#x201C;&#x8BFB;&#x53D6;&#x5230;&#x8F93;&#x5165;&#x7ED3;&#x675F;&#x201D;&#xFF09;&#x3002;</li>
</ul>
<p><code>range</code> &#x672C;&#x8EAB;&#x662F;&#x4E00;&#x79CD; <code>concept</code>&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x3002;&#x6240;&#x6709; C++20 &#x6807;&#x51C6;&#x5E93;&#x7B97;&#x6CD5;&#x73B0;&#x5728;&#x90FD;&#x4F7F;&#x7528;&#x6982;&#x5FF5;&#x8FDB;&#x884C;&#x4E86;&#x7CBE;&#x786E;&#x89C4;&#x5B9A;&#x3002;&#x8FD9;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x5E76;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x5728;&#x7B97;&#x6CD5;&#x91CC;&#x53EF;&#x4EE5;&#x63A8;&#x5E7F;&#x5230;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FED;&#x4EE3;&#x5668;&#x3002;&#x8FD9;&#x79CD;&#x63A8;&#x5E7F;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x628A;&#x7B97;&#x6CD5;&#x5982;&#x7BA1;&#x9053;&#x822C;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-built_in">vector</span>&lt;<span class="hljs-keyword">int</span>&gt; vec = {<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">6</span>, <span class="hljs-number">7</span>, <span class="hljs-number">8</span>, <span class="hljs-number">9</span>, <span class="hljs-number">10</span>};

<span class="hljs-keyword">auto</span> even = [](<span class="hljs-keyword">int</span> i){ <span class="hljs-keyword">return</span> i%<span class="hljs-number">2</span> == <span class="hljs-number">0</span>; }

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i : vec | view::filter(even)
                 | view::transform( [](<span class="hljs-keyword">int</span> i) { <span class="hljs-keyword">return</span> i*i; } )
                 | view::take(<span class="hljs-number">5</span>))
    <span class="hljs-built_in">cout</span> &lt;&lt; i &lt;&lt; <span class="hljs-string">&apos;\n&apos;</span>;    <span class="hljs-comment">// &#x6253;&#x5370;&#x524D; 5 &#x4E2A;&#x5076;&#x6574;&#x6570;&#x7684;&#x5E73;&#x65B9;</span>
</code></pre>
<p>&#x50CF;&#x5728; Unix &#x4E2D;&#x4E00;&#x6837;&#xFF0C;&#x7BA1;&#x9053;&#x8FD0;&#x7B97;&#x7B26; <code>|</code> &#x5C06;&#x5176;&#x5DE6;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x4F20;&#x9012;&#x5230;&#x5176;&#x53F3;&#x64CD;&#x4F5C;&#x6570;&#xFF08;&#x4F8B;&#x5982; <code>A|B</code> &#x8868;&#x793A; <code>B(A)</code>&#xFF09;&#x3002;&#x4E00;&#x65E6;&#x4EBA;&#x4EEC;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x534F;&#x7A0B;&#xFF08;<a href="#932-&#x534F;&#x7A0B;">&#xA7;9.3.2</a>&#xFF09;&#x6765;&#x7F16;&#x5199;&#x7BA1;&#x9053;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8FD9;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x6709;&#x8DA3;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x5728; 2017 &#x5E74;&#xFF0C;&#x8303;&#x56F4;&#x5E93;&#x6210;&#x4E3A;&#x4E86; TS [Niebler and Carter 2017]&#xFF1B;&#x5728; 2019 &#x5E74; 2 &#x6708;&#xFF0C;&#x5B83;&#x88AB;&#x6295;&#x8FDB;&#x4E86; C++20 [Niebler et al. 2018]&#x3002;</p>
<h3 id="936-&#x65E5;&#x671F;&#x548C;&#x65F6;&#x533A;">9.3.6 &#x65E5;&#x671F;&#x548C;&#x65F6;&#x533A;</h3>
<p>&#x65E5;&#x671F;&#x5E93;&#x662F; Howard Hinnant&#xFF08;&#x73B0;&#x5728;&#x4EFB;&#x804C;&#x4E8E; Ripple&#xFF0C;&#x4E4B;&#x524D;&#x4EFB;&#x804C;&#x4E8E;&#x82F9;&#x679C;&#xFF09;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x4E3A; C++ &#x63D0;&#x4F9B;&#x6807;&#x51C6;&#x7684;&#x65E5;&#x5386;&#x548C;&#x65F6;&#x533A;&#x652F;&#x6301; [Hinnant and Kamin&#x301;ski 2018]&#x3002;&#x5B83;&#x57FA;&#x4E8E; <code>chrono</code> &#x6807;&#x51C6;&#x5E93;&#x7684;&#x65F6;&#x95F4;&#x652F;&#x6301;&#x3002;Howard &#x4E5F;&#x662F; <code>chrono</code> &#x6807;&#x51C6;&#x5E93;&#xFF08;<a href="04.html#46-c11&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;">&#xA7;4.6</a>&#xFF09;&#x80CC;&#x540E;&#x7684;&#x4E3B;&#x8981;&#x4EBA;&#x7269;&#x3002;&#x65E5;&#x671F;&#x5E93;&#x662F;&#x591A;&#x5E74;&#x5DE5;&#x4F5C;&#x548C;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5728; 2018 &#x5E74;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x6295;&#x7968;&#x8FDB;&#x5165;&#x4E86; C++20&#xFF0C;&#x5E76;&#x548C;&#x65E7;&#x7684;&#x65F6;&#x95F4;&#x5DE5;&#x5177;&#x4E00;&#x8D77;&#x653E;&#x5728; <code>&lt;chrono&gt;</code> &#x4E2D;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5982;&#x4F55;&#x8868;&#x8FBE;&#x65F6;&#x95F4;&#x70B9;&#xFF08;<code>time_point</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">constexpr</span> <span class="hljs-keyword">auto</span> tp = <span class="hljs-number">2016</span>y/May/<span class="hljs-number">29</span>d + <span class="hljs-number">7</span>h + <span class="hljs-number">30</span>min + <span class="hljs-number">6</span>s + <span class="hljs-number">153</span>ms;
<span class="hljs-built_in">cout</span> &lt;&lt; tp &lt;&lt; <span class="hljs-string">&apos;\n&apos;</span>;    <span class="hljs-comment">// 2016-05-29 07:30:06.153</span>
</code></pre>
<p>&#x8FD9;&#x4E00;&#x5199;&#x6CD5;&#x5F88;&#x4F20;&#x7EDF;&#xFF08;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x5B57;&#x9762;&#x91CF;<a href="04.html#428-&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x5B57;&#x9762;&#x91CF;">&#xA7;4.2.8</a>&#xFF09;&#xFF09;&#xFF0C;&#x65E5;&#x671F;&#x8868;&#x793A;&#x4E3A; <code>&#x5E74;,&#x6708;,&#x65E5;</code> &#x7ED3;&#x6784;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x65F6;&#xFF0C;&#x65E5;&#x671F;&#x4F1A;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x6620;&#x5C04;&#x5230;&#x6807;&#x51C6;&#x65F6;&#x95F4;&#x7EBF;&#xFF08;<code>system_time</code>&#xFF09;&#x4E0A;&#x7684;&#x67D0;&#x4E2A;&#x70B9;&#xFF08;&#x4F7F;&#x7528; <code>constexpr</code> &#x51FD;&#x6570;&#xFF08;<a href="04.html#427-constexpr-&#x51FD;&#x6570;">&#xA7;4.2.7</a>&#xFF09;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x6781;&#x5176;&#x5FEB;&#x901F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">static_assert</span>(<span class="hljs-number">2016</span>y/May/<span class="hljs-number">29</span>==Thursday);  <span class="hljs-comment">// &#x7F16;&#x8BD1;&#x671F;&#x68C0;&#x67E5;</span>
</code></pre>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65F6;&#x533A;&#x662F; UTC&#xFF08;&#x53C8;&#x79F0; Unix &#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x4F46;&#x8F6C;&#x6362;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x533A;&#x5F88;&#x5BB9;&#x6613;&#xFF1A;</p>
<pre><code class="lang-cpp">zoned_time zt = {<span class="hljs-string">&quot;Asia/Tokyo&quot;</span>, tp};
<span class="hljs-built_in">cout</span> &lt;&lt; zt &lt;&lt; <span class="hljs-string">&apos;\n&apos;</span>;          <span class="hljs-comment">// 2016-05-29 16:30:06.153 JST</span>
</code></pre>
<p>&#x65E5;&#x671F;&#x5E93;&#x8FD8;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x661F;&#x671F;&#x51E0;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;<code>Monday</code> &#x548C; <code>Friday</code>&#xFF09;&#x3001;&#x591A;&#x4E2A;&#x65E5;&#x5386;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x683C;&#x91CC;&#x5386;&#x548C;&#x5112;&#x7565;&#x5386;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x6DF1;&#x5965;&#xFF08;&#x4F46;&#x5FC5;&#x8981;&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6BD4;&#x5982;&#x95F0;&#x79D2;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x6709;&#x7528;&#x548C;&#x5FEB;&#x901F;&#x4E4B;&#x5916;&#xFF0C;&#x65E5;&#x671F;&#x5E93;&#x8FD8;&#x6709;&#x8DA3;&#x5728;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x975E;&#x5E38;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x5E38;&#x89C1;&#x9519;&#x8BEF;&#x4F1A;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x6355;&#x83B7;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">auto</span> d1 = <span class="hljs-number">2019</span>y/<span class="hljs-number">5</span>/<span class="hljs-number">4</span>;    <span class="hljs-comment">// &#x9519;&#x8BEF;&#xFF1A;&#x662F; 5 &#x6708; 4 &#x65E5;&#x8FD8;&#x662F; 4 &#x6708; 5 &#x65E5;&#xFF1F;</span>
<span class="hljs-keyword">auto</span> d2 = <span class="hljs-number">2019</span>y/May/<span class="hljs-number">4</span>;  <span class="hljs-comment">// &#x6B63;&#x786E;</span>
<span class="hljs-keyword">auto</span> d2 = May/<span class="hljs-number">4</span>/<span class="hljs-number">2019</span>;   <span class="hljs-comment">// &#x6B63;&#x786E;&#xFF08;&#x65E5;&#x8DDF;&#x5728;&#x6708;&#x540E;&#x9762;&#xFF09;</span>
<span class="hljs-keyword">auto</span> d3 = d2+<span class="hljs-number">10</span>;        <span class="hljs-comment">// &#x9519;&#x8BEF;&#xFF1A;&#x662F;&#x52A0; 10 &#x5929;&#x3001;10 &#x4E2A;&#x6708;&#x8FD8;&#x662F; 10 &#x5E74;&#xFF1F;</span>
</code></pre>
<p>&#x65E5;&#x671F;&#x5E93;&#x662F;&#x6807;&#x51C6;&#x5E93;&#x7EC4;&#x4EF6;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5C11;&#x89C1;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x76F4;&#x63A5;&#x670D;&#x52A1;&#x4E8E;&#x67D0;&#x5E94;&#x7528;&#x9886;&#x57DF;&#xFF0C;&#x800C;&#x975E;&#x201C;&#x4EC5;&#x4EC5;&#x201D;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#x6027;&#x7684;&#x201C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x201D;&#x62BD;&#x8C61;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x5728;&#x5C06;&#x6765;&#x7684;&#x6807;&#x51C6;&#x4E2D;&#x80FD;&#x770B;&#x5230;&#x66F4;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<h3 id="937-&#x683C;&#x5F0F;&#x5316;">9.3.7 &#x683C;&#x5F0F;&#x5316;</h3>
<p>iostream &#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684; I/O &#x7684;&#x6269;&#x5C55;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x5DE5;&#x5177;&#x6BD4;&#x8F83;&#x5F31;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x7684;&#x4EBA;&#x4E0D;&#x559C;&#x6B22;&#x4F7F;&#x7528; <code>&lt;&lt;</code> &#x5206;&#x9694;&#x8F93;&#x51FA;&#x503C;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x683C;&#x5F0F;&#x5316;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x7C7B; <code>printf</code> &#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x7EC4;&#x88C5;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x51FA;&#x503C;&#xFF0C;&#x540C;&#x65F6;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x3001;&#x5FEB;&#x6377;&#xFF0C;&#x5E76;&#x80FD;&#x548C; iostream &#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x4E3B;&#x8981;&#x662F;&#x7531; Victor Zverovich [Zverovich 2019] &#x5B8C;&#x6210;&#x7684;&#x3002;</p>
<p>&#x7C7B;&#x578B;&#x4E2D;&#x5E26;&#x6709; <code>&lt;&lt;</code> &#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-built_in">string</span> s = <span class="hljs-string">&quot;foo&quot;</span>;
<span class="hljs-built_in">cout</span> &lt;&lt; format(<span class="hljs-string">&quot;The string &apos;{}&apos; has {} characters&quot;</span>,s,s.size());
</code></pre>
<p>&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F; <code>The string &apos;foo&apos; has 3 characters</code>&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x201C;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684; <code>printf</code>&#x201D;&#x53D8;&#x53C2;&#x6A21;&#x677F;&#x601D;&#x60F3;&#x7684;&#x4E00;&#x4E2A;&#x53D8;&#x4F53;&#xFF08;<a href="04.html#432-&#x53D8;&#x53C2;&#x6A21;&#x677F;">&#xA7;4.3.2</a>&#xFF09;&#x3002;&#x5927;&#x62EC;&#x53F7; <code>{}</code> &#x7B80;&#x5355;&#x5730;&#x8868;&#x793A;&#x4E86;&#x63D2;&#x5165;&#x53C2;&#x6570;&#x503C;&#x7684;&#x9ED8;&#x8BA4;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x53C2;&#x6570;&#x503C;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x4EFB;&#x610F;&#x987A;&#x5E8F;&#x88AB;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-comment">// s &#x5728; s.size() &#x524D;&#xFF1A;</span>
<span class="hljs-built_in">cout</span> &lt;&lt; format(<span class="hljs-string">&quot;The string &apos;{0}&apos; has {1} characters&quot;</span>,s,s.size());
<span class="hljs-comment">// s.size() &#x5728; s &#x524D;&#xFF1A;</span>
<span class="hljs-built_in">cout</span> &lt;&lt; format(<span class="hljs-string">&quot;The string &apos;{1}&apos; has {0} characters&quot;</span>,s.size(),s);
</code></pre>
<p>&#x50CF; <code>printf()</code> &#x4E00;&#x6837;&#xFF0C;<code>format()</code> &#x4E3A;&#x5C55;&#x73B0;&#x683C;&#x5F0F;&#x5316;&#x7EC6;&#x8282;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x95E8;&#x5C0F;&#x800C;&#x5B8C;&#x6574;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x6BD4;&#x5982;&#x5B57;&#x6BB5;&#x5BBD;&#x5EA6;&#x3001;&#x6D6E;&#x70B9;&#x6570;&#x7CBE;&#x5EA6;&#x3001;&#x6574;&#x6570;&#x57FA;&#x548C;&#x5B57;&#x6BB5;&#x5185;&#x5BF9;&#x9F50;&#x3002;&#x4E0D;&#x540C;&#x4E8E; <code>printf()</code>&#xFF0C;<code>format()</code> &#x662F;&#x53EF;&#x6269;&#x5C55;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x3002;&#x4E0B;&#x9762;&#x662F; <code>&lt;chrono&gt;</code> &#x5E93;&#x4E2D;&#xFF08;<a href="#936-&#x65E5;&#x671F;&#x548C;&#x65F6;&#x533A;">&#xA7;9.3.6</a>&#xFF09;&#x4E00;&#x4E2A;&#x6253;&#x5370;&#x65E5;&#x671F;&#x7684;&#x4F8B;&#x5B50; [Zverovich et al. 2019]&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-built_in">string</span> s1 = format(<span class="hljs-string">&quot;{}&quot;</span>, birthday);
<span class="hljs-built_in">string</span> s2 = format(<span class="hljs-string">&quot;{0:&gt;15%Y-%m-%d}&quot;</span>, birthday);
</code></pre>
<p>&#x201C;&#x5E74;-&#x6708;-&#x65E5;&#x201D;&#x662F;&#x9ED8;&#x8BA4;&#x683C;&#x5F0F;&#x3002;<code>&gt;15</code> &#x610F;&#x5473;&#x7740;&#x4F7F;&#x7528; 15 &#x4E2A;&#x5B57;&#x7B26;&#x548C;&#x53F3;&#x5BF9;&#x9F50;&#x6587;&#x672C;&#x3002;&#x65E5;&#x671F;&#x5E93;&#x4E2D;&#x8FD8;&#x5305;&#x542B;&#x4E86;&#x53E6;&#x4E00;&#x95E8;&#x5C0F;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x540C; <code>format()</code> &#x4E00;&#x8D77;&#x7528;&#x3002;&#x5B83;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5904;&#x7406;&#x65F6;&#x533A;&#x548C;&#x533A;&#x57DF;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-built_in">std</span>::format(<span class="hljs-built_in">std</span>::locale{<span class="hljs-string">&quot;fi_FI&quot;</span>}, <span class="hljs-string">&quot;{}&quot;</span>, zt);
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5C06;&#x4F1A;&#x7ED9;&#x51FA;&#x82AC;&#x5170;&#x7684;&#x5F53;&#x5730;&#x65F6;&#x95F4;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x683C;&#x5F0F;&#x5316;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x533A;&#x57DF;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x662F;&#x5426;&#x6839;&#x636E;&#x533A;&#x57DF;&#x6765;&#x683C;&#x5F0F;&#x5316;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;&#x4F20;&#x7EDF;&#x7684; iostream&#xFF0C;&#x9ED8;&#x8BA4;&#x533A;&#x57DF;&#x65E0;&#x5173;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x5927;&#x5927;&#x63D0;&#x5347;&#x4E86;&#x6027;&#x80FD;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x533A;&#x57DF;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x8F93;&#x5165;&#xFF08;<code>istream</code>&#xFF09;&#x6CA1;&#x6709;&#x7B49;&#x4EF7;&#x7684; <code>format</code> &#x652F;&#x6301;&#x3002;</p>
<h3 id="938-&#x8DE8;&#x5EA6;">9.3.8 &#x8DE8;&#x5EA6;</h3>
<p>&#x8D8A;&#x754C;&#x8BBF;&#x95EE;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;&#x7F13;&#x51B2;&#x533A;&#x6EA2;&#x51FA;&#xFF0C;&#x4ECE; C &#x7684;&#x65F6;&#x4EE3;&#x4EE5;&#x6765;&#x5C31;&#x4E00;&#x76F4;&#x662F;&#x4E00;&#x4E2A;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span>* p, <span class="hljs-keyword">int</span> n)</span>  <span class="hljs-comment">// n &#x662F;&#x4EC0;&#x4E48;&#xFF1F;</span>
</span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i=<span class="hljs-number">0</span>; i&lt;n; ++i)
        p[i] = <span class="hljs-number">7</span>;  <span class="hljs-comment">// &#x53EF;&#x4EE5;&#x5417;&#xFF1F;</span>
}
</code></pre>
<p>&#x8BD5;&#x95EE;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x6BD4;&#x5982;&#x7F16;&#x8BD1;&#x5668;&#x8981;&#x5982;&#x4F55;&#x77E5;&#x9053; <code>n</code> &#x4EE3;&#x8868;&#x7740;&#x6240;&#x6307;&#x5411;&#x7684;&#x6570;&#x7EC4;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x4E2A;&#x6570;&#xFF1F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5982;&#x4F55;&#x8981;&#x80FD;&#x591F;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BF9;&#x6B64;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x6B63;&#x786E;&#xFF1F;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">int</span> x = <span class="hljs-number">100</span>;
<span class="hljs-keyword">int</span> a[<span class="hljs-number">100</span>];
f(a,x);    <span class="hljs-comment">// &#x53EF;&#x4EE5;</span>
f(a,x/<span class="hljs-number">2</span>);  <span class="hljs-comment">// &#x53EF;&#x4EE5;&#xFF1A;a &#x7684;&#x524D;&#x534A;&#x90E8;&#x5206;</span>
f(a,x+<span class="hljs-number">1</span>);  <span class="hljs-comment">// &#x707E;&#x96BE;&#xFF01;</span>
</code></pre>
<p>&#x51E0;&#x5341;&#x5E74;&#x6765;&#xFF0C;&#x50CF;&#x201C;&#x707E;&#x96BE;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8BC4;&#x8BBA;&#x4E00;&#x5411;&#x662F;&#x51C6;&#x786E;&#x7684;&#xFF0C;&#x8303;&#x56F4;&#x9519;&#x8BEF;&#x4E5F;&#x4E00;&#x76F4;&#x662F;&#x5927;&#x591A;&#x6570;&#x91CD;&#x5927;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x7684;&#x6839;&#x56E0;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x80FD;&#x591F;&#x6355;&#x83B7;&#x8303;&#x56F4;&#x9519;&#x8BEF;&#xFF0C;&#x800C;&#x8FD0;&#x884C;&#x671F;&#x68C0;&#x67E5;&#x6240;&#x6709;&#x7684;&#x4E0B;&#x6807;&#x5219;&#x666E;&#x904D;&#x88AB;&#x8BA4;&#x4E3A;&#x5BF9;&#x4E8E;&#x751F;&#x4EA7;&#x4EE3;&#x7801;&#x6765;&#x8BF4;&#x4EE3;&#x4EF7;&#x8FC7;&#x4E8E;&#x9AD8;&#x6602;&#x3002;</p>
<p>&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x673A;&#x5236;&#xFF0C;&#x5E26;&#x6709;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;1990 &#x5E74;&#xFF0C;Dennis Ritchie &#x5411; C &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x63D0;&#x8BAE;&#xFF1A;&#x201C;&#x2018;&#x80D6;&#x6307;&#x9488;&#x2019;&#xFF0C;&#x5B83;&#x7684;&#x8868;&#x793A;&#x4E2D;&#x5305;&#x62EC;&#x4E86;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x4EE5;&#x5B58;&#x653E;&#x8FD0;&#x884C;&#x671F;&#x53EF;&#x8C03;&#x6574;&#x7684;&#x8FB9;&#x754C;&#x3002;&#x201D;[Ritchie 1990]&#x3002;&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF0C;C &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x63D0;&#x6848;&#x3002;&#x5728;&#x5F53;&#x65F6;&#xFF0C;&#x6211;&#x542C;&#x5230;&#x4E00;&#x6761;&#x6781;&#x53EF;&#x7B11;&#x7684;&#x8BC4;&#x8BBA;&#xFF1A;&#x201C;Dennis &#x4E0D;&#x662F; C &#x7684;&#x4E13;&#x5BB6;&#xFF1B;&#x4ED6;&#x4ECE;&#x4E0D;&#x6765;&#x53C2;&#x52A0;&#x4F1A;&#x8BAE;&#x3002;&#x201D;&#x6211;&#x6CA1;&#x8BB0;&#x4F4F;&#x8FD9;&#x5230;&#x5E95;&#x662F;&#x8C01;&#x8BF4;&#x7684;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x662F;&#x4EF6;&#x597D;&#x4E8B;&#x3002;</p>
<p>2015 &#x5E74;&#xFF0C;Neil MacIntosh&#xFF08;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4ED6;&#x8FD8;&#x5728;&#x5FAE;&#x8F6F;&#xFF09;&#x5728; C++ &#x6838;&#x5FC3;&#x6307;&#x5357;&#xFF08;<a href="10.html#106-&#x7F16;&#x7801;&#x6307;&#x5357;">&#xA7;10.6</a>&#xFF09;&#x91CC;&#x6062;&#x590D;&#x4E86;&#x8FD9;&#x4E00;&#x60F3;&#x6CD5;&#xFF0C;&#x90A3;&#x91CC;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x673A;&#x5236;&#x6765;&#x9F13;&#x52B1;&#x548C;&#x9009;&#x62E9;&#x6027;&#x5730;&#x5F3A;&#x5236;&#x4F7F;&#x7528;&#x9AD8;&#x6548;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x3002;<code>span&lt;T&gt;</code> &#x7C7B;&#x6A21;&#x677F;&#x5C31;&#x8FD9;&#x6837;&#x88AB;&#x653E;&#x5230; C++ &#x6838;&#x5FC3;&#x6307;&#x5357;&#x7684;&#x652F;&#x6301;&#x5E93;&#x4E2D;&#xFF0C;&#x5E76;&#x7ACB;&#x5373;&#x88AB;&#x79FB;&#x690D;&#x5230;&#x5FAE;&#x8F6F;&#x3001;Clang &#x548C; GCC &#x7684; C++ &#x7F16;&#x8BD1;&#x5668;&#x91CC;&#x3002;2018 &#x5E74;&#xFF0C;&#x5B83;&#x6295;&#x7968;&#x8FDB;&#x5165;&#x4E86; C++20&#x3002;</p>
<p>&#x4F7F;&#x7528; <code>span</code> &#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">f</span><span class="hljs-params">(span&lt;<span class="hljs-keyword">int</span>&gt; a)</span>  <span class="hljs-comment">// span &#x5305;&#x542B;&#x4E00;&#x6839;&#x6307;&#x9488;&#x548C;&#x4E00;&#x6761;&#x5927;&#x5C0F;&#x4FE1;&#x606F;</span>
</span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span>&amp; x : a)
        x = <span class="hljs-number">7</span>;  <span class="hljs-comment">// &#x53EF;&#x4EE5;</span>
}
</code></pre>
<p>&#x8303;&#x56F4; <code>for</code> &#x4ECE;&#x8DE8;&#x5EA6;&#x4E2D;&#x63D0;&#x53D6;&#x8303;&#x56F4;&#xFF0C;&#x5E76;&#x51C6;&#x786E;&#x5730;&#x904D;&#x5386;&#x6B63;&#x786E;&#x6570;&#x91CF;&#x7684;&#x5143;&#x7D20;&#xFF08;&#x65E0;&#x9700;&#x4EE3;&#x4EF7;&#x9AD8;&#x6602;&#x7684;&#x8303;&#x56F4;&#x68C0;&#x67E5;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x8BF4;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x9002;&#x5F53;&#x7684;&#x62BD;&#x8C61;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x7B80;&#x5316;&#x5199;&#x6CD5;&#x5E76;&#x63D0;&#x5347;&#x6027;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x7B97;&#x6CD5;&#x6765;&#x8BF4;&#xFF0C;&#x76F8;&#x8F83;&#x4E8E;&#x6328;&#x4E2A;&#x68C0;&#x67E5;&#x6BCF;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x660E;&#x786E;&#x5730;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x8303;&#x56F4;&#xFF08;&#x6BD4;&#x5982; <code>span</code>&#xFF09;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#xFF0C;&#x5F00;&#x9500;&#x4E5F;&#x66F4;&#x4F4E;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x663E;&#x5F0F;&#x5730;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#xFF08;&#x6BD4;&#x5982;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x5B50;&#x8303;&#x56F4;&#xFF09;&#x3002;&#x4F46;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x627F;&#x62C5;&#x98CE;&#x9669;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x6BD4;&#x8F83;&#x624E;&#x773C;&#xFF0C;&#x4E5F;&#x6613;&#x4E8E;&#x8BA9;&#x4EBA;&#x8B66;&#x89C9;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">int</span> x = <span class="hljs-number">100</span>;
<span class="hljs-keyword">int</span> a[<span class="hljs-number">100</span>];
f(a);        <span class="hljs-comment">// &#x6A21;&#x677F;&#x53C2;&#x6570;&#x63A8;&#x5BFC;&#xFF1A;f(span&lt;int&gt;{a, 100})</span>
f({a,x/<span class="hljs-number">2</span>});  <span class="hljs-comment">// &#x53EF;&#x4EE5;&#xFF1A;a &#x7684;&#x524D;&#x534A;&#x90E8;&#x5206;</span>
f({a,x+<span class="hljs-number">1</span>});  <span class="hljs-comment">// &#x707E;&#x96BE;</span>
</code></pre>
<p>&#x81EA;&#x7136;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x5143;&#x7D20;&#x8BBF;&#x95EE;&#x4E5F;&#x529E;&#x5F97;&#x5230;&#xFF0C;&#x6BD4;&#x5982; <code>a[7]=9</code>&#xFF0C;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x671F;&#x4E5F;&#x80FD;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x3002;<code>span</code> &#x7684;&#x8303;&#x56F4;&#x68C0;&#x67E5;&#x662F; C++ &#x6838;&#x5FC3;&#x6307;&#x5357;&#x652F;&#x6301;&#x5E93;&#xFF08;GSL&#xFF09;&#x7684;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5C06; <code>span</code> &#x7EB3;&#x5165; C++20 &#x7684;&#x6700;&#x5177;&#x4E89;&#x8BAE;&#x7684;&#x90E8;&#x5206;&#x5728;&#x4E8E;&#x4E0B;&#x6807;&#x548C;&#x5927;&#x5C0F;&#x7684;&#x7C7B;&#x578B;&#x3002;C++ &#x6838;&#x5FC3;&#x6307;&#x5357;&#x4E2D; <code>span::size()</code> &#x88AB;&#x5B9A;&#x4E49;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6709;&#x7B26;&#x53F7;&#x6574;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6807;&#x51C6;&#x5E93;&#x5BB9;&#x5668;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x3002;&#x4E0B;&#x6807;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x7C7B;&#x4F3C;&#x3002;&#x50CF;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x4E0B;&#x6807;&#x4E00;&#x5411;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x800C;&#x5728;&#x6807;&#x51C6;&#x5E93;&#x5BB9;&#x5668;&#x4E2D;&#x4E0B;&#x6807;&#x5374;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x4E2A;&#x53E4;&#x8001;&#x4E89;&#x8BAE;&#x7684;&#x91CD;&#x6F14;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x7EC4;&#x4EBA;&#x8BA4;&#x4E3A;&#x663E;&#x7136;&#x4E0B;&#x6807;&#x4F5C;&#x4E3A;&#x975E;&#x8D1F;&#x6570;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x3002;</li>
<li>&#x4E00;&#x7EC4;&#x4EBA;&#x8BA4;&#x4E3A;&#x4E0E;&#x6807;&#x51C6;&#x5E93;&#x5BB9;&#x5668;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#x66F4;&#x91CD;&#x8981;&#xFF0C;&#x8FD9;&#x70B9;&#x4F7F;&#x5F97;&#x4F7F;&#x7528;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x53BB;&#x7684;&#x5931;&#x8BEF;&#x53D8;&#x5F97;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;</li>
<li>&#x4E00;&#x7EC4;&#x4EBA;&#x8BA4;&#x4E3A;&#x4F7F;&#x7528;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x53BB;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x975E;&#x8D1F;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x8BEF;&#x5BFC;&#xFF08;&#x7ED9;&#x4EBA;&#x4E00;&#x79CD;&#x865A;&#x5047;&#x7684;&#x5B89;&#x5168;&#x611F;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x4E4B;&#x4E00;&#x3002;</li>
</ul>
<p>&#x4E0D;&#x987E; <code>span</code> &#x6700;&#x521D;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#xFF08;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#xFF09;&#x548C;&#x5B9E;&#x73B0;&#x8005;&#x7684;&#x5F3A;&#x70C8;&#x53CD;&#x5BF9;&#xFF0C;&#x7B2C;&#x4E8C;&#x7EC4;&#x8D62;&#x5F97;&#x4E86;&#x6295;&#x7968;&#xFF0C;&#x5E76;&#x53D7;&#x5230;&#x7B2C;&#x4E00;&#x7EC4;&#x70ED;&#x60C5;&#x5730;&#x652F;&#x6301;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;<code>std::span</code> &#x62E5;&#x6709;&#x65E0;&#x7B26;&#x53F7;&#x7684;&#x8303;&#x56F4;&#x5927;&#x5C0F;&#x548C;&#x4E0B;&#x6807;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x60B2;&#x4F24;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x5373;&#x672A;&#x80FD;&#x5229;&#x7528;&#x4E00;&#x4E2A;&#x96BE;&#x5F97;&#x7684;&#x673A;&#x4F1A;&#x6765;&#x5F25;&#x8865;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x8BA8;&#x538C;&#x7684;&#x8001;&#x9519;&#x8BEF; [Stroustrup 2018e]&#x3002;C++ &#x59D4;&#x5458;&#x4F1A;&#x9009;&#x62E9;&#x4E86;&#x4E0E;&#x95EE;&#x9898;&#x517C;&#x5BB9;&#x800C;&#x4E0D;&#x662F;&#x6D88;&#x9664;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x7684;&#x9519;&#x8BEF;&#x6765;&#x6E90;&#xFF0C;&#x8FD9;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x53EF;&#x4EE5;&#x9884;&#x89C1;&#x7684;&#xFF0C;&#x4E5F;&#x7B97;&#x4E0D;&#x65E0;&#x9053;&#x7406;&#x5427;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x7528;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x4F5C;&#x4E3A;&#x4E0B;&#x6807;&#x4F1A;&#x51FA;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x60C5;&#x7EEA;&#x5316;&#x7684;&#x8BDD;&#x9898;&#x3002;&#x6211;&#x66FE;&#x6536;&#x5230;&#x5F88;&#x591A;&#x5C01;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684;&#x4EC7;&#x6068;&#x90AE;&#x4EF6;&#x3002;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x5E76;&#x4E0D;&#x4EE5;&#x81EA;&#x7136;&#x6570;&#x4E3A;&#x6A21;&#x578B;&#xFF1A;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x4F7F;&#x7528;&#x6A21;&#x7B97;&#x6570;&#xFF0C;&#x5305;&#x62EC;&#x51CF;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C; <code>ch</code> &#x662F;&#x4E2A; <code>unsigned char</code>&#xFF0C;<code>ch+100</code> &#x5C06;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6EA2;&#x51FA;&#x3002;</li>
<li>&#x6574;&#x6570;&#x548C;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x5F7C;&#x6B64;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#xFF0C;&#x7A0D;&#x4E0D;&#x7559;&#x610F;&#x8D1F;&#x6570;&#x503C;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x5DE8;&#x5927;&#x7684;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x503C;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x6BD4;&#x5982;&#xFF0C;<code>-2&lt;2u</code> &#x4E3A;&#x5047;&#xFF1B;<code>2u</code> &#x662F; <code>unsigned</code>&#xFF0C;&#x56E0;&#x6B64; <code>-2</code> &#x5728;&#x6BD4;&#x8F83;&#x524D;&#x4F1A;&#x88AB;&#x8F6C;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x6B63;&#x6574;&#x6570;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#x5076;&#x5C14;&#x53EF;&#x89C1;&#x7684;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">size_t</span> i = n<span class="hljs-number">-1</span>; i &gt;= <span class="hljs-number">0</span>; --i) { <span class="hljs-comment">/* ... */</span> }  <span class="hljs-comment">// &#x201C;&#x53CD;&#x5411;&#x5FAA;&#x73AF;&#x201D;</span>
</code></pre>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x7684;&#x7C7B;&#x578B; <code>size_t</code> &#x662F;&#x65E0;&#x7B26;&#x53F7;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x5F88;&#x660E;&#x663E;&#x7ED3;&#x679C;&#x6C38;&#x8FDC; <code>&gt;=0</code>&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x4F5C;&#x4E3A; C++ &#x7EE7;&#x627F;&#x81EA; C &#x7684;&#x7279;&#x6027;&#xFF0C;&#x6709;&#x7B26;&#x53F7;&#x548C;&#x65E0;&#x7B26;&#x53F7;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x89C4;&#x5219;&#x51E0;&#x5341;&#x5E74;&#x6765;&#x90FD;&#x662F;&#x90A3;&#x79CD;&#x96BE;&#x4EE5;&#x53D1;&#x73B0;&#x7684;&#x9519;&#x8BEF;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x3002;&#x4F46;&#x8BF4;&#x670D;&#x59D4;&#x5458;&#x4F1A;&#x53BB;&#x89E3;&#x51B3;&#x90A3;&#x4E9B;&#x8001;&#x95EE;&#x9898;&#x603B;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x3002;</p>
<h2 id="94-&#x5E76;&#x53D1;">9.4 &#x5E76;&#x53D1;</h2>
<p>&#x5C3D;&#x7BA1;&#x505A;&#x51FA;&#x4E86;&#x82F1;&#x52C7;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x5E76;&#x6B63;&#x5728;&#x5F62;&#x6210;&#x5E7F;&#x6CDB;&#x7684;&#x5171;&#x8BC6;&#xFF0C;&#x4F46;&#x662F;&#x4EBA;&#x4EEC;&#x6240;&#x671F;&#x671B;&#x7684;&#x901A;&#x7528;&#x5E76;&#x53D1;&#x6A21;&#x578B;&#xFF08;&#x201C;&#x6267;&#x884C;&#x5668;&#x201D;&#xFF09;&#x5728; C++20 &#x4E2D;&#x8FD8;&#x6CA1;&#x6709;&#x51C6;&#x5907;&#x597D;&#xFF08;<a href="08.html#881-&#x7F51;&#x7EDC;&#x5E93;">&#xA7;8.8.1</a>&#xFF09;&#x3002;&#x8FD9;&#x5E76;&#x975E;&#x662F;&#x56E0;&#x4E3A;&#x7F3A;&#x4E4F;&#x52AA;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x52AA;&#x529B;&#x4E2D;&#x5305;&#x62EC;&#x4E86; 2018 &#x5E74; 9 &#x6708;&#x5728;&#x534E;&#x76DB;&#x987F;&#x5DDE;&#x8D1D;&#x5C14;&#x7EF4;&#x5C14;&#x4E3E;&#x884C;&#x7684;&#x4E3A;&#x671F;&#x4E24;&#x5929;&#x7684;&#x7279;&#x522B;&#x4F1A;&#x8BAE;&#xFF0C;&#x7EA6;&#x6709; 25 &#x4EBA;&#x51FA;&#x5E2D;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x6765;&#x81EA;&#x82F1;&#x4F1F;&#x8FBE;&#x3001;Facebook &#x548C;&#x7F8E;&#x56FD;&#x56FD;&#x5BB6;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x4EE3;&#x8868;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6709;&#x51E0;&#x4E2A;&#x4E0D;&#x90A3;&#x4E48;&#x5267;&#x70C8;&#x7684;&#x6709;&#x7528;&#x6539;&#x8FDB;&#x8FD8;&#x662F;&#x53CA;&#x65F6;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><code>jthread</code> &#x548C;&#x505C;&#x6B62;&#x4EE4;&#x724C; [Josuttis et al. 2019a]</li>
<li><code>atomic&lt;shared_ptr&lt;T&gt;&gt;</code> [Sutter 2017b]</li>
<li>&#x7ECF;&#x5178;&#x7684;&#x4FE1;&#x53F7;&#x91CF; [Lelbach et al. 2019]</li>
<li>&#x5C4F;&#x969C;&#x548C;&#x9501;&#x5B58;&#x5668; [Lelbach et al. 2019]</li>
<li>&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x7684;&#x4FEE;&#x590D;&#x548C;&#x6539;&#x8FDB; [Meredith and Sutter 2017]</li>
</ul>
<p><code>jthread</code>&#xFF08;&#x201C;joining thread&#x201D;&#x7684;&#x7F29;&#x5199;&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x9075;&#x5B88; RAII &#x7684;&#x7EBF;&#x7A0B;&#xFF1B;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C; <code>jthread</code> &#x8D85;&#x51FA;&#x4F5C;&#x7528;&#x57DF;&#x4E86;&#xFF0C;&#x5B83;&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x5C06;&#x5408;&#x5E76;&#x7EBF;&#x7A0B;&#x800C;&#x4E0D;&#x662F;&#x7EC8;&#x6B62;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-cpp"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">some_fct</span><span class="hljs-params">()</span>
</span>{
    thread t1;
    jthread t2;
    <span class="hljs-comment">// ...</span>
}
</code></pre>
<p>&#x5728;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x6700;&#x540E;&#xFF0C;<code>t1</code> &#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4F1A;&#x7EC8;&#x6B62;&#x7A0B;&#x5E8F;&#xFF0C;&#x9664;&#x975E; <code>t1</code> &#x7684;&#x4EFB;&#x52A1;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x5DF2;&#x7ECF; <code>join</code> &#x6216; <code>detach</code>&#xFF0C;&#x800C; <code>t2</code> &#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x5C06;&#x4F1A;&#x7B49;&#x5F85;&#x5176;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF08;C++11 &#x4E4B;&#x524D;&#xFF09;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#xFF08;&#x5305;&#x62EC;&#x6211;&#x5728;&#x5185;&#xFF09;&#x90FD;&#x5E0C;&#x671B; <code>thread</code> &#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x5982;&#x4ECA; <code>jthread</code> &#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x662F;&#x6839;&#x690D;&#x4E8E;&#x4F20;&#x7EDF;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x7684;&#x4EBA;&#x575A;&#x6301;&#x8BA4;&#x4E3A;&#x7EC8;&#x6B62;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x8981;&#x8FDC;&#x6BD4;&#x9020;&#x6210;&#x6B7B;&#x9501;&#x597D;&#x5F97;&#x591A;&#x3002;2012 &#x5E74;&#x548C; 2013 &#x5E74;&#xFF0C;Herb Sutter &#x66FE;&#x7ECF;&#x63D0;&#x51FA;&#x8FC7;&#x5408;&#x5E76;&#x7EBF;&#x7A0B;&#xFF08;joining thread&#xFF09;[Sutter 2012, 2013a]&#x3002;&#x8FD9;&#x5F15;&#x53D1;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x5374;&#x6CA1;&#x6709;&#x4F5C;&#x51FA;&#x4EFB;&#x4F55;&#x51B3;&#x5B9A;&#x3002;2016 &#x5E74;&#xFF0C;Ville Voutilainen &#x603B;&#x7ED3;&#x4E86;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E3A;&#x5C06;&#x5408;&#x5E76;&#x7EBF;&#x7A0B;&#x7EB3;&#x5165; C++17 &#x53D1;&#x8D77;&#x4E86;&#x6295;&#x7968; [Voutilainen 2016a]&#x3002;&#x6295;&#x7968;&#x652F;&#x6301;&#x8005;&#x4F17;&#x591A;&#x4EE5;&#x81F3;&#x4E8E;&#x6211;&#xFF08;&#x53EA;&#x662F;&#x534A;&#x5F00;&#x73A9;&#x7B11;&#x5730;&#xFF09;&#x5EFA;&#x8BAE;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x628A;&#x5408;&#x5E76;&#x7EBF;&#x7A0B;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x63D0;&#x4EA4;&#x7ED9; C++14&#x3002;&#x4F46;&#x662F;&#x4E0D;&#x77E5;&#x4F55;&#x6545;&#xFF0C;&#x8FDB;&#x5C55;&#x53C8;&#x518D;&#x6B21;&#x505C;&#x6EDE;&#x3002;&#x5230;&#x4E86; 2017 &#x5E74;&#xFF0C;Nico Josuttis &#x53C8;&#x4E00;&#x6B21;&#x63D0;&#x51FA;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x5728;&#x516B;&#x6B21;&#x4FEE;&#x8BA2;&#x548C;&#x52A0;&#x5165;&#x4E86;&#x505C;&#x6B62;&#x4EE4;&#x724C;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x63D0;&#x6848;&#x624D;&#x6210;&#x529F;&#x8FDB;&#x5165;&#x4E86; C++20 [Josuttis et al. 2019a]&#x3002;</p>
<p>&#x201C;&#x505C;&#x6B62;&#x4EE4;&#x724C;&#x201D;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x4E2A;&#x8001;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x5728;&#x6211;&#x4EEC;&#x5BF9;&#x7EBF;&#x7A0B;&#x7684;&#x7ED3;&#x679C;&#x4E0D;&#x518D;&#x611F;&#x5174;&#x8DA3;&#x540E;&#x505C;&#x6B62;&#x5B83;&#x3002;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;&#x4F7F;&#x7528;&#x534F;&#x4F5C;&#x5F0F;&#x7684;&#x7EBF;&#x7A0B;&#x53D6;&#x6D88;&#x65B9;&#x5F0F;&#xFF08;<a href="04.html#412-&#x7EBF;&#x7A0B;&#x548C;&#x9501;">&#xA7;4.1.2</a>&#xFF09;&#x3002;&#x5047;&#x5982;&#x6211;&#x60F3;&#x8981;&#x4E00;&#x4E2A;  <code>jthread</code> &#x505C;&#x6B62;&#xFF0C;&#x6211;&#x5C31;&#x8BBE;&#x7F6E;&#x5B83;&#x7684;&#x505C;&#x6B62;&#x4EE4;&#x724C;&#x3002;&#x7EBF;&#x7A0B;&#x6709;&#x4E49;&#x52A1;&#x4E0D;&#x65F6;&#x5730;&#x53BB;&#x68C0;&#x67E5;&#x505C;&#x6B62;&#x4EE4;&#x724C;&#x662F;&#x5426;&#x88AB;&#x8BBE;&#x7F6E;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x88AB;&#x8BBE;&#x7F6E;&#x4E86;&#x5C31;&#x8FDB;&#x884C;&#x6E05;&#x7406;&#x548C;&#x9000;&#x51FA;&#x3002;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x7531;&#x6765;&#x5DF2;&#x4E45;&#xFF0C;&#x51E0;&#x4E4E;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x6709;&#x4E3B;&#x5FAA;&#x73AF;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x80FD;&#x5B8C;&#x597D;&#x9AD8;&#x6548;&#x5730;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x4E3B;&#x5FAA;&#x73AF;&#x91CC;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x505C;&#x6B62;&#x4EE4;&#x724C;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x547D;&#x540D;&#x6210;&#x4E86;&#x95EE;&#x9898;&#xFF1A;<code>safe_thread</code>&#x3001;<code>ithread</code>&#xFF08;<code>i</code> &#x4EE3;&#x8868;&#x53EF;&#x4E2D;&#x65AD;&#xFF09;&#x3001;<code>raii_thread</code>&#x3001;<code>joining_thread</code>&#xFF0C;&#x6700;&#x7EC8;&#x6210;&#x4E86; <code>jthread</code>&#x3002;C++ &#x6838;&#x5FC3;&#x6307;&#x5357;&#x652F;&#x6301;&#x5E93; (GSL) &#x4E2D;&#x79F0;&#x5176;&#x4E3A; <code>gsl::thread</code>&#x3002;&#x8BF4;&#x771F;&#x7684;&#xFF0C;&#x6700;&#x5408;&#x9002;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x662F; <code>thread</code>&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x90A3;&#x4E2A;&#x540D;&#x5B57;&#x5DF2;&#x7ECF;&#x88AB;&#x4E00;&#x7C7B;&#x4E0D;&#x592A;&#x6709;&#x7528;&#x7684;&#x7EBF;&#x7A0B;&#x5360;&#x7528;&#x4E86;&#x3002;</p>
<h2 id="95-&#x6B21;&#x8981;&#x7279;&#x6027;">9.5 &#x6B21;&#x8981;&#x7279;&#x6027;</h2>
<p>C++20 &#x63D0;&#x4F9B;&#x4E86;&#x8BB8;&#x591A;&#x6B21;&#x8981;&#x7684;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>C99 &#x98CE;&#x683C;&#x7684;&#x6307;&#x6D3E;&#x521D;&#x59CB;&#x5316;&#x5668; [Shen et al. 2016]</li>
<li>&#x5BF9; lambda &#x6355;&#x83B7;&#x7684;&#x6539;&#x8FDB; [K&#xF6;ppe 2017b]</li>
<li>&#x6CDB;&#x578B; lambda &#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x5217;&#x8868; [Dionne 2017]</li>
<li>&#x8303;&#x56F4; <code>for</code> &#x4E2D;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x53D8;&#x91CF;&#xFF08;<a href="08.html#87-&#x6761;&#x4EF6;&#x7684;&#x663E;&#x5F0F;&#x6D4B;&#x8BD5;">&#xA7;8.7</a>&#xFF09;</li>
<li>&#x4E0D;&#x6C42;&#x503C;&#x8BED;&#x5883;&#x4E2D;&#x7684; lambda &#x8868;&#x8FBE;&#x5F0F; [Dionne 2016]</li>
<li>lambda &#x6355;&#x83B7;&#x4E2D;&#x7684;&#x5305;&#x5C55;&#x5F00; [Revzin 2017]</li>
<li>&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x79FB;&#x9664;&#x5BF9; <code>typename</code> &#x7684;&#x9700;&#x8981; [Vandevoorde 2017]</li>
<li>&#x66F4;&#x591A;&#x5C5E;&#x6027;&#xFF1A;<code>[[likely]]</code> &#x548C; <code>[[unlikely]]</code> [Trychta 2016]</li>
<li>&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x5B8F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<code>source_location</code> &#x7ED9;&#x51FA;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6E90;&#x7801;&#x4F4D;&#x7F6E; [Douglas and Jabot 2019]</li>
<li>&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#x5B8F; [Voutilainen and Wakely 2018]</li>
<li>&#x6761;&#x4EF6; <code>explicit</code> [Revzin and Lavavej 2018]</li>
<li>&#x6709;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x4FDD;&#x8BC1;&#x662F; 2 &#x7684;&#x8865;&#x7801; [Bastien 2018]</li>
<li>&#x6570;&#x5B66;&#x4E0A;&#x7684;&#x5E38;&#x6570;&#xFF0C;&#x6BD4;&#x5982; <code>pi</code> &#x548C; <code>sqrt2</code> [Minkovsky and McFarlane 2019]</li>
<li>&#x4F4D;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x8F6E;&#x8F6C;&#x548C;&#x7EDF;&#x8BA1; 1 &#x7684;&#x4E2A;&#x6570; [Maurer 2019]</li>
</ul>
<p>&#x5176;&#x4E2D;&#x6709;&#x4E9B;&#x5C5E;&#x4E8E;&#x6539;&#x8FDB;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x62C5;&#x5FC3;&#x7684;&#x662F;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#x7684;&#x65B0;&#x7279;&#x6027;&#x7684;&#x6570;&#x91CF;&#x4E4B;&#x5927;&#x4F1A;&#x9020;&#x6210;&#x5371;&#x5BB3; [Stroustrup 2018d]&#x3002;&#x5BF9;&#x4E8E;&#x975E;&#x4E13;&#x5BB6;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x4F7F;&#x5F97;&#x8BED;&#x8A00;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x96BE;&#x4EE5;&#x5B66;&#x4E60;&#xFF0C;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002;&#x6211;&#x53CD;&#x5BF9;&#x4E00;&#x4E9B;&#x5229;&#x5F0A;&#x53C2;&#x534A;&#x7684;&#x7279;&#x6027;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x6307;&#x6D3E;&#x521D;&#x59CB;&#x5316;&#x5668;&#x7684;&#x5730;&#x65B9;&#x539F;&#x672C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x7684;&#x4EE3;&#x7801;&#xFF09;&#x3002;&#x5F88;&#x591A;&#x7279;&#x6027;&#x5177;&#x6709;&#x7279;&#x6B8A;&#x7528;&#x9014;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x201C;&#x4E13;&#x5BB6;&#x4E13;&#x7528;&#x201D;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x603B;&#x662F;&#x9886;&#x4F1A;&#x4E0D;&#x5230;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x67D0;&#x4E9B;&#x4EBA;&#x6709;&#x67D0;&#x79CD;&#x597D;&#x5904;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5BF9;&#x4E8E; C++ &#x6574;&#x4F53;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x51C0;&#x8D1F;&#x503A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x90A3;&#x4E9B;&#x589E;&#x52A0;&#x5199;&#x6CD5;&#x548C;&#x8BED;&#x4E49;&#x4E0A;&#x7684;&#x901A;&#x7528;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5C0F;&#x7279;&#x6027;&#xFF0C;&#x5219;&#x603B;&#x662F;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x3002;</p>
<p>&#x4ECE;&#x6807;&#x51C6;&#x5316;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5373;&#x4F7F;&#x6700;&#x5C0F;&#x7684;&#x7279;&#x6027;&#x4E5F;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x5904;&#x7406;&#x3001;&#x8BB0;&#x5F55;&#x548C;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x4E9B;&#x65F6;&#x95F4;&#x662F;&#x7701;&#x4E0D;&#x6389;&#x7684;&#x3002;</p>
<h2 id="96-&#x8FDB;&#x884C;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;">9.6 &#x8FDB;&#x884C;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;</h2>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5F88;&#x591A;&#x628A;&#x76EE;&#x6807;&#x653E;&#x5728; C++20 &#x4E4B;&#x540E;&#x7248;&#x672C;&#x7684;&#x5DE5;&#x4F5C;&#x8FD8;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E9B;&#x539F;&#x672C;&#x76EE;&#x6807;&#x662F;&#x5728; C++20 &#x53D1;&#x5E03;&#x7684;&#x5DE5;&#x4F5C;&#x5219;&#x6CA1;&#x80FD;&#x53CA;&#x65F6;&#x5B8C;&#x6210;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#xFF1A;</p>
<ul>
<li><a href="08.html#881-&#x7F51;&#x7EDC;&#x5E93;">&#xA7;8.8.1</a>&#xFF1A;&#x7F51;&#x7EDC;&#x548C;&#x6267;&#x884C;&#x5668;&#x2014;&#x2014;&#x518D;&#x5EA6;&#x5EF6;&#x8FDF;&#x3002;</li>
<li><a href="#961-&#x5951;&#x7EA6;">&#xA7;9.6.1</a>&#xFF1A;&#x5951;&#x7EA6;&#x2014;&#x2014;&#x65AD;&#x8A00;&#x3001;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#x548C;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#xFF1B;&#x539F;&#x672C;&#x76EE;&#x6807;&#x662F; C++20&#xFF0C;&#x4F46;&#x5EF6;&#x8FDF;&#x4E86;&#x3002;</li>
<li><a href="#962-&#x9759;&#x6001;&#x53CD;&#x5C04;">&#xA7;9.6.2</a>&#xFF1A;&#x53CD;&#x5C04;&#x2014;&#x2014;&#x57FA;&#x4E8E;&#x5F53;&#x524D;&#x7F16;&#x8BD1;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x4EE3;&#x7801;&#x6CE8;&#x5165;&#x7A0B;&#x5E8F;&#xFF1B;&#x76EE;&#x6807;&#x662F; C++23&#x3002;</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5DE5;&#x4F5C;&#x7EC4;&#x548C;&#x7814;&#x7A76;&#x7EC4;&#x4E5F;&#x4ECD;&#x6709;&#x5DE5;&#x4F5C;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#xFF08;<a href="03.html#32-&#x7EC4;&#x7EC7;">&#xA7;3.2</a>&#xFF09;[Stroustrup 2018d]&#x3002;</p>
<h3 id="961-&#x5951;&#x7EA6;">9.6.1 &#x5951;&#x7EA6;</h3>
<p>&#x5951;&#x7EA6;&#x7684;&#x7279;&#x6B8A;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x4E0D;&#x4F46;&#x5F88;&#x591A;&#x4EBA;&#x5E0C;&#x671B;&#x5B83;&#x53EF;&#x4EE5;&#x8FDB;&#x5165; C++20&#xFF0C;&#x800C;&#x4E14;&#x5951;&#x7EA6;&#x662F;&#x88AB;&#x6295;&#x7968;&#x5199;&#x5165; C++20 &#x7684;&#x5DE5;&#x4F5C;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x6700;&#x540E;&#x4E00;&#x523B;&#x88AB;&#x4ECE;&#x4E2D;&#x79FB;&#x9664;&#x3002;&#x4E00;&#x4E2A;&#x7531; John Spicer &#x4E3B;&#x6301;&#x7684;&#x65B0;&#x7684;&#x7814;&#x7A76;&#x7EC4; SG21 &#x5DF2;&#x7ECF;&#x6210;&#x7ACB;&#xFF0C;&#x8BD5;&#x56FE;&#x4E3A; C++23 &#x6216;&#x8005; C++26 &#x63D0;&#x4F9B;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x5951;&#x7EA6;&#x3002;&#x5951;&#x7EA6;&#x4E8E; C++20 &#x7684;&#x906D;&#x9047;&#x662F;&#x4EE4;&#x4EBA;&#x60CB;&#x60DC;&#x7684;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4E5F;&#x80FD;&#x7ED9;&#x4EBA;&#x4EE5;&#x542F;&#x53D1;&#x3002;</p>
<p>&#x5404;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x5951;&#x7EA6;&#x5728; C++ &#x548C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x6709;&#x7740;&#x60A0;&#x4E45;&#x7684;&#x5386;&#x53F2;&#x3002;&#x6211;&#x8BB0;&#x5F97;&#x5728; 1970 &#x5E74;&#x4EE3;&#x521D;&#xFF0C;&#x5F53;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x9047;&#x5230; Peter Naur &#x7684;&#x4E0D;&#x53D8;&#x91CF; [Naur 1966] &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E00;&#x5EA6;&#x88AB;&#x5B83;&#x6DF1;&#x6DF1;&#x5438;&#x5F15;&#x3002;&#x5728; 1990 &#x5E74;&#x4EE3;&#x65E9;&#x671F;&#xFF0C;&#x4E00;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A; A++ &#x7684;&#x65AD;&#x8A00;&#x7CFB;&#x7EDF;&#x88AB;&#x8003;&#x8651;&#x7528;&#x4E8E; C++&#xFF0C;&#x4F46;&#x5374;&#x88AB;&#x8BA4;&#x4E3A;&#x6D89;&#x53CA;&#x9762;&#x592A;&#x5E7F;&#x800C;&#x4E0D;&#x73B0;&#x5B9E;&#x3002;&#x5728; 1980 &#x5E74;&#x4EE3;&#x665A;&#x671F;&#xFF0C;Bertrand Meyer &#x66FE;&#x63A8;&#x5E7F;&#x8FC7; Eiffel &#x91CC;&#x201C;&#x5951;&#x7EA6;&#x201D;&#x7684;&#x6982;&#x5FF5; [Meyer 1994]&#x3002;&#x4F5C;&#x4E3A; C++0x &#x52AA;&#x529B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4E00;&#x4E9B;&#x63D0;&#x6848; [Crowl and Ottosen 2006] &#x5728; C++ &#x59D4;&#x5458;&#x4F1A;&#x53D7;&#x5230;&#x4E86;&#x9AD8;&#x5EA6;&#x91CD;&#x89C6;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x5374;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#x88AB;&#x8BA4;&#x4E3A;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x5199;&#x6CD5;&#x4E5F;&#x4E0D;&#x4F18;&#x96C5;&#x3002;</p>
<p>&#x591A;&#x5E74;&#x6765;&#xFF0C;Bloomberg&#xFF08;&#x90A3;&#x5BB6;&#x7EBD;&#x7EA6;&#x5E02;&#x7684;&#x91D1;&#x878D;&#x4FE1;&#x606F;&#x516C;&#x53F8;&#xFF09;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&#x201C;&#x5951;&#x7EA6;&#x201D;&#x7684;&#x5B9E;&#x65F6;&#x65AD;&#x8A00;&#x7CFB;&#x7EDF;&#x53BB;&#x6355;&#x83B7;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x3002;2013 &#x5E74;&#xFF0C;&#x6765;&#x81EA; Bloomberg &#x7684; John Lakos &#x63D0;&#x8BAE;&#x6807;&#x51C6;&#x5316;&#x8BE5;&#x7CFB;&#x7EDF; [Lakos and Zakharov 2013]&#x3002;&#x8FD9;&#x4E2A;&#x63D0;&#x6848;&#x53D7;&#x5230;&#x4E86;&#x597D;&#x8BC4;&#xFF0C;&#x4F46;&#x5B83;&#x9047;&#x5230;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5B83;&#x57FA;&#x4E8E;&#x5B8F;</li>
<li>&#x5B83;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#x662F;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4E2D;&#x7684;&#x65AD;&#x8A00;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53EF;&#x4EE5;&#x589E;&#x5F3A;&#x63A5;&#x53E3;&#x7684;&#x4E1C;&#x897F;</li>
</ul>
<p>&#x4FEE;&#x8BA2;&#x63A5;&#x8E35;&#x800C;&#x81F3;&#xFF0C;&#x4F46;&#x662F;&#x5171;&#x8BC6;&#x5374;&#x5E76;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x3002;&#x4E3A;&#x4E86;&#x6253;&#x7834;&#x50F5;&#x5C40;&#xFF0C;&#x4E00;&#x7FA4;&#x6765;&#x81EA;&#x5FAE;&#x8F6F;&#x3001;Facebook&#x3001;&#x8C37;&#x6B4C;&#x548C;&#x9A6C;&#x5FB7;&#x91CC;&#x7684;&#x5361;&#x6D1B;&#x65AF;&#x4E09;&#x4E16;&#x5927;&#x5B66;&#x7684;&#x4EBA;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x201C;&#x7B80;&#x5355;&#x5951;&#x7EA6;&#x201D;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F7F;&#x7528;&#x5B8F;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#x548C;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF08;&#x6B63;&#x5982; C++0x &#x6240;&#x5C1D;&#x8BD5;&#x7684;&#xFF09;[Garcia et al. 2015]&#x3002;&#x548C; Bloomberg &#x7684;&#x63D0;&#x6848;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E00;&#x63D0;&#x6848;&#x5F97;&#x5230;&#x4E86;&#x591A;&#x5E74;&#x5927;&#x89C4;&#x6A21;&#x5DE5;&#x4E1A;&#x5E94;&#x7528;&#x7684;&#x80CC;&#x4E66;&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x5728;&#x9759;&#x6001;&#x5206;&#x6790;&#x4E2D;&#x4F7F;&#x7528;&#x5951;&#x7EA6;&#x3002;J. Daniel Garcia&#xFF08;&#x5361;&#x6D1B;&#x65AF;&#x4E09;&#x4E16;&#x5927;&#x5B66;&#xFF09;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#x4EE5;&#x6C42;&#x505A;&#x51FA;&#x6EE1;&#x8DB3;&#x5404;&#x65B9;&#x9762;&#x9700;&#x6C42;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x8BE5;&#x63D0;&#x6848;&#x4E5F;&#x906D;&#x5230;&#x4E86;&#x53CD;&#x5BF9;&#x3002;</p>
<p>&#x7ECF;&#x8FC7;&#x4E86;&#x65E0;&#x6570;&#x6B21;&#x7684;&#x4F1A;&#x8BAE;&#x3001;&#x591A;&#x7BC7;&#x8BBA;&#x6587;&#x548C;&#xFF08;&#x5076;&#x5C14;&#x6FC0;&#x70C8;&#x7684;&#xFF09;&#x8BA8;&#x8BBA;&#x4E4B;&#x540E;&#xFF0C;&#x59A5;&#x534F;&#x663E;&#x7136;&#x662F;&#x96BE;&#x4EE5;&#x8FBE;&#x6210;&#x4E86;&#x3002;&#x4E24;&#x4E2A;&#x5C0F;&#x7EC4;&#x8BF7;&#x6C42;&#x6211;&#x6765;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#x3002;&#x6211;&#x4E4B;&#x524D;&#x5BA3;&#x79F0;&#xFF0C;&#x8BA8;&#x8BBA;&#x592A;&#x4E13;&#x6CE8;&#x5728;&#x7EC6;&#x679D;&#x672B;&#x8282;&#x4E0A;&#x4E86;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x63D0;&#x6848;&#xFF0C;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x5C0F;&#x7EC4;&#x7684;&#x6838;&#x5FC3;&#x8BC9;&#x6C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x4ED6;&#x4EEC;&#x8981;&#x6211;&#x6765;&#x8BC1;&#x660E;&#x6211;&#x7684;&#x63A8;&#x65AD;&#xFF0C;&#x62FF;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x6700;&#x5C0F;&#x63D0;&#x6848;&#x51FA;&#x6765;&#x3002;&#x5728;&#x6211;&#x548C;&#x4E24;&#x4E2A;&#x5C0F;&#x7EC4;&#x7684;&#x4EE3;&#x8868;&#x8F6E;&#x756A;&#x8BA8;&#x8BBA;&#x3001;&#x5DE5;&#x4F5C;&#x4E86;&#x76F8;&#x5F53;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x8054;&#x5408;&#x5404;&#x65B9;&#x5171;&#x540C;&#x8D77;&#x8349;&#x4E86;&#x8054;&#x5408;&#x63D0;&#x6848; [Dos Reis et al. 2016a]&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x4E0A;&#x662F;&#x76F8;&#x5F53;&#x5145;&#x5206;&#x7684;&#xFF0C;&#x5E76;&#x975E;&#x4E00;&#x4E2A;&#x653F;&#x6CBB;&#x4E0A;&#x7684;&#x59A5;&#x534F;&#x3002;&#x5B83;&#x65E8;&#x5728;&#x6EE1;&#x8DB3;&#x4E09;&#x65B9;&#x9762;&#x7684;&#x9700;&#x6C42;&#xFF08;&#x6309;&#x91CD;&#x8981;&#x6027;&#x6392;&#x5E8F;&#xFF09;&#xFF1A;</p>
<ul>
<li>&#x7CFB;&#x7EDF;&#x548C;&#x53EF;&#x63A7;&#x7684;&#x8FD0;&#x884C;&#x671F;&#x6D4B;&#x8BD5;</li>
<li>&#x4E3A;&#x9759;&#x6001;&#x5206;&#x6790;&#x5668;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;</li>
<li>&#x4E3A;&#x4F18;&#x5316;&#x5668;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;</li>
</ul>
<p>&#x5728; J. Daniel Garcia &#x9886;&#x5BFC;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x8BE5;&#x63D0;&#x6848;&#x6700;&#x7EC8;&#x5728; 2018 &#x5E74; 6 &#x6708;&#x6B63;&#x5F0F;&#x88AB; C++20 &#x91C7;&#x7EB3; [Dos Reis et al. 2018]&#x3002;</p>
<p>&#x4E3A;&#x907F;&#x514D;&#x5F15;&#x5165;&#x65B0;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5C5E;&#x6027;&#x8BED;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>[[assert: x+y&gt;0]]</code>&#x3002;&#x4E00;&#x4E2A;&#x5951;&#x7EA6;&#x5BF9;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x8D77;&#x4EFB;&#x4F55;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6EE1;&#x8DB3;&#x5C5E;&#x6027;&#x7684;&#x539F;&#x6765;&#x6982;&#x5FF5;&#xFF08;<a href="04.html#4210-&#x5C5E;&#x6027;">&#xA7;4.2.10</a>&#xFF09;&#x3002;</p>
<p>&#x6709;&#x4E09;&#x79CD;&#x5951;&#x7EA6;&#xFF1A;</p>
<ul>
<li><code>assert</code>&#x2014;&#x2014;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x65AD;&#x8A00;</li>
<li><code>expects</code>&#x2014;&#x2014;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E2D;&#x7684;&#x524D;&#x7F6E;&#x6761;&#x4EF6;</li>
<li><code>ensure</code>&#x2014;&#x2014;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E2D;&#x7684;&#x540E;&#x7F6E;&#x6761;&#x4EF6;</li>
</ul>
<p>&#x6709;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7B49;&#x7EA7;&#x7684;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#xFF1A;</p>
<ul>
<li><code>audit</code>&#x2014;&#x2014;&#x201C;&#x4EE3;&#x4EF7;&#x9AD8;&#x6602;&#x7684;&#x201D;&#x8C13;&#x8BCD;&#xFF0C;&#x4EC5;&#x5728;&#x67D0;&#x4E9B;&#x201C;&#x8C03;&#x8BD5;&#x6A21;&#x5F0F;&#x201D;&#x68C0;&#x67E5;</li>
<li><code>default</code>&#x2014;&#x2014;&#x201C;&#x4EE3;&#x4EF7;&#x4F4E;&#x5EC9;&#x7684;&#x201D;&#x8C13;&#x8BCD;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x751F;&#x4EA7;&#x4EE3;&#x7801;&#x4E2D;&#x68C0;&#x67E5;&#x4E5F;&#x662F;&#x53EF;&#x884C;&#x7684;</li>
<li><code>axiom</code>&#x2014;&#x2014;&#x4E3B;&#x8981;&#x7ED9;&#x9759;&#x6001;&#x5206;&#x6790;&#x5668;&#x770B;&#x7684;&#x8C13;&#x8BCD;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x4ECE;&#x4E0D;&#x68C0;&#x67E5;</li>
</ul>
<p>&#x5728;&#x8FDD;&#x53CD;&#x5951;&#x7EA6;&#x65F6;&#xFF0C;&#x5C06;&#x6267;&#x884C;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x7528;&#x6237;&#x5B89;&#x88C5;&#x7684;&#xFF09;&#x5951;&#x7EA6;&#x8FDD;&#x53CD;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x662F;&#x7A0B;&#x5E8F;&#x7ACB;&#x5373;&#x7EC8;&#x6B62;&#x3002;</p>
<p>&#x6211;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E8B;&#xFF1A;&#x6709;&#x4E00;&#x79CD;&#x6784;&#x5EFA;&#x6A21;&#x5F0F;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5728;&#x5951;&#x7EA6;&#x5931;&#x8D25;&#x540E;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x53CD;&#x5E94;&#x662F;&#x201C;&#x75AF;&#x4E86;&#x5427;&#xFF01;&#x5951;&#x7EA6;&#x65E8;&#x5728;&#x9632;&#x6B62;&#x8FDD;&#x53CD;&#x5951;&#x7EA6;&#x7684;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x201D;&#x3002;&#x90A3;&#x7B97;&#x662F;&#x6700;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x53CD;&#x5E94;&#x4E86;&#x3002;&#x4E0D;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;John Lakos &#x575A;&#x4FE1;&#xFF0C;&#x57FA;&#x4E8E; Bloomberg &#x4EE3;&#x7801;&#x7684;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#xFF0C;&#x5F53;&#x4F60;&#x628A;&#x5951;&#x7EA6;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x53E4;&#x8001;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#xFF0C;&#x5951;&#x7EA6;&#x603B;&#x662F;&#x4F1A;&#x88AB;&#x8FDD;&#x53CD;&#xFF1A;</p>
<ul>
<li>&#x67D0;&#x4E9B;&#x4EE3;&#x7801;&#x4F1A;&#x8FDD;&#x53CD;&#x5951;&#x7EA6;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x505A;&#x4EFB;&#x4F55;&#x8BE5;&#x5951;&#x7EA6;&#x6240;&#x8981;&#x9632;&#x6B62;&#x7684;&#x4E8B;&#x60C5;&#x3002;</li>
<li>&#x67D0;&#x4E9B;&#x65B0;&#x5951;&#x7EA6;&#x672C;&#x8EAB;&#x5C31;&#x5305;&#x542B;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x67D0;&#x4E9B;&#x65B0;&#x5951;&#x7EA6;&#x5177;&#x6709;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x6548;&#x679C;&#x3002;</li>
</ul>
<p>&#x6709;&#x4E86;&#x7EE7;&#x7EED;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5951;&#x7EA6;&#x8FDD;&#x53CD;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x53BB;&#x8BB0;&#x5F55;&#x65E5;&#x5FD7;&#x5E76;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x65E2;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x6B21;&#x8FD0;&#x884C;&#x4E2D;&#x68C0;&#x6D4B;&#x5230;&#x591A;&#x6B21;&#x8FDD;&#x89C4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA9;&#x5951;&#x7EA6;&#x5728;&#x5047;&#x5B9A;&#x6B63;&#x786E;&#x7684;&#x8001;&#x4EE3;&#x7801;&#x4E2D;&#x542F;&#x7528;&#x3002;&#x4EBA;&#x4EEC;&#x76F8;&#x4FE1;&#x8FD9;&#x662F;&#x9010;&#x6B65;&#x91C7;&#x7528;&#x5951;&#x7EA6;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5145;&#x8DB3;&#x7684;&#x7406;&#x7531;&#x53BB;&#x6DFB;&#x52A0;&#x7C7B;&#x4E0D;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x5141;&#x8BB8;&#x5728;&#x8986;&#x76D6;&#x51FD;&#x6570;&#x4E2D;&#x524A;&#x5F31;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#xFF0C;&#x6216;&#x5141;&#x8BB8;&#x5728;&#x8986;&#x76D6;&#x51FD;&#x6570;&#x4E2D;&#x589E;&#x5F3A;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#x3002;&#x8981;&#x70B9;&#x662F;&#x7B80;&#x5355;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x662F;&#x5148;&#x4E3A; C++20 &#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x7684;&#x521D;&#x59CB;&#x8BBE;&#x8BA1;&#xFF0C;&#x7136;&#x540E;&#x5982;&#x6709;&#x9700;&#x8981;&#x518D;&#x4E8E;&#x5176;&#x4E0A;&#x6DFB;&#x7816;&#x52A0;&#x74E6;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x7531; J. Daniel Garcia &#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x4E8E; 2018 &#x5E74; 6 &#x6708;&#x6295;&#x7968;&#x901A;&#x8FC7;&#x8FDB;&#x5165; C++ &#x59D4;&#x5458;&#x4F1A;&#x7684; C++20 &#x7684;&#x5DE5;&#x4F5C;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x867D;&#x7136;&#x89C4;&#x8303;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x76F8;&#x4FE1;&#x80FD;&#x591F;&#x8D76;&#x5728;&#x6700;&#x7EC8;&#x6807;&#x51C6;&#x53D1;&#x5E03;&#x524D;&#x7684;&#x4E24;&#x5E74;&#x5185;&#x4FEE;&#x590D;&#x6240;&#x6709;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EBA;&#x4EEC;&#x53D1;&#x73B0;&#x5DE5;&#x4F5C;&#x6587;&#x4EF6;&#x6587;&#x672C;&#x4E2D;&#x5141;&#x8BB8;&#x7F16;&#x8BD1;&#x5668;&#x57FA;&#x4E8E;&#x6240;&#x6709;&#x5951;&#x7EA6;&#xFF08;&#x65E0;&#x8BBA;&#x68C0;&#x67E5;&#x4E0E;&#x5426;&#xFF09;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x90A3;&#x5E76;&#x975E;&#x6709;&#x610F;&#x800C;&#x4E3A;&#x4E4B;&#x3002;&#x4ECE;&#x6240;&#x6709;&#x7684;&#x5951;&#x7EA6;&#x5728;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x90FD;&#x6709;&#x6548;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x8FD9;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5E26;&#x6709;&#x7279;&#x522B;&#x4E3A;&#x6355;&#x83B7;&#x201C;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x9519;&#x8BEF;&#x201D;&#x800C;&#x5199;&#x7684;&#x5951;&#x7EA6;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x5374;&#x662F;&#x707E;&#x96BE;&#x6027;&#x7684;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-cpp">[[assert: p!=<span class="hljs-literal">nullptr</span>]]
p-&gt;m = <span class="hljs-number">7</span>;
</code></pre>
<p>&#x5047;&#x5982; <code>p==nullptr</code>&#xFF0C;&#x90A3;&#x4E48; <code>p-&gt;m</code> &#x5C06;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x88AB;&#x5141;&#x8BB8;&#x5047;&#x8BBE;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF1B;&#x7531;&#x6B64;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x6389;&#x90A3;&#x4E9B;&#x5BFC;&#x81F4;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x8BA9;&#x4EBA;&#x5927;&#x5403;&#x4E00;&#x60CA;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8FDD;&#x53CD;&#x5951;&#x7EA6;&#x4E4B;&#x540E;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x88AB;&#x5141;&#x8BB8;&#x5047;&#x5B9A; <code>p-&gt;m</code> &#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x56E0;&#x6B64; <code>p!=nullptr</code>&#xFF1B;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x6D88;&#x9664;&#x5951;&#x7EA6;&#x5173;&#x4E8E; <code>p==nullptr</code> &#x7684;&#x68C0;&#x67E5;&#x3002;&#x8FD9;&#x79CD;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x65F6;&#x95F4;&#x65C5;&#x884C;&#x4F18;&#x5316;&#x201D;&#x7684;&#x505A;&#x6CD5;&#x5F53;&#x7136;&#x662F;&#x4E0E;&#x5951;&#x7EA6;&#x7684;&#x521D;&#x8877;&#x5927;&#x76F8;&#x5F84;&#x5EAD;&#xFF0C;&#x8FD8;&#x597D;&#x82E5;&#x5E72;&#x8865;&#x6551;&#x65B9;&#x6848;&#x88AB;&#x53CA;&#x65F6;&#x63D0;&#x51FA; [Garcia 2018; Stroustrup 2019c; Voutilainen 2019a]&#x3002;</p>
<p>2018 &#x5E74; 8 &#x6708;&#xFF0C;&#x5728; C++20 &#x65B0;&#x63D0;&#x6848;&#x7684;&#x6700;&#x540E;&#x671F;&#x9650;&#x8FC7;&#x540E;&#xFF0C;&#x7531; John Lakos &#x9886;&#x5BFC;&#x7684; Bloomberg &#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x7EC4;&#xFF0C;&#x5305;&#x62EC; Hyman Rosen &#x548C; Joshua Berne &#x5728;&#x5185;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x7684;&#x63D0;&#x6848; [Berne et al. 2018; Berne and Lakos 2018a,b; Lakos 2018]&#x3002;&#x7279;&#x6027;&#x51BB;&#x7ED3;&#x7684;&#x65E5;&#x671F;&#xFF08;&#x5BA1;&#x8BAE;&#x65B0;&#x63D0;&#x6848;&#x7684;&#x6700;&#x540E;&#x4E00;&#x5929;&#xFF09;&#x662F;&#x7531;&#x59D4;&#x5458;&#x4F1A;&#x5168;&#x4F53;&#x6295;&#x7968;&#x8868;&#x51B3;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x63D0;&#x6848;&#x5219;&#x662F;&#x57FA;&#x4E8E;&#x5728;&#x5951;&#x7EA6;&#x81EA;&#x8EAB;&#x4E2D;&#x89C4;&#x5B9A;&#x5951;&#x7EA6;&#x884C;&#x4E3A;&#x7684;&#x65B9;&#x6848;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>[[assert check_maybe_continue: x&gt;0]]</code> &#x548C; <code>[[assert assume: p!=nullptr]]</code>&#x3002;</p>
<p>&#x4E0E;&#x5176;&#x4F7F;&#x7528;&#x6784;&#x5EFA;&#x6A21;&#x5F0F;&#x53BB;&#x63A7;&#x5236;&#x6240;&#x6709;&#x5951;&#x7EA6;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x6FC0;&#x6D3B;&#x6240;&#x6709;&#x9ED8;&#x8BA4;&#x5951;&#x7EA6;&#x6216;&#x5173;&#x95ED;&#x6240;&#x6709;&#x57FA;&#x4E8E;&#x5951;&#x7EA6;&#x7684;&#x8FD0;&#x884C;&#x671F;&#x68C0;&#x67E5;&#xFF09;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F60;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x4FEE;&#x6539;&#x5355;&#x4E2A;&#x5951;&#x7EA6;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B0;&#x65B9;&#x6848;&#x4E0E;&#x5DE5;&#x4F5C;&#x6587;&#x4EF6;&#x4E2D;&#x51B3;&#x8BAE;&#x901A;&#x8FC7;&#x7684;&#x8BBE;&#x8BA1;&#x5927;&#x76F8;&#x5F84;&#x5EAD;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-cpp">[[assert assume: p!=<span class="hljs-literal">nullptr</span>]]
</code></pre>
<p>&#x8FD9;&#x5C06;&#x4F7F;&#x5F97; 2014 &#x5E74;&#x88AB;&#x5426;&#x51B3;&#x7684;&#x57FA;&#x4E8E;&#x5B8F;&#x7684;&#x65B9;&#x6848;&#x5377;&#x571F;&#x91CD;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x53D8;&#x5316;&#x7684;&#x663E;&#x7136;&#x65B9;&#x5F0F;&#x662F;&#x7528;&#x5B8F;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-cpp">[[assert MODE1: p!=<span class="hljs-literal">nullptr</span>]]
</code></pre>
<p>&#x8FD9;&#x91CC;&#x7684; <code>MODE1</code> &#x53EF;&#x4EE5;&#x88AB; <code>#define</code> &#x6210;&#x6240;&#x652F;&#x6301;&#x7684;&#x82E5;&#x5E72;&#x9009;&#x9879;&#x4E4B;&#x4E00;&#xFF0C;&#x5982; <code>assume</code> &#x548C; <code>default</code>&#x3002;&#x6216;&#x8005;&#xFF0C;&#x5927;&#x81F4;&#x7B49;&#x6548;&#x5730;&#xFF0C;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;&#x547D;&#x4EE4;&#x884C;&#x5B8F;&#xFF09;&#x6765;&#x5B9A;&#x4E49;&#x8BF8;&#x5982; <code>assume</code> &#x4E4B;&#x7C7B;&#x7684;&#x9650;&#x5B9A;&#x7B26;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<p>&#x672C;&#x8D28;&#x4E0A;&#xFF0C;&#x5951;&#x7EA6;&#x8FDD;&#x7EA6;&#x540E;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4E0E;&#x7A0B;&#x5E8F;&#x5458;&#x5BF9;&#x5951;&#x7EA6;&#x542B;&#x4E49;&#x7684;&#x63A7;&#x5236;&#x7684;&#x4E24;&#x8005;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x5C06;&#x628A;&#x5951;&#x7EA6;&#x673A;&#x5236;&#x4ECE;&#x65AD;&#x8A00;&#x7CFB;&#x7EDF;&#x8F6C;&#x53D8;&#x4E3A;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x673A;&#x5236;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x63D0;&#x6848;&#x751A;&#x81F3;&#x5EFA;&#x8BAE;&#x653E;&#x5F03;&#x5BF9;&#x9759;&#x6001;&#x5206;&#x6790;&#x7684;&#x652F;&#x6301;&#x3002;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x7684;&#x63D0;&#x6848;&#x6709;&#x51E0;&#x5341;&#x4E2A;&#x53D8;&#x79CD;&#xFF0C;&#x5168;&#x90FD;&#x6765;&#x5F97;&#x592A;&#x665A;&#xFF0C;&#x6CA1;&#x4E00;&#x4E2A;&#x80FD;&#x589E;&#x8FDB;&#x5171;&#x8BC6;&#x3002;</p>
<p>&#x5927;&#x91CF;&#x6D8C;&#x5165;&#x7684;&#x65B0;&#x5947;&#x63D0;&#x6848;&#xFF08;&#x6765;&#x81EA; Bloomberg &#x56E2;&#x961F;&#x548C;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;[Berne 2019; Berne and Lakos 2019; Khlebnikov and Lakos 2019; Lakos 2019; Rosen et al. 2019]&#xFF09;&#x548C;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x63D0;&#x6848;&#x7684;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x963B;&#x788D;&#x4E86;&#x771F;&#x6B63;&#x5FC5;&#x9700;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x5373;&#x5BF9;&#x5DE5;&#x4F5C;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x8BBE;&#x8BA1;&#x73B0;&#x72B6;&#x8FDB;&#x884C;&#x95EE;&#x9898;&#x4FEE;&#x590D;&#x3002;&#x6B63;&#x5982;&#x6211;&#x66FE;&#x4E0D;&#x65AD;&#x8B66;&#x544A;&#x7684;&#x90A3;&#x6837;&#xFF08;&#x6BD4;&#x5982; [Stroustrup 2019c]&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F01;&#x56FE;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x5951;&#x7EA6;&#x7684;&#x63D0;&#x6848;&#x7684;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x5728; Nico Josuttis &#x7684;&#x63D0;&#x8BAE;&#x4E0B;&#xFF0C;&#x5951;&#x7EA6;&#x88AB;&#x4ECE; C++20 &#x4E2D;&#x79FB;&#x9664; [Josuttis et al. 2019b]&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x53BB;&#x5E74;&#x5173;&#x4E8E;&#x5951;&#x7EA6;&#x7684;&#x8BA8;&#x8BBA;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8C01;&#x90FD;&#x5F97;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4EBA;&#x53EA;&#x60F3;&#x8981;&#x6309;&#x4ED6;&#x4EEC;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x3002;&#x65B0;&#x7684;&#x7814;&#x7A76;&#x7EC4; SG21 &#x80FD;&#x5426;&#x4E3A; C++23 &#x6216; C++26 &#x4EA4;&#x4ED8;&#x67D0;&#x79CD;&#x80FD;&#x591F;&#x88AB;&#x66F4;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x65F6;&#x95F4;&#x5C06;&#x4F1A;&#x7ED9;&#x51FA;&#x7B54;&#x6848;&#x3002;</p>
<h3 id="962-&#x9759;&#x6001;&#x53CD;&#x5C04;">9.6.2 &#x9759;&#x6001;&#x53CD;&#x5C04;</h3>
<p>2013 &#x5E74;&#xFF0C;&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x201C;&#x53CD;&#x5C04;&#x201D;&#x7684;&#x7814;&#x7A76;&#x7EC4;&#xFF08;SG7&#xFF09;&#x6210;&#x7ACB;&#x4E86;&#xFF0C;&#x5E76;&#x53D1;&#x51FA;&#x4E86;&#x5F81;&#x96C6;&#x610F;&#x89C1;&#x7684;&#x547C;&#x5401; [Snyder and Carruth 2013]&#x3002;&#x6709;&#x4E00;&#x4E2A;&#x5E7F;&#x6CDB;&#x7684;&#x5171;&#x8BC6;&#xFF0C;&#x90A3;&#x5C31;&#x662F; C++ &#x9700;&#x8981;&#x9759;&#x6001;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x3002;&#x66F4;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x5199;&#x51FA;&#x80FD;&#x68C0;&#x67E5;&#x5B83;&#x81EA;&#x5DF1;&#x662F;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x57FA;&#x4E8E;&#x6B64;&#x5F80;&#x8BE5;&#x7A0B;&#x5E8F;&#x4E2D;&#x6CE8;&#x5165;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x7B80;&#x6D01;&#x7684;&#x4EE3;&#x7801;&#x66FF;&#x6362;&#x5197;&#x957F;&#x800C;&#x68D8;&#x624B;&#x7684;&#x6837;&#x677F;&#x4EE3;&#x7801;&#x3001;&#x5B8F;&#x548C;&#x8BED;&#x8A00;&#x5916;&#x7684;&#x751F;&#x6210;&#x5668;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x4E0B;&#x9762;&#x7684;&#x573A;&#x666F;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#xFF1A;I/O &#x6D41;&#x3001;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x3001;&#x6BD4;&#x8F83;&#x3001;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x548C;&#x7F51;&#x7EDC;&#x7684;&#x5C01;&#x9001;&#x5904;&#x7406;&#xFF08;marshalling&#xFF09;&#x3001;&#x6784;&#x5EFA;&#x548C;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x6620;&#x5C04;&#x3001;&#x679A;&#x4E3E;&#x7684;&#x201C;&#x5B57;&#x7B26;&#x4E32;&#x5316;&#x201D;&#x3001;&#x6D4B;&#x8BD5;&#x652F;&#x6301;&#xFF0C;&#x53CA;&#x5176;&#x4ED6;&#x7684;&#x66F4;&#x591A;&#x53EF;&#x80FD; [Chochl&#xED;k et al. 2017; Stroustrup 2018g]&#x3002;&#x53CD;&#x5C04;&#x7814;&#x7A76;&#x7EC4;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4E3A; C++20 &#x6216; C++23 &#x505A;&#x597D;&#x51C6;&#x5907;&#xFF1B;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A; C++17 &#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x73B0;&#x5B9E;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x666E;&#x904D;&#x8BA4;&#x540C;&#xFF0C;&#x4F9D;&#x8D56;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x59CB;&#x7EC8;&#x5B58;&#x5728;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x53CD;&#x5C04;/&#x5185;&#x7701;&#x65B9;&#x5F0F;&#x4E0D;&#x9002;&#x5408; C++&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x3001;&#x8BED;&#x8A00;&#x6784;&#x4EF6;&#x7684;&#x5B8C;&#x6574;&#x8868;&#x793A;&#x7684;&#x590D;&#x6742;&#x6027;&#x548C;&#x8FD0;&#x884C;&#x671F;&#x904D;&#x5386;&#x7684;&#x6210;&#x672C;&#x90FD;&#x4F1A;&#x662F;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F88;&#x5FEB;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x63D0;&#x6848; [Chochl&#xED;k 2014; Silva and Auresco 2014; Tomazos and Spertus 2014]&#xFF0C;&#x5E76;&#x4E14;&#xFF0C;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x6570;&#x5E74;&#x91CC;&#xFF0C;&#x7531; Chandler Carruth &#x4E3B;&#x6301;&#x7684;&#x7814;&#x7A76;&#x7EC4;&#x53EC;&#x5F00;&#x4E86;&#x591A;&#x6B21;&#x4F1A;&#x8BAE;&#x8BD5;&#x56FE;&#x51B3;&#x5B9A;&#x5176;&#x8303;&#x56F4;&#x548C;&#x65B9;&#x5411;&#x3002;&#x9009;&#x5B9A;&#x7684;&#x65B9;&#x5F0F;&#x57FA;&#x4E8E;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x4EE5;&#x7ECF;&#x5178;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x6765;&#x7EC4;&#x7EC7;&#xFF0C;&#x9700;&#x8981;&#x6CDB;&#x578B;&#x7684;&#x5730;&#x65B9;&#x7531;&#x6982;&#x5FF5;&#xFF08;<a href="06.html#6-&#x6982;&#x5FF5;">&#xA7;6</a>&#xFF09;&#x652F;&#x6301; [Chochl&#xED;k 2015; Chochl&#xED;k and Naumann 2016; Chochl&#xED;k et al. 2017]&#x3002;&#x8BE5;&#x65B9;&#x5F0F;&#x4E3B;&#x8981;&#x7531; Mat&#xF3;&#x161; Chochl&#xED;k&#x3001;Axel Naumann &#x548C; David Sankel &#x53D1;&#x5C55;&#x548C;&#x5B9E;&#x73B0;&#x3002;&#x7ED3;&#x679C;&#x4F5C;&#x4E3A;&#x4E00;&#x9879;&#x6280;&#x672F;&#x89C4;&#x8303;&#x5728; 2019 &#x5F97;&#x4EE5;&#x6279;&#x51C6; [Sankel 2018]&#x3002;</p>
<p>&#x5728;&#x9759;&#x6001;&#x53CD;&#x5C04;&#xFF08;&#x9884;&#x671F;&#x7684;&#xFF09;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x915D;&#x917F;&#x671F;&#x5185;&#xFF0C;&#x57FA;&#x4E8E; constexpr &#x51FD;&#x6570;&#xFF08;<a href="#933-&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x652F;&#x6301;">&#xA7;9.3.3</a>&#xFF09;&#x7684;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x7A33;&#x6B65;&#x53D1;&#x5C55;&#xFF0C;&#x6700;&#x7EC8;&#x51FA;&#x73B0;&#x4E86;&#x57FA;&#x4E8E;&#x51FD;&#x6570;&#x800C;&#x4E0D;&#x662F;&#x7C7B;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x9759;&#x6001;&#x53CD;&#x5C04;&#x7684;&#x63D0;&#x6848;&#x3002;&#x4E3B;&#x8981;&#x7684;&#x62E5;&#x62A4;&#x8005;&#x662F; Andrew Sutton&#x3001;Daveed Vandevoorde&#x3001;Herb Sutter &#x548C; Faisal Vali [Sutton and Sutter 2018; Sutton et al. 2018]&#x3002;&#x8BBE;&#x8BA1;&#x7126;&#x70B9;&#x8F6C;&#x79FB;&#x7684;&#x4E3B;&#x8981;&#x8BBA;&#x636E;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x7531;&#x4E8E;&#x5206;&#x6790;&#x548C;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x8FD9;&#x4E9B;&#x4E8B;&#x5929;&#x751F;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x5F0F;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x57FA;&#x4E8E; constexpr &#x51FD;&#x6570;&#x7684;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x5DF2;&#x7ECF;&#x53D1;&#x5C55;&#x5230;&#x5143;&#x7F16;&#x7A0B;&#x548C;&#x53CD;&#x5C04;&#x76F8;&#x7ED3;&#x5408;&#x7684;&#x5730;&#x6B65;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#xFF08;&#x6700;&#x5148;&#x7531; Daveed Vandevoorde &#x63D0;&#x51FA;&#xFF09;&#x662F;&#xFF0C;&#x7528;&#x4E8E;&#x51FD;&#x6570;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x8DDF;&#x7528;&#x4E8E;&#x7C7B;&#x578B;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x6BD4;&#x8D77;&#x6765;&#xFF0C;&#x4F1A;&#x66F4;&#x5C0F;&#x5DE7;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E5F;&#x66F4;&#x77ED;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x4F1A;&#x5C11;&#x5F97;&#x591A;&#xFF0C;&#x7F16;&#x8BD1;&#x8D77;&#x6765;&#x4E5F;&#x5FEB;&#x5F97;&#x591A;&#x3002;</p>
<p>2019 &#x5E74; 2 &#x6708;&#x5728;&#x79D1;&#x9686;&#x53EC;&#x5F00;&#x7684;&#x6807;&#x51C6;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF0C;David Sankel &#x548C; Michael Park &#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7ED3;&#x5408;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x4F18;&#x70B9;&#x7684;&#x8BBE;&#x8BA1; [Sankel and Vandevoorde 2019]&#x3002;&#x5728;&#x6700;&#x6839;&#x672C;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x7C7B;&#x578B;&#x5B58;&#x5728;&#x3002;&#x8FD9;&#x8FBE;&#x5230;&#x4E86;&#x6700;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x7F16;&#x8BD1;&#x5668;&#x5F00;&#x9500;&#x4E5F;&#x6700;&#x5C0F;&#x3002;</p>
<p>&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684;&#x8F6C;&#x6362;&#x6765;&#x5B9E;&#x73B0;&#xFF08;&#x4ECE;&#x5E95;&#x5C42;&#x7684;&#x5355;&#x4E00;&#x7C7B;&#x578B; <code>meta::info</code> &#x5230;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5982; <code>meta::type_</code> &#x548C; <code>meta::class_</code>&#xFF09;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E; [Sankel and Vandevoorde 2019] &#x7684;&#x4F8B;&#x5B50;&#x3002;&#x901A;&#x8FC7;&#x6982;&#x5FF5;&#x91CD;&#x8F7D;&#xFF08;<a href="06.html#632-&#x6982;&#x5FF5;&#x4F7F;&#x7528;">&#xA7;6.3.2</a>&#xFF09;&#xFF0C;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4ECE; <code>meta::info</code> &#x5230;&#x66F4;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x8F6C;&#x6362;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-cpp">namespace meta {
    consteval std::span&lt;type_&gt; get_member_types(class_ c) const;
}

struct baz {
    enum E { /*...*/ };
    class Buz{ /*...*/ };
    using Biz = int;
};

void print(meta::enum_);    // &#x6253;&#x5370;&#x4E00;&#x4E2A;&#x679A;&#x4E3E;&#x7C7B;&#x578B;
void print(meta::class_);   // &#x6253;&#x5370;&#x4E00;&#x4E2A;&#x7C7B;&#x7C7B;&#x578B;
void print(meta::type_);    // &#x6253;&#x5370;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;

void f()
{
    constexpr meta::class_ metaBaz = reflexpr(baz);
    template for (constexpr meta::type_ member : get_member_types(metaBaz))
        print(meta::most_derived(member));
}
</code></pre>
<p>&#x8FD9;&#x91CC;&#x5173;&#x952E;&#x7684;&#x65B0;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x662F; <code>reflexpr</code> &#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#xFF08;&#x5143;&#xFF09;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x63CF;&#x8FF0;&#x4E86;&#x5B83;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8FD8;&#x6709; <code>template for</code> [Sutton et al. 2019]&#xFF0C;&#x6839;&#x636E;&#x4E00;&#x4E2A;&#x5F02;&#x8D28;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x7684;&#x7C7B;&#x578B;&#x6269;&#x5C55;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4ECE;&#x800C;&#x904D;&#x5386;&#x8BE5;&#x7ED3;&#x6784;&#x7684;&#x5404;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x6709;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x5C06;&#x4EE3;&#x7801;&#x6CE8;&#x5165;&#x6B63;&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5728; C++23 &#x6216; C++26 &#x4E2D;&#x6210;&#x4E3A;&#x6807;&#x51C6;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5728;&#x53CD;&#x5C04;&#x65B9;&#x6848;&#x4E0A;&#x7684;&#x96C4;&#x5FC3;&#x52C3;&#x52C3;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x523A;&#x6FC0;&#x4E86;&#x7F16;&#x8BD1;&#x671F;&#x6C42;&#x503C;&#x529F;&#x80FD;&#x7684;&#x6539;&#x8FDB;&#xFF1A;</p>
<ul>
<li>&#x6807;&#x51C6;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x7279;&#x5F81;&#x96C6;&#xFF08;<a href="04.html#451-&#x5B9E;&#x73B0;&#x6280;&#x5DE7;">&#xA7;4.5.1</a>&#xFF09;</li>
<li>&#x6E90;&#x4EE3;&#x7801;&#x4F4D;&#x7F6E;&#x7684;&#x5B8F;&#xFF08;&#x5982; <code>__FILE__</code> &#x548C; <code>__LINE__</code>&#xFF09;&#x88AB;&#x5185;&#x5728;&#x673A;&#x5236;&#x6240;&#x66FF;&#x4EE3; [Douglas and Jabot 2019]</li>
<li>&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x7684;&#x529F;&#x80FD;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x4FDD;&#x7F16;&#x8BD1;&#x671F;&#x6C42;&#x503C;&#x7684; <code>consteval</code>&#xFF09;</li>
<li>&#x5C55;&#x5F00;&#x8BED;&#x53E5;&#xFF08;<code>template for</code>&#x2014;&#x2014;&#x5230; C++23 &#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x904D;&#x5386;&#x5143;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20; [Sutton et al. 2019]&#xFF09;&#x3002;</li>
</ul>
<blockquote id="fn_1">
<sup>1</sup>. &#x8BD1;&#x6CE8;&#xFF1A;Heap Allocation eLision Optimization<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="08.html" class="navigation navigation-prev " aria-label="Previous page: 8. C++17：大海迷航">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="10.html" class="navigation navigation-next " aria-label="Next page: 10. 2020 年的 C++">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"9. C++20：方向之争","level":"1.10","depth":1,"next":{"title":"10. 2020 年的 C++","level":"1.11","depth":1,"path":"10.md","ref":"10.md","articles":[]},"previous":{"title":"8. C++17：大海迷航","level":"1.9","depth":1,"path":"08.md","ref":"08.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"09.md","mtime":"2023-07-06T11:17:01.972Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-07-06T11:29:00.567Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

