
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Introduction · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="01.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    1. 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    2. 背景：C++ 的 1979–2006
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    3. C++ 标准委员会
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    4. C++11：感觉像是门新语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    5. C++14：完成 C++11
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    6. 概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    7. 错误处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="08.html">
            
                <a href="08.html">
            
                    
                    8. C++17：大海迷航
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="09.html">
            
                <a href="09.html">
            
                    
                    9. C++20：方向之争
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10. 2020 年的 C++
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11. 回顾
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Introduction</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5728;&#x7EB7;&#x7E41;&#x591A;&#x53D8;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x8301;&#x58EE;&#x6210;&#x957F;&#xFF1A;c-2006&#x2013;2020">&#x5728;&#x7EB7;&#x7E41;&#x591A;&#x53D8;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x8301;&#x58EE;&#x6210;&#x957F;&#xFF1A;C++ 2006&#x2013;2020</h1>
<p>&#x8FD9;&#x662F; C++ &#x4E4B;&#x7236; Bjarne Stroustrup &#x7684; <a href="https://www.stroustrup.com/hopl20main-p5-p-bfc9cd4--final.pdf" target="_blank">HOPL4 &#x8BBA;&#x6587;</a>&#x7684;&#x4E2D;&#x6587;&#x7248;&#x3002;</p>
<p><a href="https://dl.acm.org/conference/hopl" target="_blank">HOPL</a> &#x662F; History of Programming Languages&#xFF08;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5386;&#x53F2;&#xFF09;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x662F; <a href="https://www.acm.org/" target="_blank">ACM</a>&#xFF08;Association of Computing Machines&#xFF0C;&#x56FD;&#x9645;&#x8BA1;&#x7B97;&#x673A;&#x534F;&#x4F1A;&#xFF09;&#x65D7;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x4F1A;&#x8BAE;&#xFF0C;&#x7EA6;&#x6BCF;&#x5341;&#x4E94;&#x5E74;&#x4E3E;&#x529E;&#x4E00;&#x6B21;&#x3002;Bjarne &#x7684;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x662F;&#x4ED6;&#x4E3A; 2021 &#x5E74; <a href="https://hopl4.sigplan.org/" target="_blank">HOPL IV &#x4F1A;&#x8BAE;</a>&#x51C6;&#x5907;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x4E5F;&#x662F;&#x4ED6;&#x7684;&#x7B2C;&#x4E09;&#x7BC7; HOPL &#x8BBA;&#x6587;&#x3002;&#x5728;&#x8FD9;&#x4E09;&#x7BC7;&#x524D;&#x540E;&#x95F4;&#x9694;&#x8FD1;&#x4E09;&#x5341;&#x5E74;&#x7684;&#x8BBA;&#x6587;&#x91CC;&#xFF0C;Bjarne &#x8BB0;&#x5F55;&#x4E86; C++ &#x7684;&#x5B8C;&#x6574;&#x5386;&#x53F2;&#xFF0C;&#x4ECE; 1979 &#x5E74;&#x5230; 2020 &#x5E74;&#x3002;&#x8FD9;&#x7BC7; HOPL4 &#x8BBA;&#x6587;&#x5C24;&#x5176;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6DB5;&#x76D6;&#x4E86; C++98 &#x4E4B;&#x540E;&#x7684;&#x6240;&#x6709; C++ &#x7248;&#x672C;&#xFF0C;&#x4ECE; C++11 &#x76F4;&#x5230; C++20&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x66F4;&#x65E9;&#x671F;&#x7684;&#x5386;&#x53F2;&#x4E5F;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="https://www.stroustrup.com/papers.html" target="_blank">&#x4ED6;&#x7684;&#x5176;&#x4ED6; HOPL &#x8BBA;&#x6587;</a>&#xFF0C;&#x53CA;&#x4ED6;&#x5728; 1994 &#x5E74;&#x51FA;&#x7248;&#x7684;&#x300A;C++ &#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6F14;&#x5316;&#x300B;&#xFF08;<em>The Design and Evolution of C++</em>&#xFF09;&#x3002;</p>
<p>&#x9274;&#x4E8E;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x5BF9;&#x4E8E; C++ &#x4ECE;&#x4E1A;&#x8005;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;<a href="http://cpp-summit.org/" target="_blank">&#x5168;&#x7403; C++ &#x53CA;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x5927;&#x4F1A;</a>&#x7684;&#x4E3B;&#x529E;&#x65B9; <a href="http://boolan.com/" target="_blank">Boolan</a> &#x7EC4;&#x7EC7;&#x4E86;&#x4E00;&#x7FA4;&#x8BD1;&#x8005;&#xFF0C;&#x628A;&#x8FD9;&#x7BC7;&#x91CD;&#x8981;&#x8BBA;&#x6587;&#x7FFB;&#x8BD1;&#x6210;&#x4E86;&#x4E2D;&#x6587;&#xFF0C;&#x8BA9; C++ &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9; C++ &#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x548C;&#x5386;&#x53F2;&#x6709;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x8BBA;&#x6587;&#x7684;&#x5B8C;&#x6574;&#x6458;&#x8981;&#xFF1A;</p>
<blockquote>
<p>&#x5230; 2006 &#x5E74;&#x65F6;&#xFF0C;C++ &#x5DF2;&#x7ECF;&#x5728;&#x4E1A;&#x754C;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x4E86; 20 &#x5E74;&#x3002;&#x5B83;&#x65E2;&#x5305;&#x542B;&#x4E86;&#x81EA; 1970 &#x5E74;&#x4EE3;&#x521D;&#x5F15;&#x5165; C &#x8BED;&#x8A00;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x53C8;&#x5305;&#x542B;&#x4E86;&#x5728;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x521D;&#x4ECD;&#x5F88;&#x65B0;&#x9896;&#x7684;&#x7279;&#x6027;&#x3002;&#x4ECE; 2006 &#x5E74;&#x5230; 2020 &#x5E74;&#xFF0C;C++ &#x5F00;&#x53D1;&#x8005;&#x4EBA;&#x6570;&#x4ECE;&#x7EA6; 300 &#x4E07;&#x589E;&#x957F;&#x5230;&#x4E86;&#x7EA6; 450 &#x4E07;&#x3002;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x671F;&#x91CC;&#xFF0C;&#x6709;&#x65B0;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x6D8C;&#x73B0;&#x51FA;&#x6765;&#xFF0C;&#x6709;&#x786C;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x6F14;&#x53D8;&#xFF0C;&#x6709;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x53D8;&#x5F97;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x4E5F;&#x6709;&#x597D;&#x4E9B;&#x8BED;&#x8A00;&#x5728;&#x4E89;&#x593A;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#xFF0C;&#x80CC;&#x540E;&#x6709;&#x96C4;&#x539A;&#x7684;&#x8D44;&#x91D1;&#x652F;&#x6301;&#x548C;&#x4E13;&#x4E1A;&#x7684;&#x8425;&#x9500;&#x3002;C++&#x2014;&#x2014;&#x4E00;&#x79CD;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x5546;&#x4E1A;&#x652F;&#x6301;&#x7684;&#x3001;&#x8001;&#x5F97;&#x591A;&#x7684;&#x8BED;&#x8A00;&#x2014;&#x2014;&#x662F;&#x5982;&#x4F55;&#x5728;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x9762;&#x524D;&#x7EE7;&#x7EED;&#x8301;&#x58EE;&#x6210;&#x957F;&#x7684;&#xFF1F;</p>
<p>&#x672C;&#x6587;&#x91CD;&#x70B9;&#x5173;&#x6CE8; ISO C++ &#x6807;&#x51C6;&#x5728; 2011 &#x5E74;&#x3001;2014 &#x5E74;&#x3001;2017 &#x5E74;&#x548C; 2020 &#x5E74;&#x7684;&#x4FEE;&#x8BA2;&#x7248;&#x4E2D;&#x7684;&#x91CD;&#x5927;&#x53D8;&#x5316;&#x3002;&#x6807;&#x51C6;&#x5E93;&#x5728;&#x7BC7;&#x5E45;&#x4E0A;&#x7EA6;&#x5360; C++20 &#x6807;&#x51C6;&#x7684;&#x56DB;&#x5206;&#x4E4B;&#x4E09;&#xFF0C;&#x4F46;&#x672C;&#x6587;&#x7684;&#x4E3B;&#x8981;&#x91CD;&#x70B9;&#x4ECD;&#x662F;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x548C;&#x5B83;&#x4EEC;&#x6240;&#x652F;&#x6301;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x3002;</p>
<p>&#x672C;&#x6587;&#x5305;&#x542B;&#x4E86;&#x957F;&#x957F;&#x7684;&#x7279;&#x6027;&#x6E05;&#x5355;&#xFF0C;&#x5176;&#x4E2D;&#x8BB0;&#x5F55;&#x4E86; C++ &#x7684;&#x6210;&#x957F;&#x3002;&#x6211;&#x4F1A;&#x5BF9;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x8981;&#x70B9;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF0C;&#x5E76;&#x7528;&#x7B80;&#x77ED;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x52A0;&#x4EE5;&#x8BF4;&#x660E;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x672C;&#x6587;&#x8FD8;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E9B;&#x5931;&#x8D25;&#x7684;&#x63D0;&#x6848;&#xFF0C;&#x4EE5;&#x53CA;&#x5BFC;&#x81F4;&#x5176;&#x5931;&#x8D25;&#x7684;&#x8BA8;&#x8BBA;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x89C6;&#x89D2;&#xFF0C;&#x5982;&#x4F55;&#x770B;&#x5F85;&#x8FD9;&#x4E9B;&#x5E74;&#x6765;&#x4EE4;&#x4EBA;&#x773C;&#x82B1;&#x7F2D;&#x4E71;&#x7684;&#x4E8B;&#x5B9E;&#x548C;&#x7279;&#x6027;&#x3002;&#x6211;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x5851;&#x9020;&#x8BED;&#x8A00;&#x7684;&#x60F3;&#x6CD5;&#x3001;&#x4EBA;&#x548C;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x8BA8;&#x8BBA;&#x4E3B;&#x9898;&#x5305;&#x62EC;&#x5404;&#x79CD;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;&#x901A;&#x8FC7;&#x6F14;&#x8FDB;&#x5F0F;&#x53D8;&#x5316;&#x4FDD;&#x7559; C++ &#x7684;&#x672C;&#x8D28;&#xFF0C;&#x7B80;&#x5316; C++ &#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x6539;&#x5584;&#x5BF9;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x66F4;&#x597D;&#x5730;&#x652F;&#x6301;&#x7F16;&#x8BD1;&#x671F;&#x7F16;&#x7A0B;&#xFF0C;&#x6269;&#x5C55;&#x5BF9;&#x5E76;&#x53D1;&#x548C;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4EE5;&#x53CA;&#x4FDD;&#x6301;&#x5BF9;&#x51E0;&#x5341;&#x5E74;&#x524D;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x7A33;&#x5B9A;&#x652F;&#x6301;&#x3002;</p>
<p>ISO C++ &#x6807;&#x51C6;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5171;&#x8BC6;&#x6D41;&#x7A0B;&#x6F14;&#x5316;&#x800C;&#x6765;&#x7684;&#x3002;&#x65E0;&#x53EF;&#x907F;&#x514D;&#xFF0C;&#x5728;&#x65B9;&#x5411;&#x3001;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x548C;&#x539F;&#x5219;&#x65B9;&#x9762;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x63D0;&#x6848;&#x95F4;&#x5B58;&#x5728;&#x7ADE;&#x4E89;&#x548C;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x793C;&#x8C8C;&#x6027;&#x7684;&#xFF09;&#x51B2;&#x7A81;&#x3002;&#x59D4;&#x5458;&#x4F1A;&#x73B0;&#x5728;&#x6BD4;&#x4EE5;&#x5F80;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x66F4;&#x5927;&#x3001;&#x66F4;&#x6D3B;&#x8DC3;&#xFF0C;&#x6BCF;&#x5E74;&#x6709;&#x591A;&#x8FBE; 250 &#x4EBA;&#x53C2;&#x52A0;&#x4E09;&#x6B21;&#x4E3A;&#x671F;&#x4E00;&#x5468;&#x7684;&#x4F1A;&#x8BAE;&#xFF0C;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x4EE5;&#x7535;&#x5B50;&#x65B9;&#x5F0F;&#x53C2;&#x52A0;&#x3002;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#xFF08;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6210;&#x529F;&#xFF09;&#x51CF;&#x8F7B;&#x5404;&#x79CD;&#x4E0D;&#x826F;&#x5F71;&#x54CD;&#xFF0C;&#x5305;&#x62EC;&#x201C;&#x59D4;&#x5458;&#x4F1A;&#x8BBE;&#x8BA1;&#x201D;&#x3001;&#x5B98;&#x50DA;&#x4E3B;&#x4E49;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x65F6;&#x5C1A;&#x7684;&#x8FC7;&#x5EA6;&#x70ED;&#x8877;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x7684;&#x8BED;&#x8A00;&#x6280;&#x672F;&#x8BDD;&#x9898;&#x5305;&#x62EC;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x3001;&#x5E76;&#x53D1;&#x5E76;&#x884C;&#x3001;&#x7F16;&#x8BD1;&#x671F;&#x8BA1;&#x7B97;&#x3001;&#x79FB;&#x52A8;&#x8BED;&#x4E49;&#x3001;&#x5F02;&#x5E38;&#x3001;lambda &#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x6A21;&#x5757;&#x3002;&#x8981;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x673A;&#x5236;&#x6765;&#x6307;&#x5B9A;&#x6A21;&#x677F;&#x5BF9;&#x5176;&#x53C2;&#x6570;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x65E2;&#x8DB3;&#x591F;&#x7075;&#x6D3B;&#x548C;&#x7CBE;&#x786E;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x589E;&#x52A0;&#x8FD0;&#x884C;&#x671F;&#x5F00;&#x9500;&#xFF0C;&#x5B9E;&#x8DF5;&#x8BC1;&#x660E;&#x8FD9;&#x5F88;&#x56F0;&#x96BE;&#x3002;&#x8BBE;&#x8BA1;&#x201C;&#x6982;&#x5FF5;&#x201D;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230; 1980 &#x5E74;&#x4EE3;&#xFF0C;&#x5E76;&#x89E6;&#x53CA;&#x5230; C++ &#x548C;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x7684;&#x8BB8;&#x591A;&#x5173;&#x952E;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6587;&#x4E2D;&#x7684;&#x63CF;&#x8FF0;&#x57FA;&#x4E8E;&#x4E2A;&#x4EBA;&#x5BF9;&#x5173;&#x952E;&#x4E8B;&#x4EF6;&#x548C;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x7684;&#x53C2;&#x4E0E;&#xFF0C;&#x5E76;&#x4EE5; ISO C++ &#x6807;&#x51C6;&#x59D4;&#x5458;&#x4F1A;&#x6863;&#x6848;&#x4E2D;&#x7684;&#x6570;&#x5343;&#x7BC7;&#x8BBA;&#x6587;&#x548C;&#x6570;&#x767E;&#x4EFD;&#x4F1A;&#x8BAE;&#x8BB0;&#x5F55;&#x4F5C;&#x4E3A;&#x652F;&#x6301;&#x3002;</p>
</blockquote>
<h2 id="&#x53C2;&#x52A0;&#x8BBA;&#x6587;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#x7684;&#x8BD1;&#x8005;&#x6709;&#xFF08;&#x6309;&#x62FC;&#x97F3;&#x5E8F;&#xFF09;&#xFF1A;">&#x53C2;&#x52A0;&#x8BBA;&#x6587;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#x7684;&#x8BD1;&#x8005;&#x6709;&#xFF08;&#x6309;&#x62FC;&#x97F3;&#x5E8F;&#xFF09;&#xFF1A;</h2>
<ul>
<li>&#x9648;&#x5E38;&#x7B60;</li>
<li>&#x9AD8;&#x8F89;</li>
<li>&#x4F55;&#x8363;&#x534E;</li>
<li>&#x4F55;&#x4E00;&#x5A1C;</li>
<li>&#x4FAF;&#x6668;</li>
<li>&#x4FAF;&#x91D1;&#x4EAD;</li>
<li>&#x5F6D;&#x4E9A;</li>
<li>&#x738B;&#x594E;</li>
<li>&#x738B;&#x7ECD;&#x65B0;</li>
<li>&#x5434;&#x548F;&#x709C;</li>
<li>&#x5F90;&#x5B81;</li>
<li>&#x6768;&#x6587;&#x6CE2;</li>
<li>&#x4E8E;&#x6CE2;</li>
<li>&#x4F59;&#x6C34;&#x6E05;</li>
<li>&#x7FDF;&#x534E;&#x660E;</li>
<li>&#x7AE0;&#x7231;&#x56FD;</li>
<li>&#x5F20;&#x4E91;&#x6F6E;</li>
</ul>
<p>&#x8BBA;&#x6587;&#x7FFB;&#x8BD1;&#x7684;&#x6821;&#x5BF9;&#x548C;&#x4F53;&#x4F8B;&#x7EDF;&#x4E00;&#x5DE5;&#x4F5C;&#x7531;&#x5434;&#x548F;&#x709C;&#x3001;&#x6768;&#x6587;&#x6CE2;&#x3001;&#x5F20;&#x4E91;&#x6F6E;&#x5B8C;&#x6210;&#x3002;&#x6700;&#x540E;&#x7684;&#x53D1;&#x5E03;&#x7531;&#x5434;&#x548F;&#x709C;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7FFB;&#x8BD1;&#x7684;&#x662F;&#x8BBA;&#x6587;&#x7684;&#x6B63;&#x6587;&#x90E8;&#x5206;&#xFF0C;&#x82F1;&#x6587;&#x539F;&#x6587;&#x8D85;&#x8FC7; 140 &#x9875;&#x3002;&#x6700;&#x540E;&#x7684;&#x53C2;&#x8003;&#x6587;&#x732E;&#x90E8;&#x5206;&#xFF0C;&#x7531;&#x4E8E;&#x7FFB;&#x8BD1;&#x7684;&#x610F;&#x4E49;&#x4E0D;&#x5927;&#xFF0C;&#x6CA1;&#x6709;&#x8BD1;&#x51FA;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x8D1F;&#x9762;&#x540E;&#x679C;&#xFF1A;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5BF9;&#x8BBA;&#x6587;&#x5185;&#x90E8;&#x7684;&#x4EA4;&#x53C9;&#x5F15;&#x7528;&#x53EF;&#x4EE5;&#x7528;&#x811A;&#x672C;&#x751F;&#x6210;&#x94FE;&#x63A5;&#xFF0C;&#x4F46;&#x5BF9;&#x6307;&#x5411;&#x53C2;&#x8003;&#x6587;&#x732E;&#x7684;&#x94FE;&#x63A5;&#x5C31;&#x5B8C;&#x5168;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x9605;&#x8BFB;&#x53C2;&#x8003;&#x6587;&#x732E;&#x7684;&#x8BDD;&#xFF0C;&#x53EA;&#x80FD;&#x8BF7;&#x4F60;&#x5230;<a href="https://www.stroustrup.com/hopl20main-p5-p-bfc9cd4--final.pdf" target="_blank">&#x82F1;&#x6587;&#x539F;&#x6587;</a>&#x7ED3;&#x5C3E;&#x7684; References &#x90E8;&#x5206;&#x81EA;&#x884C;&#x67E5;&#x627E;&#x4E86;&#x3002;</p>
<p>&#x7FFB;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x539F;&#x6587;&#x4E2D;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5728;&#x8BD1;&#x6587;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x6B63;&#x6216;&#x6807;&#x6CE8;&#xFF08;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x7ECF;&#x8FC7; Bjarne &#x8001;&#x7237;&#x5B50;&#x786E;&#x8BA4;&#xFF09;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x7FFB;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F15;&#x5165;&#x7FFB;&#x8BD1;&#x9519;&#x8BEF;&#x6216;&#x5176;&#x4ED6;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x6050;&#x6015;&#x4E5F;&#x5728;&#x6240;&#x96BE;&#x514D;&#x2014;&#x2014;&#x4E0D;&#x8FC7;&#xFF0C;&#x8DDF; ACM &#x4E0A;&#x53D1;&#x8868;&#x8BBA;&#x6587;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x9875;&#x4ECD;&#x7136;&#x662F;&#x53EF;&#x4EE5;&#x4FEE;&#x6B63;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#xFF0C;&#x4EB2;&#x7231;&#x7684;&#x8BFB;&#x8005;&#xFF0C;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x8BDD;&#xFF0C;&#x8BF7;&#x4E0D;&#x541D;&#x63D0;&#x4EA4; pull request&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5C3D;&#x5FEB;&#x68C0;&#x67E5;&#x5E76;&#x8FDB;&#x884C;&#x4FEE;&#x6B63;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="01.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 1. 前言">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introduction","level":"1.1","depth":1,"next":{"title":"1. 前言","level":"1.2","depth":1,"path":"01.md","ref":"01.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2023-07-06T11:20:17.680Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-07-06T11:29:00.567Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

